{
  "keyword": "block chain",
  "repository_count": 110,
  "analysis_date": "2025-08-27T09:39:00.999131",
  "charts": {
    "language_distribution": {
      "data": {
        "total_languages": 6,
        "language_distribution": {
          "Python": 30,
          "Go": 20,
          "Java": 20,
          "TypeScript": 20,
          "JavaScript": 10,
          "Rust": 10
        },
        "language_stars": {
          "JavaScript": 0,
          "Go": 0,
          "Python": 0,
          "Java": 0,
          "Rust": 0,
          "TypeScript": 0
        },
        "language_avg_stars": {
          "JavaScript": 0.0,
          "Go": 0.0,
          "Python": 0.0,
          "Java": 0.0,
          "Rust": 0.0,
          "TypeScript": 0.0
        },
        "top_languages": [
          [
            "Python",
            30
          ],
          [
            "Go",
            20
          ],
          [
            "Java",
            20
          ],
          [
            "TypeScript",
            20
          ],
          [
            "JavaScript",
            10
          ],
          [
            "Rust",
            10
          ]
        ],
        "analyzed_at": "2025-08-27T09:39:00.916743"
      }
    },
    "stars_distribution": {
      "data": {
        "mean": 94.1,
        "min": 6,
        "max": 4538,
        "total": 0
      }
    },
    "common_packages": {
      "data": {
        "pip": 90,
        "setuptools": 60,
        "wheel": 60,
        "maven": 40,
        "gradle": 40,
        "npm": 30,
        "yarn": 20,
        "node": 20
      }
    },
    "imported_libraries": {
      "data": {
        "requests": 90,
        "numpy": 60,
        "pandas": 60,
        "spring": 40,
        "junit": 40,
        "react": 30,
        "flask": 30,
        "django": 30,
        "tensorflow": 30,
        "scikit-learn": 30,
        "lodash": 20,
        "axios": 20,
        "jackson": 20,
        "hibernate": 20,
        "apache-commons": 20
      }
    },
    "common_functions": {
      "data": {}
    },
    "tag_analysis": {
      "data": {
        "total_topics": 26,
        "topic_distribution": {
          "ai": 110,
          "go": 12,
          "java": 11,
          "python": 10,
          "api": 7,
          "tool": 6,
          "rust": 6,
          "web": 5,
          "javascript": 3,
          "ios": 3,
          "rest": 3,
          "library": 3,
          "angular": 2,
          "android": 2,
          "mobile": 2,
          "cloud": 2,
          "framework": 2,
          "graphql": 2,
          "database": 2,
          "frontend": 2,
          "tensorflow": 1,
          "react": 1,
          "flutter": 1,
          "aws": 1,
          "sql": 1,
          "typescript": 1
        },
        "top_topics": [
          [
            "ai",
            110
          ],
          [
            "go",
            12
          ],
          [
            "java",
            11
          ],
          [
            "python",
            10
          ],
          [
            "api",
            7
          ],
          [
            "tool",
            6
          ],
          [
            "rust",
            6
          ],
          [
            "web",
            5
          ],
          [
            "javascript",
            3
          ],
          [
            "ios",
            3
          ],
          [
            "rest",
            3
          ],
          [
            "library",
            3
          ],
          [
            "angular",
            2
          ],
          [
            "android",
            2
          ],
          [
            "mobile",
            2
          ],
          [
            "cloud",
            2
          ],
          [
            "framework",
            2
          ],
          [
            "graphql",
            2
          ],
          [
            "database",
            2
          ],
          [
            "frontend",
            2
          ]
        ],
        "analyzed_at": "2025-08-27T09:39:00.922742"
      }
    }
  },
  "trends": {
    "libraries": {
      "requests": {
        "trend": "上升",
        "growth": "+15%",
        "usage_count": 90,
        "popularity": "高"
      },
      "numpy": {
        "trend": "上升",
        "growth": "+15%",
        "usage_count": 60,
        "popularity": "高"
      },
      "pandas": {
        "trend": "上升",
        "growth": "+15%",
        "usage_count": 60,
        "popularity": "高"
      },
      "spring": {
        "trend": "上升",
        "growth": "+15%",
        "usage_count": 40,
        "popularity": "高"
      },
      "junit": {
        "trend": "上升",
        "growth": "+15%",
        "usage_count": 40,
        "popularity": "高"
      },
      "react": {
        "trend": "上升",
        "growth": "+15%",
        "usage_count": 30,
        "popularity": "高"
      },
      "flask": {
        "trend": "上升",
        "growth": "+15%",
        "usage_count": 30,
        "popularity": "高"
      },
      "django": {
        "trend": "上升",
        "growth": "+15%",
        "usage_count": 30,
        "popularity": "高"
      },
      "tensorflow": {
        "trend": "上升",
        "growth": "+15%",
        "usage_count": 30,
        "popularity": "高"
      },
      "scikit-learn": {
        "trend": "上升",
        "growth": "+15%",
        "usage_count": 30,
        "popularity": "高"
      },
      "lodash": {
        "trend": "上升",
        "growth": "+15%",
        "usage_count": 20,
        "popularity": "高"
      },
      "axios": {
        "trend": "上升",
        "growth": "+15%",
        "usage_count": 20,
        "popularity": "高"
      },
      "jackson": {
        "trend": "上升",
        "growth": "+15%",
        "usage_count": 20,
        "popularity": "高"
      },
      "hibernate": {
        "trend": "上升",
        "growth": "+15%",
        "usage_count": 20,
        "popularity": "高"
      },
      "apache-commons": {
        "trend": "上升",
        "growth": "+15%",
        "usage_count": 20,
        "popularity": "高"
      }
    },
    "packages": {
      "pip": {
        "trend": "稳定",
        "growth": "+8%",
        "usage_count": 90,
        "popularity": "高"
      },
      "setuptools": {
        "trend": "稳定",
        "growth": "+8%",
        "usage_count": 60,
        "popularity": "高"
      },
      "wheel": {
        "trend": "稳定",
        "growth": "+8%",
        "usage_count": 60,
        "popularity": "高"
      },
      "maven": {
        "trend": "稳定",
        "growth": "+8%",
        "usage_count": 40,
        "popularity": "高"
      },
      "gradle": {
        "trend": "稳定",
        "growth": "+8%",
        "usage_count": 40,
        "popularity": "高"
      },
      "npm": {
        "trend": "稳定",
        "growth": "+8%",
        "usage_count": 30,
        "popularity": "高"
      },
      "yarn": {
        "trend": "稳定",
        "growth": "+8%",
        "usage_count": 20,
        "popularity": "高"
      },
      "node": {
        "trend": "稳定",
        "growth": "+8%",
        "usage_count": 20,
        "popularity": "高"
      }
    },
    "functions": {}
  },
  "repositories": [
    {
      "id": 1667,
      "name": "BlockChain",
      "full_name": "itheima1/BlockChain",
      "owner": "itheima1",
      "description": "黑马程序员 120天全栈区块链开发 开源教程",
      "url": "https://github.com/itheima1/BlockChain",
      "language": "JavaScript",
      "stars": 4538,
      "forks": 1231,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.584000",
      "updated_at": "2025-08-27T09:38:57.584000",
      "trend_date": "2025-08-27T09:38:57.584000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.585000"
    },
    {
      "id": 1668,
      "name": "BlockChainVoting",
      "full_name": "mehtaAnsh/BlockChainVoting",
      "owner": "mehtaAnsh",
      "description": "A blockchain based E-voting system",
      "url": "https://github.com/mehtaAnsh/BlockChainVoting",
      "language": "JavaScript",
      "stars": 409,
      "forks": 157,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.585000",
      "updated_at": "2025-08-27T09:38:57.585000",
      "trend_date": "2025-08-27T09:38:57.585000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.585000"
    },
    {
      "id": 1707,
      "name": "blockatlas",
      "full_name": "trustwallet/blockatlas",
      "owner": "trustwallet",
      "description": "Clean and lightweight cross-chain transaction API",
      "url": "https://github.com/trustwallet/blockatlas",
      "language": "Go",
      "stars": 376,
      "forks": 230,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.601000",
      "updated_at": "2025-08-27T09:38:57.601000",
      "trend_date": "2025-08-27T09:38:57.601000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.601000"
    },
    {
      "id": 1620,
      "name": "voting-system-using-block-chain",
      "full_name": "akverma26/voting-system-using-block-chain",
      "owner": "akverma26",
      "description": "Final Year Major Project",
      "url": "https://github.com/akverma26/voting-system-using-block-chain",
      "language": "Python",
      "stars": 286,
      "forks": 47,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.543000",
      "updated_at": "2025-08-27T09:38:57.543000",
      "trend_date": "2025-08-27T09:38:57.543000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.546000"
    },
    {
      "id": 1669,
      "name": "twitter-block-chain",
      "full_name": "ceceradio/twitter-block-chain",
      "owner": "ceceradio",
      "description": "Chrome extension to block all users on a followers/following page.",
      "url": "https://github.com/ceceradio/twitter-block-chain",
      "language": "JavaScript",
      "stars": 246,
      "forks": 48,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.585000",
      "updated_at": "2025-08-27T09:38:57.585000",
      "trend_date": "2025-08-27T09:38:57.585000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.585000"
    },
    {
      "id": 1670,
      "name": "ethernal",
      "full_name": "tryethernal/ethernal",
      "owner": "tryethernal",
      "description": "Ethernal is a block explorer for EVM-based chains. In a few seconds, spin up a fully-featured explorer for your L1/L2 rollup/testnet. Compatible with Optimism, ZK, Anvil, Hardhat, Geth...",
      "url": "https://github.com/tryethernal/ethernal",
      "language": "JavaScript",
      "stars": 235,
      "forks": 58,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.586000",
      "updated_at": "2025-08-27T09:38:57.586000",
      "trend_date": "2025-08-27T09:38:57.586000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.586000"
    },
    {
      "id": 271,
      "name": "FTC-Skystone-Dark-Angels-Romania-2020",
      "full_name": "chrisneagu/FTC-Skystone-Dark-Angels-Romania-2020",
      "owner": "chrisneagu",
      "description": "NOTICE This repository contains the public FTC SDK for the SKYSTONE (2019-2020) competition season. If you are looking for the current season's FTC SDK software, please visit the new and permanent home of the public FTC SDK:  FtcRobotController repository  Welcome! This GitHub repository contains the source code that is used to build an Android app to control a FIRST Tech Challenge competition robot. To use this SDK, download/clone the entire project to your local computer.  Getting Started If you are new to robotics or new to the FIRST Tech Challenge, then you should consider reviewing the FTC Blocks Tutorial to get familiar with how to use the control system:        FTC Blocks Online Tutorial  Even if you are an advanced Java programmer, it is helpful to start with the FTC Blocks tutorial, and then migrate to the OnBot Java Tool or to Android Studio afterwards.  Downloading the Project If you are an Android Studio programmer, there are several ways to download this repo. Note that if you use the Blocks or OnBot Java Tool to program your robot, then you do not need to download this repository.  If you are a git user, you can clone the most current version of the repository:             git clone https://github.com/FIRST-Tech-Challenge/SKYSTONE.git  Or, if you prefer, you can use the \"Download Zip\" button available through the main repository page. Downloading the project as a .ZIP file will keep the size of the download manageable.  You can also download the project folder (as a .zip or .tar.gz archive file) from the Downloads subsection of the Releases page for this repository.  Once you have downloaded and uncompressed (if needed) your folder, you can use Android Studio to import the folder (\"Import project (Eclipse ADT, Gradle, etc.)\").  Getting Help User Documentation and Tutorials FIRST maintains online documentation with information and tutorials on how to use the FIRST Tech Challenge software and robot control system. You can access this documentation using the following link:        SKYSTONE Online Documentation  Note that the online documentation is an \"evergreen\" document that is constantly being updated and edited. It contains the most current information about the FIRST Tech Challenge software and control system.  Javadoc Reference Material The Javadoc reference documentation for the FTC SDK is now available online. Click on the following link to view the FTC SDK Javadoc documentation as a live website:        FTC Javadoc Documentation  Documentation for the FTC SDK is also included with this repository. There is a subfolder called \"doc\" which contains several subfolders:  The folder \"apk\" contains the .apk files for the FTC Driver Station and FTC Robot Controller apps. The folder \"javadoc\" contains the JavaDoc user documentation for the FTC SDK. Online User Forum For technical questions regarding the Control System or the FTC SDK, please visit the FTC Technology forum:        FTC Technology Forum  Release Information Version 5.5 (20200824-090813) Version 5.5 requires Android Studio 4.0 or later.  New features Adds support for calling custom Java classes from Blocks OpModes (fixes SkyStone issue #161). Classes must be in the org.firstinspires.ftc.teamcode package. Methods must be public static and have no more than 21 parameters. Parameters declared as OpMode, LinearOpMode, Telemetry, and HardwareMap are supported and the argument is provided automatically, regardless of the order of the parameters. On the block, the sockets for those parameters are automatically filled in. Parameters declared as char or java.lang.Character will accept any block that returns text and will only use the first character in the text. Parameters declared as boolean or java.lang.Boolean will accept any block that returns boolean. Parameters declared as byte, java.lang.Byte, short, java.lang.Short, int, java.lang.Integer, long, or java.lang.Long, will accept any block that returns a number and will round that value to the nearest whole number. Parameters declared as float, java.lang.Float, double, java.lang.Double will accept any block that returns a number. Adds telemetry API method for setting display format Classic Monospace HTML (certain tags only) Adds blocks support for switching cameras. Adds Blocks support for TensorFlow Object Detection with a custom model. Adds support for uploading a custom TensorFlow Object Detection model in the Manage page, which is especially useful for Blocks and OnBotJava users. Shows new Control Hub blink codes when the WiFi band is switched using the Control Hub's button (only possible on Control Hub OS 1.1.2) Adds new warnings which can be disabled in the Advanced RC Settings Mismatched app versions warning Unnecessary 2.4 GHz WiFi usage warning REV Hub is running outdated firmware (older than version 1.8.2) Adds support for Sony PS4 gamepad, and reworks how gamepads work on the Driver Station Removes preference which sets gamepad type based on driver position. Replaced with menu which allows specifying type for gamepads with unknown VID and PID Attempts to auto-detect gamepad type based on USB VID and PID If gamepad VID and PID is not known, use type specified by user for that VID and PID If gamepad VID and PID is not known AND the user has not specified a type for that VID and PID, an educated guess is made about how to map the gamepad Driver Station will now attempt to automatically recover from a gamepad disconnecting, and re-assign it to the position it was assigned to when it dropped If only one gamepad is assigned and it drops: it can be recovered If two gamepads are assigned, and have different VID/PID signatures, and only one drops: it will be recovered If two gamepads are assigned, and have different VID/PID signatures, and BOTH drop: both will be recovered If two gamepads are assigned, and have the same VID/PID signatures, and only one drops: it will be recovered If two gamepads are assigned, and have the same VID/PID signatures, and BOTH drop: neither will be recovered, because of the ambiguity of the gamepads when they re-appear on the USB bus. There is currently one known edge case: if there are two gamepads with the same VID/PID signature plugged in, but only one is assigned, and they BOTH drop, it's a 50-50 chance of which one will be chosen for automatic recovery to the assigned position: it is determined by whichever one is re-enumerated first by the USB bus controller. Adds landscape user interface to Driver Station New feature: practice timer with audio cues New feature (Control Hub only): wireless network connection strength indicator (0-5 bars) New feature (Control Hub only): tapping on the ping/channel display will switch to an alternate display showing radio RX dBm and link speed (tap again to switch back) The layout will NOT autorotate. You can switch the layout from the Driver Station's settings menu. Breaking changes Removes support for Android versions 4.4 through 5.1 (KitKat and Lollipop). The minSdkVersion is now 23. Removes the deprecated LinearOpMode methods waitOneFullHardwareCycle() and waitForNextHardwareCycle() Enhancements Handles RS485 address of Control Hub automatically The Control Hub is automatically given a reserved address Existing configuration files will continue to work All addresses in the range of 1-10 are still available for Expansion Hubs The Control Hub light will now normally be solid green, without blinking to indicate the address The Control Hub will not be shown on the Expansion Hub Address Change settings page Improves REV Hub firmware updater The user can now choose between all available firmware update files Version 1.8.2 of the REV Hub firmware is bundled into the Robot Controller app. Text was added to clarify that Expansion Hubs can only be updated via USB. Firmware update speed was reduced to improve reliability Allows REV Hub firmware to be updated directly from the Manage webpage Improves log viewer on Robot Controller Horizontal scrolling support (no longer word wrapped) Supports pinch-to-zoom Uses a monospaced font Error messages are highlighted New color scheme Attempts to force-stop a runaway/stuck OpMode without restarting the entire app Not all types of runaway conditions are stoppable, but if the user code attempts to talk to hardware during the runaway, the system should be able to capture it. Makes various tweaks to the Self Inspect screen Renames \"OS version\" entry to \"Android version\" Renames \"WiFi Direct Name\" to \"WiFi Name\" Adds Control Hub OS version, when viewing the report of a Control Hub Hides the airplane mode entry, when viewing the report of a Control Hub Removes check for ZTE Speed Channel Changer Shows firmware version for all Expansion and Control Hubs Reworks network settings portion of Manage page All network settings are now applied with a single click The WiFi Direct channel of phone-based Robot Controllers can now be changed from the Manage page WiFi channels are filtered by band (2.4 vs 5 GHz) and whether they overlap with other channels The current WiFi channel is pre-selected on phone-based Robot Controllers, and Control Hubs running OS 1.1.2 or later. On Control Hubs running OS 1.1.2 or later, you can choose to have the system automatically select a channel on the 5 GHz band Improves OnBotJava New light and dark themes replace the old themes (chaos, github, chrome,...) the new default theme is light and will be used when you first update to this version OnBotJava now has a tabbed editor Read-only offline mode Improves function of \"exit\" menu item on Robot Controller and Driver Station Now guaranteed to be fully stopped and unloaded from memory Shows a warning message if a LinearOpMode exists prematurely due to failure to monitor for the start condition Improves error message shown when the Driver Station and Robot Controller are incompatible with each other Driver Station OpMode Control Panel now disabled while a Restart Robot is in progress Disables advanced settings related to WiFi direct when the Robot Controller is a Control Hub. Tint phone battery icons on Driver Station when low/critical. Uses names \"Control Hub Portal\" and \"Control Hub\" (when appropriate) in new configuration files Improve I2C read performance Very large improvement on Control Hub; up to ~2x faster with small (e.g. 6 byte) reads Not as apparent on Expansion Hubs connected to a phone Update/refresh build infrastructure Update to 'androidx' support library from 'com.android.support:appcompat', which is end-of-life Update targetSdkVersion and compileSdkVersion to 28 Update Android Studio's Android plugin to latest Fix reported build timestamp in 'About' screen Add sample illustrating manual webcam use: ConceptWebcam Bug fixes Fixes SkyStone issue #248 Fixes SkyStone issue #232 and modifies bulk caching semantics to allow for cache-preserving MANUAL/AUTO transitions. Improves performance when REV 2M distance sensor is unplugged Improves readability of Toast messages on certain devices Allows a Driver Station to connect to a Robot Controller after another has disconnected Improves generation of fake serial numbers for UVC cameras which do not provide a real serial number Previously some devices would assign such cameras a serial of 0:0 and fail to open and start streaming Fixes ftc_app issue #638. Fixes a slew of bugs with the Vuforia camera monitor including: Fixes bug where preview could be displayed with a wonky aspect ratio Fixes bug where preview could be cut off in landscape Fixes bug where preview got totally messed up when rotating phone Fixes bug where crosshair could drift off target when using webcams Fixes issue in UVC driver on some devices (ftc_app 681) if streaming was started/stopped multiple times in a row Issue manifested as kernel panic on devices which do not have this kernel patch. On affected devices which do have the patch, the issue was manifest as simply a failure to start streaming. The Tech Team believes that the root cause of the issue is a bug in the Linux kernel XHCI driver. A workaround was implemented in the SDK UVC driver. Fixes bug in UVC driver where often half the frames from the camera would be dropped (e.g. only 15FPS delivered during a streaming session configured for 30FPS). Fixes issue where TensorFlow Object Detection would show results whose confidence was lower than the minimum confidence parameter. Fixes a potential exploitation issue of CVE-2019-11358 in OnBotJava Fixes changing the address of an Expansion Hub with additional Expansion Hubs connected to it Preserves the Control Hub's network connection when \"Restart Robot\" is selected Fixes issue where device scans would fail while the Robot was restarting Fix RenderScript usage Use androidx.renderscript variant: increased compatibility Use RenderScript in Java mode, not native: simplifies build Fixes webcam-frame-to-bitmap conversion problem: alpha channel wasn't being initialized, only R, G, & B Fixes possible arithmetic overflow in Deadline Fixes deadlock in Vuforia webcam support which could cause 5-second delays when stopping OpMode Version 5.4 (20200108-101156) Fixes SkyStone issue #88 Adds an inspection item that notes when a robot controller (Control Hub) is using the factory default password. Fixes SkyStone issue #61 Fixes SkyStone issue #142 Fixes ftc_app issue #417 by adding more current and voltage monitoring capabilities for REV Hubs. Fixes a crash sometimes caused by OnBotJava activity Improves OnBotJava autosave functionality ftc_app #738 Fixes system responsiveness issue when an Expansion Hub is disconnected Fixes issue where IMU initialization could prevent Op Modes from stopping Fixes issue where AndroidTextToSpeech.speak() would fail if it was called too early Adds telemetry.speak() methods and blocks, which cause the Driver Station (if also updated) to speak text Adds and improves Expansion Hub-related warnings Improves Expansion Hub low battery warning Displays the warning immediately after the hub reports it Specifies whether the condition is current or occurred temporarily during an OpMode run Displays which hubs reported low battery Displays warning when hub loses and regains power during an OpMode run Fixes the hub's LED pattern after this condition Displays warning when Expansion Hub is not responding to commands Specifies whether the condition is current or occurred temporarily during an OpMode run Clarifies warning when Expansion Hub is not present at startup Specifies that this condition requires a Robot Restart before the hub can be used. The hub light will now accurately reflect this state Improves logging and reduces log spam during these conditions Syncs the Control Hub time and timezone to a connected web browser programming the robot, if a Driver Station is not available. Adds bulk read functionality for REV Hubs A bulk caching mode must be set at the Hub level with LynxModule#setBulkCachingMode(). This applies to all relevant SDK hardware classes that reference that Hub. The following following Hub bulk caching modes are available: BulkCachingMode.OFF (default): All hardware calls operate as usual. Bulk data can read through LynxModule#getBulkData() and processed manually. BulkCachingMode.AUTO: Applicable hardware calls are served from a bulk read cache that is cleared/refreshed automatically to ensure identical commands don't hit the same cache. The cache can also be cleared manually with LynxModule#clearBulkCache(), although this is not recommended. (advanced users) BulkCachingMode.MANUAL: Same as BulkCachingMode.AUTO except the cache is never cleared automatically. To avoid getting stale data, the cache must be manually cleared at the beginning of each loop body or as the user deems appropriate. Removes PIDF Annotation values added in Rev 5.3 (to AndyMark, goBILDA and TETRIX motor configurations). The new motor types will still be available but their Default control behavior will revert back to Rev 5.2 Adds new ConceptMotorBulkRead sample Opmode to demonstrate and compare Motor Bulk-Read modes for reducing I/O latencies. Version 5.3 (20191004-112306) Fixes external USB/UVC webcam support Makes various bugfixes and improvements to Blocks page, including but not limited to: Many visual tweaks Browser zoom and window resize behave better Resizing the Java preview pane works better and more consistently across browsers The Java preview pane consistently gets scrollbars when needed The Java preview pane is hidden by default on phones Internet Explorer 11 should work Large dropdown lists display properly on lower res screens Disabled buttons are now visually identifiable as disabled A warning is shown if a user selects a TFOD sample, but their device is not compatible Warning messages in a Blocks op mode are now visible by default. Adds goBILDA 5201 and 5202 motors to Robot Configurator Adds PIDF Annotation values to AndyMark, goBILDA and TETRIX motor configurations. This has the effect of causing the RUN_USING_ENCODERS and RUN_TO_POSITION modes to use PIDF vs PID closed loop control on these motors. This should provide more responsive, yet stable, speed control. PIDF adds Feedforward control to the basic PID control loop. Feedforward is useful when controlling a motor's speed because it \"anticipates\" how much the control voltage must change to achieve a new speed set-point, rather than requiring the integrated error to change sufficiently. The PIDF values were chosen to provide responsive, yet stable, speed control on a lightly loaded motor. The more heavily a motor is loaded (drag or friction), the more noticable the PIDF improvement will be. Fixes startup crash on Android 10 Fixes ftc_app issue #712 (thanks to FROGbots-4634) Fixes ftc_app issue #542 Allows \"A\" and lowercase letters when naming device through RC and DS apps. Version 5.2 (20190905-083277) Fixes extra-wide margins on settings activities, and placement of the new configuration button Adds Skystone Vuforia image target data. Includes sample Skystone Vuforia Navigation op modes (Java). Includes sample Skystone Vuforia Navigation op modes (Blocks). Adds TensorFlow inference model (.tflite) for Skystone game elements. Includes sample Skystone TensorFlow op modes (Java). Includes sample Skystone TensorFlow op modes (Blocks). Removes older (season-specific) sample op modes. Includes 64-bit support (to comply with Google Play requirements). Protects against Stuck OpModes when a Restart Robot is requested. (Thanks to FROGbots-4634) (ftc_app issue #709) Blocks related changes: Fixes bug with blocks generated code when hardware device name is a java or javascript reserved word. Shows generated java code for blocks, even when hardware items are missing from the active configuration. Displays warning icon when outdated Vuforia and TensorFlow blocks are used (SkyStone issue #27) Version 5.1 (20190820-222104) Defines default PIDF parameters for the following motors: REV Core Hex Motor REV 20:1 HD Hex Motor REV 40:1 HD Hex Motor Adds back button when running on a device without a system back button (such as a Control Hub) Allows a REV Control Hub to update the firmware on a REV Expansion Hub via USB Fixes SkyStone issue #9 Fixes ftc_app issue #715 Prevents extra DS User clicks by filtering based on current state. Prevents incorrect DS UI state changes when receiving new OpMode list from RC Adds support for REV Color Sensor V3 Adds a manual-refresh DS Camera Stream for remotely viewing RC camera frames. To show the stream on the DS, initialize but do not run a stream-enabled opmode, select the Camera Stream option in the DS menu, and tap the image to refresh. This feature is automatically enabled when using Vuforia or TFOD—no additional RC configuration is required for typical use cases. To hide the stream, select the same menu item again. Note that gamepads are disabled and the selected opmode cannot be started while the stream is open as a safety precaution. To use custom streams, consult the API docs for CameraStreamServer#setSource and CameraStreamSource. Adds many Star Wars sounds to RobotController resources. Added SKYSTONE Sounds Chooser Sample Program. Switches out startup, connect chimes, and error/warning sounds for Star Wars sounds Updates OnBot Java to use a WebSocket for communication with the robot The OnBot Java page no longer has to do a full refresh when a user switches from editing one file to another Known issues:  Camera Stream The Vuforia camera stream inherits the issues present in the phone preview (namely ftc_app issue #574). This problem does not affect the TFOD camera stream even though it receives frames from Vuforia. The orientation of the stream frames may not always match the phone preview. For now, these frames may be rotated manually via a custom CameraStreamSource if desired. OnBotJava Browser back button may not always work correctly It's possible for a build to be queued, but not started. The OnBot Java build console will display a warning if this occurs. A user might not realize they are editing a different file if the user inadvertently switches from one file to another since this switch is now seamless. The name of the currently open file is displayed in the browser tab. Version 5.0 (built on 19.06.14) Support for the REV Robotics Control Hub. Adds a Java preview pane to the Blocks editor. Adds a new offline export feature to the Blocks editor. Display wifi channel in Network circle on Driver Station. Adds calibration for Logitech C270 Updates build tooling and target SDK. Compliance with Google's permissions infrastructure (Required after build tooling update). Keep Alives to mitigate the Motorola wifi scanning problem. Telemetry substitute no longer necessary. Improves Vuforia error reporting. Fixes ftctechnh/ftc_app issues 621, 713. Miscellaneous bug fixes and improvements. Version 4.3 (built on 18.10.31) Includes missing TensorFlow-related libraries and files. Version 4.2 (built on 18.10.30) Includes fix to avoid deadlock situation with WatchdogMonitor which could result in USB communication errors. Comm error appeared to require that user disconnect USB cable and restart the Robot Controller app to recover. robotControllerLog.txt would have error messages that included the words \"E RobotCore: lynx xmit lock: #### abandoning lock:\" Includes fix to correctly list the parent module address for a REV Robotics Expansion Hub in a configuration (.xml) file. Bug in versions 4.0 and 4.1 would incorrect list the address module for a parent REV Robotics device as \"1\". If the parent module had a higher address value than the daisy-chained module, then this bug would prevent the Robot Controller from communicating with the downstream Expansion Hub. Added requirement for ACCESS_COARSE_LOCATION to allow a Driver Station running Android Oreo to scan for Wi-Fi Direct devices. Added google() repo to build.gradle because aapt2 must be downloaded from the google() repository beginning with version 3.2 of the Android Gradle Plugin. Important Note: Android Studio users will need to be connected to the Internet the first time build the ftc_app project. Internet connectivity is required for the first build so the appropriate files can be downloaded from the Google repository. Users should not need to be connected to the Internet for subsequent builds. This should also fix buid issue where Android Studio would complain that it \"Could not find com.android.tools.lint:lint-gradle:26.1.4\" (or similar). Added support for REV Spark Mini motor controller as part of the configuration menu for a servo/PWM port on the REV Expansion Hub. Provide examples for playing audio files in an Op Mode. Block Development Tool Changes Includes a fix for a problem with the Velocity blocks that were reported in the FTC Technology forum (Blocks Programming subforum). Change the \"Save completed successfully.\" message to a white color so it will contrast with a green background. Fixed the \"Download image\" feature so it will work if there are text blocks in the op mode. Introduce support for Google's TensorFlow Lite technology for object detetion for 2018-2019 game. TensorFlow lite can recognize Gold Mineral and Silver Mineral from 2018-2019 game. Example Java and Block op modes are included to show how to determine the relative position of the gold block (left, center, right). Version 4.1 (released on 18.09.24) Changes include:  Fix to prevent crash when deprecated configuration annotations are used. Change to allow FTC Robot Controller APK to be auto-updated using FIRST Global Control Hub update scripts. Removed samples for non supported / non legal hardware. Improvements to Telemetry.addData block with \"text\" socket. Updated Blocks sample op mode list to include Rover Ruckus Vuforia example. Update SDK library version number. Version 4.0 (released on 18.09.12) Changes include:  Initial support for UVC compatible cameras  If UVC camera has a unique serial number, RC will detect and enumerate by serial number. If UVC camera lacks a unique serial number, RC will only support one camera of that type connected. Calibration settings for a few cameras are included (see TeamCode/src/main/res/xml/teamwebcamcalibrations.xml for details). User can upload calibration files from Program and Manage web interface. UVC cameras seem to draw a fair amount of electrical current from the USB bus. This does not appear to present any problems for the REV Robotics Control Hub. This does seem to create stability problems when using some cameras with an Android phone-based Robot Controller. FTC Tech Team is investigating options to mitigate this issue with the phone-based Robot Controllers. Updated sample Vuforia Navigation and VuMark Op Modes to demonstrate how to use an internal phone-based camera and an external UVC webcam. Support for improved motor control.  REV Robotics Expansion Hub firmware 1.8 and greater will support a feed forward mechanism for closed loop motor control. FTC SDK has been modified to support PIDF coefficients (proportional, integral, derivative, and feed forward). FTC Blocks development tool modified to include PIDF programming blocks. Deprecated older PID-related methods and variables. REV's 1.8.x PIDF-related changes provide a more linear and accurate way to control a motor. Wireless  Added 5GHz support for wireless channel changing for those devices that support it. Tested with Moto G5 and E4 phones. Also tested with other (currently non-approved) phones such as Samsung Galaxy S8. Improved Expansion Hub firmware update support in Robot Controller app  Changes to make the system more robust during the firmware update process (when performed through Robot Controller app). User no longer has to disconnect a downstream daisy-chained Expansion Hub when updating an Expansion Hub's firmware. If user is updating an Expansion Hub's firmware through a USB connection, he/she does not have to disconnect RS485 connection to other Expansion Hubs. The user still must use a USB connection to update an Expansion Hub's firmware. The user cannot update the Expansion Hub firmware for a downstream device that is daisy chained through an RS485 connection. If an Expansion Hub accidentally gets \"bricked\" the Robot Controller app is now more likely to recognize the Hub when it scans the USB bus. Robot Controller app should be able to detect an Expansion Hub, even if it accidentally was bricked in a previous update attempt. Robot Controller app should be able to install the firmware onto the Hub, even if if accidentally was bricked in a previous update attempt. Resiliency  FTC software can detect and enable an FTDI reset feature that is available with REV Robotics v1.8 Expansion Hub firmware and greater. When enabled, the Expansion Hub can detect if it hasn't communicated with the Robot Controller over the FTDI (USB) connection. If the Hub hasn't heard from the Robot Controller in a while, it will reset the FTDI connection. This action helps system recover from some ESD-induced disruptions. Various fixes to improve reliability of FTC software. Blocks  Fixed errors with string and list indices in blocks export to java. Support for USB connected UVC webcams. Refactored optimized Blocks Vuforia code to support Rover Ruckus image targets. Added programming blocks to support PIDF (proportional, integral, derivative and feed forward) motor control. Added formatting options (under Telemetry and Miscellaneous categories) so user can set how many decimal places to display a numerical value. Support to play audio files (which are uploaded through Blocks web interface) on Driver Station in addition to the Robot Controller. Fixed bug with Download Image of Blocks feature. Support for REV Robotics Blinkin LED Controller. Support for REV Robotics 2m Distance Sensor. Added support for a REV Touch Sensor (no longer have to configure as a generic digital device). Added blocks for DcMotorEx methods. These are enhanced methods that you can use when supported by the motor controller hardware. The REV Robotics Expansion Hub supports these enhanced methods. Enhanced methods include methods to get/set motor velocity (in encoder pulses per second), get/set PIDF coefficients, etc.. Modest Improvements in Logging  Decrease frequency of battery checker voltage statements. Removed non-FTC related log statements (wherever possible). Introduced a \"Match Logging\" feature. Under \"Settings\" a user can enable/disable this feature (it's disabled by default). If enabled, user provides a \"Match Number\" through the Driver Station user interface (top of the screen). The Match Number is used to create a log file specifically with log statements from that particular Op Mode run. Match log files are stored in /sdcard/FIRST/matlogs on the Robot Controller. Once an op mode run is complete, the Match Number is cleared. This is a convenient way to create a separate match log with statements only related to a specific op mode run. New Devices  Support for REV Robotics Blinkin LED Controller. Support for REV Robotics 2m Distance Sensor. Added configuration option for REV 20:1 HD Hex Motor. Added support for a REV Touch Sensor (no longer have to configure as a generic digital device). Miscellaneous  Fixed some errors in the definitions for acceleration and velocity in our javadoc documentation. Added ability to play audio files on Driver Station When user is configuring an Expansion Hub, the LED on the Expansion Hub will change blink pattern (purple-cyan) to indicate which Hub is currently being configured. Renamed I2cSensorType to I2cDeviceType. Added an external sample Op Mode that demonstrates localization using 2018-2019 (Rover Ruckus presented by QualComm) Vuforia targets. Added an external sample Op Mode that demonstrates how to use the REV Robotics 2m Laser Distance Sensor. Added an external sample Op Mode that demonstrates how to use the REV Robotics Blinkin LED Controller. Re-categorized external Java sample Op Modes to \"TeleOp\" instead of \"Autonomous\". Known issues:  Initial support for UVC compatible cameras  UVC cameras seem to draw significant amount of current from the USB bus. This does not appear to present any problems for the REV Robotics Control Hub. This does seem to create stability problems when using some cameras with an Android phone-based Robot Controller. FTC Tech Team is investigating options to mitigate this issue with the phone-based Robot Controllers. There might be a possible deadlock which causes the RC to become unresponsive when using a UVC webcam with a Nougat Android Robot Controller. Wireless  When user selects a wireless channel, this channel does not necessarily persist if the phone is power cycled. Tech Team is hoping to eventually address this issue in a future release. Issue has been present since apps were introduced (i.e., it is not new with the v4.0 release). Wireless channel is not currently displayed for WiFi Direct connections. Miscellaneous  The blink indication feature that shows which Expansion Hub is currently being configured does not work for a newly created configuration file. User has to first save a newly created configuration file and then close and re-edit the file in order for blink indicator to work. Version 3.6 (built on 17.12.18) Changes include:  Blocks Changes Uses updated Google Blockly software to allow users to edit their op modes on Apple iOS devices (including iPad and iPhone). Improvement in Blocks tool to handle corrupt op mode files. Autonomous op modes should no longer get switched back to tele-op after re-opening them to be edited. The system can now detect type mismatches during runtime and alert the user with a message on the Driver Station. Updated javadoc documentation for setPower() method to reflect correct range of values (-1 to +1). Modified VuforiaLocalizerImpl to allow for user rendering of frames Added a user-overrideable onRenderFrame() method which gets called by the class's renderFrame() method. Version 3.5 (built on 17.10.30) Changes with version 3.5 include:  Introduced a fix to prevent random op mode stops, which can occur after the Robot Controller app has been paused and then resumed (for example, when a user temporarily turns off the display of the Robot Controller phone, and then turns the screen back on). Introduced a fix to prevent random op mode stops, which were previously caused by random peer disconnect events on the Driver Station. Fixes issue where log files would be closed on pause of the RC or DS, but not re-opened upon resume. Fixes issue with battery handler (voltage) start/stop race. Fixes issue where Android Studio generated op modes would disappear from available list in certain situations. Fixes problem where OnBot Java would not build on REV Robotics Control Hub. Fixes problem where OnBot Java would not build if the date and time on the Robot Controller device was \"rewound\" (set to an earlier date/time). Improved error message on OnBot Java that occurs when renaming a file fails. Removed unneeded resources from android.jar binaries used by OnBot Java to reduce final size of Robot Controller app. Added MR_ANALOG_TOUCH_SENSOR block to Blocks Programming Tool. Version 3.4 (built on 17.09.06) Changes with version 3.4 include:  Added telemetry.update() statement for BlankLinearOpMode template. Renamed sample Block op modes to be more consistent with Java samples. Added some additional sample Block op modes. Reworded OnBot Java readme slightly. Version 3.3 (built on 17.09.04) This version of the software includes improves for the FTC Blocks Programming Tool and the OnBot Java Programming Tool.  Changes with verion 3.3 include:  Android Studio ftc_app project has been updated to use Gradle Plugin 2.3.3. Android Studio ftc_app project is already using gradle 3.5 distribution. Robot Controller log has been renamed to /sdcard/RobotControllerLog.txt (note that this change was actually introduced w/ v3.2). Improvements in I2C reliability. Optimized I2C read for REV Expansion Hub, with v1.7 firmware or greater. Updated all external/samples (available through OnBot and in Android project folder). Vuforia Added support for VuMarks that will be used for the 2017-2018 season game. Blocks Update to latest Google Blockly release. Sample op modes can be selected as a template when creating new op mode. Fixed bug where the blocks would disappear temporarily when mouse button is held down. Added blocks for Range.clip and Range.scale. User can now disable/enable Block op modes. Fix to prevent occasional Blocks deadlock. OnBot Java Significant improvements with autocomplete function for OnBot Java editor. Sample op modes can be selected as a template when creating new op mode. Fixes and changes to complete hardware setup feature. Updated (and more useful) onBot welcome message. Known issues:  Android Studio After updating to the new v3.3 Android Studio project folder, if you get error messages indicating \"InvalidVirtualFileAccessException\" then you might need to do a File->Invalidate Caches / Restart to clear the error. OnBot Java Sometimes when you push the build button to build all op modes, the RC returns an error message that the build failed. If you press the build button a second time, the build typically suceeds. Version 3.2 (built on 17.08.02) This version of the software introduces the \"OnBot Java\" Development Tool. Similar to the FTC Blocks Development Tool, the FTC OnBot Java Development Tool allows a user to create, edit and build op modes dynamically using only a Javascript-enabled web browser.  The OnBot Java Development Tool is an integrated development environment (IDE) that is served up by the Robot Controller. Op modes are created and edited using a Javascript-enabled browser (Google Chromse is recommended). Op modes are saved on the Robot Controller Android device directly.  The OnBot Java Development Tool provides a Java programming environment that does NOT need Android Studio.  Changes with version 3.2 include:  Enhanced web-based development tools  Introduction of OnBot Java Development Tool. Web-based programming and management features are \"always on\" (user no longer needs to put Robot Controller into programming mode). Web-based management interface (where user can change Robot Controller name and also easily download Robot Controller log file). OnBot Java, Blocks and Management features available from web based interface. Blocks Programming Development Tool:  Changed \"LynxI2cColorRangeSensor\" block to \"REV Color/range sensor\" block. Fixed tooltip for ColorSensor.isLightOn block. Added blocks for ColorSensor.getNormalizedColors and LynxI2cColorRangeSensor.getNormalizedColors. Added example op modes for digital touch sensor and REV Robotics Color Distance sensor.  User selectable color themes.  Includes many minor enhancements and fixes (too numerous to list).  Known issues:  Auto complete function is incomplete and does not support the following (for now): Access via this keyword Access via super keyword Members of the super cloass, not overridden by the class Any methods provided in the current class Inner classes Can't handle casted objects Any objects coming from an parenthetically enclosed expression Version 3.10 (built on 17.05.09) This version of the software provides support for the REV Robotics Expansion Hub. This version also includes improvements in the USB communication layer in an effort to enhance system resiliency. If you were using a 2.x version of the software previously, updating to version 3.1 requires that you also update your Driver Station software in addition to updating the Robot Controller software.  Also note that in version 3.10 software, the setMaxSpeed and getMaxSpeed methods are no longer available (not deprecated, they have been removed from the SDK). Also note that the the new 3.x software incorporates motor profiles that a user can select as he/she configures the robot.  Changes include:  Blocks changes Added VuforiaTrackableDefaultListener.getPose and Vuforia.trackPose blocks. Added optimized blocks support for Vuforia extended tracking. Added atan2 block to the math category. Added useCompetitionFieldTargetLocations parameter to Vuforia.initialize block. If set to false, the target locations are placed at (0,0,0) with target orientation as specified in https://github.com/gearsincorg/FTCVuforiaDemo/blob/master/Robot_Navigation.java tutorial op mode. Incorporates additional improvements to USB comm layer to improve system resiliency (to recover from a greater number of communication disruptions). Additional Notes Regarding Version 3.00 (built on 17.04.13)  In addition to the release changes listed below (see section labeled \"Version 3.00 (built on 17.04.013)\"), version 3.00 has the following important changes:  Version 3.00 software uses a new version of the FTC Robocol (robot protocol). If you upgrade to v3.0 on the Robot Controller and/or Android Studio side, you must also upgrade the Driver Station software to match the new Robocol. Version 3.00 software removes the setMaxSpeed and getMaxSpeed methods from the DcMotor class. If you have an op mode that formerly used these methods, you will need to remove the references/calls to these methods. Instead, v3.0 provides the max speed information through the use of motor profiles that are selected by the user during robot configuration. Version 3.00 software currently does not have a mechanism to disable extra i2c sensors. We hope to re-introduce this function with a release in the near future. Version 3.00 (built on 17.04.13) *** Use this version of the software at YOUR OWN RISK!!! ***  This software is being released as an \"alpha\" version. Use this version at your own risk!  This pre-release software contains SIGNIFICANT changes, including changes to the Wi-Fi Direct pairing mechanism, rewrites of the I2C sensor classes, changes to the USB/FTDI layer, and the introduction of support for the REV Robotics Expansion Hub and the REV Robotics color-range-light sensor. These changes were implemented to improve the reliability and resiliency of the FTC control system.  Please note, however, that version 3.00 is considered \"alpha\" code. This code is being released so that the FIRST community will have an opportunity to test the new REV Expansion Hub electronics module when it becomes available in May. The developers do not recommend using this code for critical applications (i.e., competition use).  *** Use this version of the software at YOUR OWN RISK!!! ***  Changes include:  Major rework of sensor-related infrastructure. Includes rewriting sensor classes to implement synchronous I2C communication. Fix to reset Autonomous timer back to 30 seconds. Implementation of specific motor profiles for approved 12V motors (includes Tetrix, AndyMark, Matrix and REV models). Modest improvements to enhance Wi-Fi P2P pairing. Fixes telemetry log addition race. Publishes all the sources (not just a select few). Includes Block programming improvements Addition of optimized Vuforia blocks. Auto scrollbar to projects and sounds pages. Fixed blocks paste bug. Blocks execute after while-opModeIsActive loop (to allow for cleanup before exiting op mode). Added gyro integratedZValue block. Fixes bug with projects page for Firefox browser. Added IsSpeaking block to AndroidTextToSpeech. Implements support for the REV Robotics Expansion Hub Implements support for integral REV IMU (physically installed on I2C bus 0, uses same Bosch BNO055 9 axis absolute orientation sensor as Adafruit 9DOF abs orientation sensor). - Implements support for REV color/range/light sensor. Provides support to update Expansion Hub firmware through FTC SDK. Detects REV firmware version and records in log file. Includes support for REV Control Hub (note that the REV Control Hub is not yet approved for FTC use). Implements FTC Blocks programming support for REV Expansion Hub and sensor hardware. Detects and alerts when I2C device disconnect. Version 2.62 (built on 17.01.07) Added null pointer check before calling modeToByte() in finishModeSwitchIfNecessary method for ModernRoboticsUsbDcMotorController class. Changes to enhance Modern Robotics USB protocol robustness. Version 2.61 (released on 16.12.19) Blocks Programming mode changes: Fix to correct issue when an exception was thrown because an OpticalDistanceSensor object appears twice in the hardware map (the second time as a LightSensor). Version 2.6 (released on 16.12.16) Fixes for Gyro class: Improve (decrease) sensor refresh latency. fix isCalibrating issues. Blocks Programming mode changes: Blocks now ignores a device in the configuration xml if the name is empty. Other devices work in configuration work fine. Version 2.5 (internal release on released on 16.12.13) Blocks Programming mode changes: Added blocks support for AdafruitBNO055IMU. Added Download Op Mode button to FtcBocks.html. Added support for copying blocks in one OpMode and pasting them in an other OpMode. The clipboard content is stored on the phone, so the programming mode server must be running. Modified Utilities section of the toolbox. In Programming Mode, display information about the active connections. Fixed paste location when workspace has been scrolled. Added blocks support for the android Accelerometer. Fixed issue where Blocks Upload Op Mode truncated name at first dot. Added blocks support for Android SoundPool. Added type safety to blocks for Acceleration. Added type safety to blocks for AdafruitBNO055IMU.Parameters. Added type safety to blocks for AnalogInput. Added type safety to blocks for AngularVelocity. Added type safety to blocks for Color. Added type safety to blocks for ColorSensor. Added type safety to blocks for CompassSensor. Added type safety to blocks for CRServo. Added type safety to blocks for DigitalChannel. Added type safety to blocks for ElapsedTime. Added type safety to blocks for Gamepad. Added type safety to blocks for GyroSensor. Added type safety to blocks for IrSeekerSensor. Added type safety to blocks for LED. Added type safety to blocks for LightSensor. Added type safety to blocks for LinearOpMode. Added type safety to blocks for MagneticFlux. Added type safety to blocks for MatrixF. Added type safety to blocks for MrI2cCompassSensor. Added type safety to blocks for MrI2cRangeSensor. Added type safety to blocks for OpticalDistanceSensor. Added type safety to blocks for Orientation. Added type safety to blocks for Position. Added type safety to blocks for Quaternion. Added type safety to blocks for Servo. Added type safety to blocks for ServoController. Added type safety to blocks for Telemetry. Added type safety to blocks for Temperature. Added type safety to blocks for TouchSensor. Added type safety to blocks for UltrasonicSensor. Added type safety to blocks for VectorF. Added type safety to blocks for Velocity. Added type safety to blocks for VoltageSensor. Added type safety to blocks for VuforiaLocalizer.Parameters. Added type safety to blocks for VuforiaTrackable. Added type safety to blocks for VuforiaTrackables. Added type safety to blocks for enums in AdafruitBNO055IMU.Parameters. Added type safety to blocks for AndroidAccelerometer, AndroidGyroscope, AndroidOrientation, and AndroidTextToSpeech. Version 2.4 (released on 16.11.13) Fix to avoid crashing for nonexistent resources. Blocks Programming mode changes: Added blocks to support OpenGLMatrix, MatrixF, and VectorF. Added blocks to support AngleUnit, AxesOrder, AxesReference, CameraDirection, CameraMonitorFeedback, DistanceUnit, and TempUnit. Added blocks to support Acceleration. Added blocks to support LinearOpMode.getRuntime. Added blocks to support MagneticFlux and Position. Fixed typos. Made blocks for ElapsedTime more consistent with other objects. Added blocks to support Quaternion, Velocity, Orientation, AngularVelocity. Added blocks to support VuforiaTrackables, VuforiaTrackable, VuforiaLocalizer, VuforiaTrackableDefaultListener. Fixed a few blocks. Added type checking to new blocks. Updated to latest blockly. Added default variable blocks to navigation and matrix blocks. Fixed toolbox entry for openGLMatrix_rotation_withAxesArgs. When user downloads Blocks-generated op mode, only the .blk file is downloaded. When user uploads Blocks-generated op mode (.blk file), Javascript code is auto generated. Added DbgLog support. Added logging when a blocks file is read/written. Fixed bug to properly render blocks even if missing devices from configuration file. Added support for additional characters (not just alphanumeric) for the block file names (for download and upload). Added support for OpMode flavor (“Autonomous” or “TeleOp”) and group. Changes to Samples to prevent tutorial issues. Incorporated suggested changes from public pull 216 (“Replace .. paths”). Remove Servo Glitches when robot stopped. if user hits “Cancels” when editing a configuration file, clears the unsaved changes and reverts to original unmodified configuration. Added log info to help diagnose why the Robot Controller app was terminated (for example, by watch dog function). Added ability to transfer log from the controller. Fixed inconsistency for AngularVelocity Limit unbounded growth of data for telemetry. If user does not call telemetry.update() for LinearOpMode in a timely manner, data added for telemetry might get lost if size limit is exceeded. Version 2.35 (released on 16.10.06) Blockly programming mode - Removed unnecesary idle() call from blocks for new project. Version 2.30 (released on 16.10.05) Blockly programming mode: Mechanism added to save Blockly op modes from Programming Mode Server onto local device To avoid clutter, blocks are displayed in categorized folders Added support for DigitalChannel Added support for ModernRoboticsI2cCompassSensor Added support for ModernRoboticsI2cRangeSensor Added support for VoltageSensor Added support for AnalogInput Added support for AnalogOutput Fix for CompassSensor setMode block Vuforia Fix deadlock / make camera data available while Vuforia is running. Update to Vuforia 6.0.117 (recommended by Vuforia and Google to close security loophole). Fix for autonomous 30 second timer bug (where timer was in effect, even though it appeared to have timed out). opModeIsActive changes to allow cleanup after op mode is stopped (with enforced 2 second safety timeout). Fix to avoid reading i2c twice. Updated sample Op Modes. Improved logging and fixed intermittent freezing. Added digital I/O sample. Cleaned up device names in sample op modes to be consistent with Pushbot guide. Fix to allow use of IrSeekerSensorV3. Version 2.20 (released on 16.09.08) Support for Modern Robotics Compass Sensor. Support for Modern Robotics Range Sensor. Revise device names for Pushbot templates to match the names used in Pushbot guide. Fixed bug so that IrSeekerSensorV3 device is accessible as IrSeekerSensor in hardwareMap. Modified computer vision code to require an individual Vuforia license (per legal requirement from PTC). Minor fixes. Blockly enhancements: Support for Voltage Sensor. Support for Analog Input. Support for Analog Output. Support for Light Sensor. Support for Servo Controller. Version 2.10 (released on 16.09.03) Support for Adafruit IMU. Improvements to ModernRoboticsI2cGyro class Block on reset of z axis. isCalibrating() returns true while gyro is calibration. Updated sample gyro program. Blockly enhancements support for android.graphics.Color. added support for ElapsedTime. improved look and legibility of blocks. support for compass sensor. support for ultrasonic sensor. support for IrSeeker. support for LED. support for color sensor. support for CRServo prompt user to configure robot before using programming mode. Provides ability to disable audio cues. various bug fixes and improvements. Version 2.00 (released on 16.08.19) This is the new release for the upcoming 2016-2017 FIRST Tech Challenge Season. Channel change is enabled in the FTC Robot Controller app for Moto G 2nd and 3rd Gen phones. Users can now use annotations to register/disable their Op Modes. Changes in the Android SDK, JDK and build tool requirements (minsdk=19, java 1.7, build tools 23.0.3). Standardized units in analog input. Cleaned up code for existing analog sensor classes. setChannelMode and getChannelMode were REMOVED from the DcMotorController class. This is important - we no longer set the motor modes through the motor controller. setMode and getMode were added to the DcMotor class. ContinuousRotationServo class has been added to the FTC SDK. Range.clip() method has been overloaded so it can support this operation for int, short and byte integers. Some changes have been made (new methods added) on how a user can access items from the hardware map. Users can now set the zero power behavior for a DC motor so that the motor will brake or float when power is zero. Prototype Blockly Programming Mode has been added to FTC Robot Controller. Users can place the Robot Controller into this mode, and then use a device (such as a laptop) that has a Javascript enabled browser to write Blockly-based Op Modes directly onto the Robot Controller. Users can now configure the robot remotely through the FTC Driver Station app. Android Studio project supports Android Studio 2.1.x and compile SDK Version 23 (Marshmallow). Vuforia Computer Vision SDK integrated into FTC SDK. Users can use sample vision targets to get localization information on a standard FTC field. Project structure has been reorganized so that there is now a TeamCode package that users can use to place their local/custom Op Modes into this package. Inspection function has been integrated into the FTC Robot Controller and Driver Station Apps (Thanks Team HazMat… 9277 & 10650!). Audio cues have been incorporated into FTC SDK. Swap mechanism added to FTC Robot Controller configuration activity. For example, if you have two motor controllers on a robot, and you misidentified them in your configuration file, you can use the Swap button to swap the devices within the configuration file (so you do not have to manually re-enter in the configuration info for the two devices). Fix mechanism added to all user to replace an electronic module easily. For example, suppose a servo controller dies on your robot. You replace the broken module with a new module, which has a different serial number from the original servo controller. You can use the Fix button to automatically reconfigure your configuration file to use the serial number of the new module. Improvements made to fix resiliency and responsiveness of the system. For LinearOpMode the user now must for a telemetry.update() to update the telemetry data on the driver station. This update() mechanism ensures that the driver station gets the updated data properly and at the same time. The Auto Configure function of the Robot Controller is now template based. If there is a commonly used robot configuration, a template can be created so that the Auto Configure mechanism can be used to quickly configure a robot of this type. The logic to detect a runaway op mode (both in the LinearOpMode and OpMode types) and to abort the run, then auto recover has been improved/implemented. Fix has been incorporated so that Logitech F310 gamepad mappings will be correct for Marshmallow users. Release 16.07.08 For the ftc_app project, the gradle files have been modified to support Android Studio 2.1.x. Release 16.03.30 For the MIT App Inventor, the design blocks have new icons that better represent the function of each design component. Some changes were made to the shutdown logic to ensure the robust shutdown of some of our USB services. A change was made to LinearOpMode so as to allow a given instance to be executed more than once, which is required for the App Inventor. Javadoc improved/updated. Release 16.03.09 Changes made to make the FTC SDK synchronous (significant change!) waitOneFullHardwareCycle() and waitForNextHardwareCycle() are no longer needed and have been deprecated. runOpMode() (for a LinearOpMode) is now decoupled from the system's hardware read/write thread. loop() (for an OpMode) is now decoupled from the system's hardware read/write thread. Methods are synchronous. For example, if you call setMode(DcMotorController.RunMode.RESET_ENCODERS) for a motor, the encoder is guaranteed to be reset when the method call is complete. For legacy module (NXT compatible), user no longer has to toggle between read and write modes when reading from or writing to a legacy device. Changes made to enhance reliability/robustness during ESD event. Changes made to make code thread safe. Debug keystore added so that user-generated robot controller APKs will all use the same signed key (to avoid conflicts if a team has multiple developer laptops for example). Firmware version information for Modern Robotics modules are now logged. Changes made to improve USB comm reliability and robustness. Added support for voltage indicator for legacy (NXT-compatible) motor controllers. Changes made to provide auto stop capabilities for op modes. A LinearOpMode class will stop when the statements in runOpMode() are complete. User does not have to push the stop button on the driver station. If an op mode is stopped by the driver station, but there is a run away/uninterruptible thread persisting, the app will log an error message then force itself to crash to stop the runaway thread. Driver Station UI modified to display lowest measured voltage below current voltage (12V battery). Driver Station UI modified to have color background for current voltage (green=good, yellow=caution, red=danger, extremely low voltage). javadoc improved (edits and additional classes). Added app build time to About activity for driver station and robot controller apps. Display local IP addresses on Driver Station About activity. Added I2cDeviceSynchImpl. Added I2cDeviceSync interface. Added seconds() and milliseconds() to ElapsedTime for clarity. Added getCallbackCount() to I2cDevice. Added missing clearI2cPortActionFlag. Added code to create log messages while waiting for LinearOpMode shutdown. Fix so Wifi Direct Config activity will no longer launch multiple times. Added the ability to specify an alternate i2c address in software for the Modern Robotics gyro. Release 16.02.09 Improved battery checker feature so that voltage values get refreshed regularly (every 250 msec) on Driver Station (DS) user interface. Improved software so that Robot Controller (RC) is much more resilient and “self-healing” to USB disconnects: If user attempts to start/restart RC with one or more module missing, it will display a warning but still start up. When running an op mode, if one or more modules gets disconnected, the RC & DS will display warnings,and robot will keep on working in spite of the missing module(s). If a disconnected module gets physically reconnected the RC will auto detect the module and the user will regain control of the recently connected module. Warning messages are more helpful (identifies the type of module that’s missing plus its USB serial number). Code changes to fix the null gamepad reference when users try to reference the gamepads in the init() portion of their op mode. NXT light sensor output is now properly scaled. Note that teams might have to readjust their light threshold values in their op modes. On DS user interface, gamepad icon for a driver will disappear if the matching gamepad is disconnected or if that gamepad gets designated as a different driver. Robot Protocol (ROBOCOL) version number info is displayed in About screen on RC and DS apps. Incorporated a display filter on pairing screen to filter out devices that don’t use the “-“ format. This filter can be turned off to show all WiFi Direct devices. Updated text in License file. Fixed formatting error in OpticalDistanceSensor.toString(). Fixed issue on with a blank (“”) device name that would disrupt WiFi Direct Pairing. Made a change so that the WiFi info and battery info can be displayed more quickly on the DS upon connecting to RC. Improved javadoc generation. Modified code to make it easier to support language localization in the future. Release 16.01.04 Updated compileSdkVersion for apps Prevent Wifi from entering power saving mode removed unused import from driver station Corrrected \"Dead zone\" joystick code. LED.getDeviceName and .getConnectionInfo() return null apps check for ROBOCOL_VERSION mismatch Fix for Telemetry also has off-by-one errors in its data string sizing / short size limitations error User telemetry output is sorted. added formatting variants to DbgLog and RobotLog APIs code modified to allow for a long list of op mode names. changes to improve thread safety of RobocolDatagramSocket Fix for \"missing hardware leaves robot controller disconnected from driver station\" error fix for \"fast tapping of Init/Start causes problems\" (toast is now only instantiated on UI thread). added some log statements for thread life cycle. moved gamepad reset logic inside of initActiveOpMode() for robustness changes made to mitigate risk of race conditions on public methods. changes to try and flag when WiFi Direct name contains non-printable characters. fix to correct race condition between .run() and .close() in ReadWriteRunnableStandard. updated FTDI driver made ReadWriteRunnableStanard interface public. fixed off-by-one errors in Command constructor moved specific hardware implmentations into their own package. moved specific gamepad implemnatations to the hardware library. changed LICENSE file to new BSD version. fixed race condition when shutting down Modern Robotics USB devices. methods in the ColorSensor classes have been synchronized. corrected isBusy() status to reflect end of motion. corrected \"back\" button keycode. the notSupported() method of the GyroSensor class was changed to protected (it should not be public). Release 15.11.04.001 Added Support for Modern Robotics Gyro. The GyroSensor class now supports the MR Gyro Sensor. Users can access heading data (about Z axis) Users can also access raw gyro data (X, Y, & Z axes). Example MRGyroTest.java op mode included. Improved error messages More descriptive error messages for exceptions in user code. Updated DcMotor API Enable read mode on new address in setI2cAddress Fix so that driver station app resets the gamepads when switching op modes. USB-related code changes to make USB comm more responsive and to display more explicit error messages. Fix so that USB will recover properly if the USB bus returns garbage data. Fix USB initializtion race condition. Better error reporting during FTDI open. More explicit messages during USB failures. Fixed bug so that USB device is closed if event loop teardown method was not called. Fixed timer UI issue Fixed duplicate name UI bug (Legacy Module configuration). Fixed race condition in EventLoopManager. Fix to keep references stable when updating gamepad. For legacy Matrix motor/servo controllers removed necessity of appending \"Motor\" and \"Servo\" to controller names. Updated HT color sensor driver to use constants from ModernRoboticsUsbLegacyModule class. Updated MR color sensor driver to use constants from ModernRoboticsUsbDeviceInterfaceModule class. Correctly handle I2C Address change in all color sensors Updated/cleaned up op modes. Updated comments in LinearI2cAddressChange.java example op mode. Replaced the calls to \"setChannelMode\" with \"setMode\" (to match the new of the DcMotor method). Removed K9AutoTime.java op mode. Added MRGyroTest.java op mode (demonstrates how to use MR Gyro Sensor). Added MRRGBExample.java op mode (demonstrates how to use MR Color Sensor). Added HTRGBExample.java op mode (demonstrates how to use HT legacy color sensor). Added MatrixControllerDemo.java (demonstrates how to use legacy Matrix controller). Updated javadoc documentation. Updated release .apk files for Robot Controller and Driver Station apps. Release 15.10.06.002 Added support for Legacy Matrix 9.6V motor/servo controller. Cleaned up build.gradle file. Minor UI and bug fixes for driver station and robot controller apps. Throws error if Ultrasonic sensor (NXT) is not configured for legacy module port 4 or 5. Release 15.08.03.001 New user interfaces for FTC Driver Station and FTC Robot Controller apps. An init() method is added to the OpMode class. For this release, init() is triggered right before the start() method. Eventually, the init() method will be triggered when the user presses an \"INIT\" button on driver station. The init() and loop() methods are now required (i.e., need to be overridden in the user's op mode). The start() and stop() methods are optional. A new LinearOpMode class is introduced. Teams can use the LinearOpMode mode to create a linear (not event driven) program model. Teams can use blocking statements like Thread.sleep() within a linear op mode. The API for the Legacy Module and Core Device Interface Module have been updated. Support for encoders with the Legacy Module is now working. The hardware loop has been updated for better performance.",
      "url": "https://github.com/chrisneagu/FTC-Skystone-Dark-Angels-Romania-2020",
      "language": "Java",
      "stars": 219,
      "forks": 72,
      "tags": [],
      "created_at": "2025-05-18T02:47:28.993000",
      "updated_at": "2025-08-27T09:38:57.572000",
      "trend_date": "2025-05-18T02:47:28.993000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.575000"
    },
    {
      "id": 1708,
      "name": "it-chain",
      "full_name": "DE-labtory/it-chain",
      "owner": "DE-labtory",
      "description": "Lightweight & Customizable Block Chain",
      "url": "https://github.com/DE-labtory/it-chain",
      "language": "Go",
      "stars": 178,
      "forks": 54,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.601000",
      "updated_at": "2025-08-27T09:38:57.601000",
      "trend_date": "2025-08-27T09:38:57.601000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.602000"
    },
    {
      "id": 1621,
      "name": "BlockChainSimpleDemo",
      "full_name": "shiwenwen/BlockChainSimpleDemo",
      "owner": "shiwenwen",
      "description": "基于Python3区块链简单Demo，帮助了解区块链。",
      "url": "https://github.com/shiwenwen/BlockChainSimpleDemo",
      "language": "Python",
      "stars": 164,
      "forks": 39,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.550000",
      "updated_at": "2025-08-27T09:38:57.550000",
      "trend_date": "2025-08-27T09:38:57.550000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.550000"
    },
    {
      "id": 1697,
      "name": "ika",
      "full_name": "dwallet-labs/ika",
      "owner": "dwallet-labs",
      "description": "Ika is a Zero-Trust threshold signature network, implementing 2PC-MPC to ensure the user is cryptographically required to generate a signature. Ika powers the dWallet primitive, a building block that adds native multi-chain interoperability to Sui smart contracts.",
      "url": "https://github.com/dwallet-labs/ika",
      "language": "Rust",
      "stars": 161,
      "forks": 160,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.596000",
      "updated_at": "2025-08-27T09:38:57.596000",
      "trend_date": "2025-08-27T09:38:57.596000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.596000"
    },
    {
      "id": 1709,
      "name": "PublicBlockChain_go",
      "full_name": "chaors/PublicBlockChain_go",
      "owner": "chaors",
      "description": "基于goLang的公链实现(具备公链全功能)",
      "url": "https://github.com/chaors/PublicBlockChain_go",
      "language": "Go",
      "stars": 149,
      "forks": 36,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.602000",
      "updated_at": "2025-08-27T09:38:57.602000",
      "trend_date": "2025-08-27T09:38:57.602000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.602000"
    },
    {
      "id": 1671,
      "name": "blockchain-supply-chain",
      "full_name": "mattdean1/blockchain-supply-chain",
      "owner": "mattdean1",
      "description": "⛓ Supply Chain on Hyperledger Fabric",
      "url": "https://github.com/mattdean1/blockchain-supply-chain",
      "language": "JavaScript",
      "stars": 146,
      "forks": 50,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.586000",
      "updated_at": "2025-08-27T09:38:57.586000",
      "trend_date": "2025-08-27T09:38:57.586000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.586000"
    },
    {
      "id": 1055,
      "name": "Comp_Sci_Sem_2",
      "full_name": "danderfer/Comp_Sci_Sem_2",
      "owner": "danderfer",
      "description": "According to all known laws of aviation, there is no way that a bee should be able to fly. Its wings are too small to get its fat little body off the ground. The bee, of course, flies anyway. Because bees don’t care what humans think is impossible.” SEQ. 75 - “INTRO TO BARRY” INT. BENSON HOUSE - DAY ANGLE ON: Sneakers on the ground. Camera PANS UP to reveal BARRY BENSON’S BEDROOM ANGLE ON: Barry’s hand flipping through different sweaters in his closet. BARRY Yellow black, yellow black, yellow black, yellow black, yellow black, yellow black...oohh, black and yellow... ANGLE ON: Barry wearing the sweater he picked, looking in the mirror. BARRY (CONT’D) Yeah, let’s shake it up a little. He picks the black and yellow one. He then goes to the sink, takes the top off a CONTAINER OF HONEY, and puts some honey into his hair. He squirts some in his mouth and gargles. Then he takes the lid off the bottle, and rolls some on like deodorant. CUT TO: INT. BENSON HOUSE KITCHEN - CONTINUOUS Barry’s mother, JANET BENSON, yells up at Barry. JANET BENSON Barry, breakfast is ready! CUT TO: \"Bee Movie\" - JS REVISIONS 8/13/07 1. INT. BARRY’S ROOM - CONTINUOUS BARRY Coming! SFX: Phone RINGING. Barry’s antennae vibrate as they RING like a phone. Barry’s hands are wet. He looks around for a towel. BARRY (CONT’D) Hang on a second! He wipes his hands on his sweater, and pulls his antennae down to his ear and mouth. BARRY (CONT'D) Hello? His best friend, ADAM FLAYMAN, is on the other end. ADAM Barry? BARRY Adam? ADAM Can you believe this is happening? BARRY Can’t believe it. I’ll pick you up. Barry sticks his stinger in a sharpener. SFX: BUZZING AS HIS STINGER IS SHARPENED. He tests the sharpness with his finger. SFX: Bing. BARRY (CONT’D) Looking sharp. ANGLE ON: Barry hovering down the hall, sliding down the staircase bannister. Barry’s mother, JANET BENSON, is in the kitchen. JANET BENSON Barry, why don’t you use the stairs? Your father paid good money for those. \"Bee Movie\" - JS REVISIONS 8/13/07 2. BARRY Sorry, I’m excited. Barry’s father, MARTIN BENSON, ENTERS. He’s reading a NEWSPAPER with the HEADLINE, “Queen gives birth to thousandtuplets: Resting Comfortably.” MARTIN BENSON Here’s the graduate. We’re very proud of you, Son. And a perfect report card, all B’s. JANET BENSON (mushing Barry’s hair) Very proud. BARRY Ma! I’ve got a thing going here. Barry re-adjusts his hair, starts to leave. JANET BENSON You’ve got some lint on your fuzz. She picks it off. BARRY Ow, that’s me! MARTIN BENSON Wave to us. We’ll be in row 118,000. Barry zips off. BARRY Bye! JANET BENSON Barry, I told you, stop flying in the house! CUT TO: SEQ. 750 - DRIVING TO GRADUATION EXT. BEE SUBURB - MORNING A GARAGE DOOR OPENS. Barry drives out in his CAR. \"Bee Movie\" - JS REVISIONS 8/13/07 3. ANGLE ON: Barry’s friend, ADAM FLAYMAN, standing by the curb. He’s reading a NEWSPAPER with the HEADLINE: “Frisbee Hits Hive: Internet Down. Bee-stander: “I heard a sound, and next thing I knew...wham-o!.” Barry drives up, stops in front of Adam. Adam jumps in. BARRY Hey, Adam. ADAM Hey, Barry. (pointing at Barry’s hair) Is that fuzz gel? BARRY A little. It’s a special day. Finally graduating. ADAM I never thought I’d make it. BARRY Yeah, three days of grade school, three days of high school. ADAM Those were so awkward. BARRY Three days of college. I’m glad I took off one day in the middle and just hitchhiked around the hive. ADAM You did come back different. They drive by a bee who’s jogging. ARTIE Hi Barry! BARRY (to a bee pedestrian) Hey Artie, growing a mustache? Looks good. Barry and Adam drive from the suburbs into the city. ADAM Hey, did you hear about Frankie? \"Bee Movie\" - JS REVISIONS 8/13/07 4. BARRY Yeah. ADAM You going to his funeral? BARRY No, I’m not going to his funeral. Everybody knows you sting someone you die, you don’t waste it on a squirrel. He was such a hot head. ADAM Yeah, I guess he could’ve just gotten out of the way. The DRIVE through a loop de loop. BARRY AND ADAM Whoa...Whooo...wheee!! ADAM I love this incorporating the amusement park right into our regular day. BARRY I guess that’s why they say we don’t need vacations. CUT TO: SEQ. 95 - GRADUATION EXT. GRADUATION CEREMONY - CONTINUOUS Barry and Adam come to a stop. They exit the car, and fly over the crowd to their seats. * BARRY * (re: graduation ceremony) * Boy, quite a bit of pomp...under * the circumstances. * They land in their seats. BARRY (CONT’D) Well Adam, today we are men. \"Bee Movie\" - JS REVISIONS 8/13/07 5. ADAM We are. BARRY Bee-men. ADAM Amen! BARRY Hallelujah. Barry hits Adam’s forehead. Adam goes into the rapture. An announcement comes over the PA. ANNOUNCER (V.O) Students, faculty, distinguished bees...please welcome, Dean Buzzwell. ANGLE ON: DEAN BUZZWELL steps up to the podium. The podium has a sign that reads: “Welcome Graduating Class of:”, with train-station style flipping numbers after it. BUZZWELL Welcome New Hive City graduating class of... The numbers on the podium change to 9:15. BUZZWELL (CONT’D) ...9:15. (he clears his throat) And that concludes our graduation ceremonies. And begins your career at Honex Industries. BARRY Are we going to pick our job today? ADAM I heard it’s just orientation. The rows of chairs change in transformer-like mechanical motion to Universal Studios type tour trams. Buzzwell walks off stage. BARRY (re: trams) Whoa, heads up! Here we go. \"Bee Movie\" - JS REVISIONS 8/13/07 6. SEQ. 125 - “FACTORY” FEMALE VOICE (V.O) Keep your hands and antennas inside the tram at all times. (in Spanish) Dejen las manos y antennas adentro del tram a todos tiempos. BARRY I wonder what it’s going to be like? ADAM A little scary. Barry shakes Adam. BARRY AND ADAM AAHHHH! The tram passes under SIGNS READING: “Honex: A Division of Honesco: A Part of the Hexagon Group.” TRUDY Welcome to Honex, a division of Honesco, and a part of the Hexagon group. BARRY This is it! The Honex doors OPEN, revealing the factory. BARRY (CONT’D) Wow. TRUDY We know that you, as a bee, have worked your whole life to get to the point where you can work for your whole life. Honey begins when our valiant pollen jocks bring the nectar to the hive where our top secret formula is automatically color-corrected, scent adjusted and bubble contoured into this... Trudy GRABS a TEST TUBE OF HONEY from a technician. \"Bee Movie\" - JS REVISIONS 8/13/07 7. TRUDY (CONT’D) ...soothing, sweet syrup with its distinctive golden glow, you all know as... EVERYONE ON THE TRAM (in unison) H-o-n-e-y. Trudy flips the flask into the crowd, and laughs as they all scramble for it. ANGLE ON: A GIRL BEE catching the honey. ADAM (sotto) That girl was hot. BARRY (sotto) She’s my cousin. ADAM She is? BARRY Yes, we’re all cousins. ADAM Right. You’re right. TRUDY At Honex, we also constantly strive to improve every aspect of bee existence. These bees are stress testing a new helmet technology. ANGLE ON: A STUNT BEE in a HELMET getting hit with a NEWSPAPER, then a SHOE, then a FLYSWATTER. He gets up, and gives a “thumb’s up”. The graduate bees APPLAUD. ADAM (re: stunt bee) What do you think he makes? BARRY Not enough. TRUDY And here we have our latest advancement, the Krelman. \"Bee Movie\" - JS REVISIONS 8/13/07 8. BARRY Wow, what does that do? TRUDY Catches that little strand of honey that hangs after you pour it. Saves us millions. ANGLE ON: The Krelman machine. Bees with hand-shaped hats on, rotating around a wheel to catch drips of honey. Adam’s hand shoots up. ADAM Can anyone work on the Krelman? TRUDY Of course. Most bee jobs are small ones. But bees know that every small job, if it’s done well, means a lot. There are over 3000 different bee occupations. But choose carefully, because you’ll stay in the job that you pick for the rest of your life. The bees CHEER. ANGLE ON: Barry’s smile dropping slightly. BARRY The same job for the rest of your life? I didn’t know that. ADAM What’s the difference? TRUDY And you’ll be happy to know that bees as a species haven’t had one day off in 27 million years. BARRY So you’ll just work us to death? TRUDY (laughing) We’ll sure try. Everyone LAUGHS except Barry. \"Bee Movie\" - JS REVISIONS 8/13/07 9. The tram drops down a log-flume type steep drop. Cameras flash, as all the bees throw up their hands. The frame freezes into a snapshot. Barry looks concerned. The tram continues through 2 doors. FORM DISSOLVE TO: SEQ. 175 - “WALKING THE HIVE” INT. HONEX LOBBY ANGLE ON: The log-flume photo, as Barry looks at it. ADAM Wow. That blew my mind. BARRY (annoyed) “What’s the difference?” Adam, how could you say that? One job forever? That’s an insane choice to have to make. ADAM Well, I’m relieved. Now we only have to make one decision in life. BARRY But Adam, how could they never have told us that? ADAM Barry, why would you question anything? We’re bees. We’re the most perfectly functioning society on Earth. They walk by a newspaper stand with A SANDWICH BOARD READING: “Bee Goes Berserk: Stings Seven Then Self.” ANGLE ON: A BEE filling his car’s gas tank from a honey pump. He fills his car some, then takes a swig for himself. NEWSPAPER BEE (to the bee guzzling gas) Hey! Barry and Adam begin to cross the street. \"Bee Movie\" - JS REVISIONS 8/13/07 10. BARRY Yeah but Adam, did you ever think that maybe things work a little too well around here? They stop in the middle of the street. The traffic moves perfectly around them. ADAM Like what? Give me one example. BARRY (thinks) ...I don’t know. But you know what I’m talking about. They walk off. SEQ. 400 - “MEET THE JOCKS” SFX: The SOUND of Pollen Jocks. PAN DOWN from the Honex statue. J-GATE ANNOUNCER Please clear the gate. Royal Nectar Force on approach. Royal Nectar Force on approach. BARRY Wait a second. Check it out. Hey, hey, those are Pollen jocks. ADAM Wow. FOUR PATROL BEES FLY in through the hive’s giant Gothic entrance. The Patrol Bees are wearing fighter pilot helmets with black visors. ADAM (CONT’D) I’ve never seen them this close. BARRY They know what it’s like to go outside the hive. ADAM Yeah, but some of them don’t come back. \"Bee Movie\" - JS REVISIONS 8/13/07 11. The nectar from the pollen jocks is removed from their backpacks, and loaded into trucks on their way to Honex. A SMALL CROWD forms around the Patrol Bees. Each one has a PIT CREW that takes their nectar. Lou Loduca hurries a pit crew along: LOU LODUCA You guys did great! You’re monsters. You’re sky freaks! I love it! I love it! SCHOOL GIRLS are jumping up and down and squealing nearby. BARRY I wonder where those guys have just been? ADAM I don’t know. BARRY Their day’s not planned. Outside the hive, flying who-knows-where, doing who-knows-what. ADAM You can’t just decide one day to be a Pollen Jock. You have to be bred for that. BARRY Right. Pollen Jocks cross in close proximity to Barry and Adam. Some pollen falls off, onto Barry and Adam. BARRY (CONT’D) Look at that. That’s more pollen than you and I will ever see in a lifetime. ADAM (playing with the pollen) It’s just a status symbol. I think bees make too big a deal out of it. BARRY Perhaps, unless you’re wearing it, and the ladies see you wearing it. ANGLE ON: Two girl bees. \"Bee Movie\" - JS REVISIONS 8/13/07 12. ADAM Those ladies? Aren’t they our cousins too? BARRY Distant, distant. ANGLE ON: TWO POLLEN JOCKS. JACKSON Look at these two. SPLITZ Couple of Hive Harrys. JACKSON Let’s have some fun with them. The pollen jocks approach. Barry and Adam continue to talk to the girls. GIRL 1 It must be so dangerous being a pollen jock. BARRY Oh yeah, one time a bear had me pinned up against a mushroom. He had one paw on my throat, and with the other he was slapping me back and forth across the face. GIRL 1 Oh my. BARRY I never thought I’d knock him out. GIRL 2 (to Adam) And what were you doing during all of this? ADAM Obviously I was trying to alert the authorities. The girl swipes some pollen off of Adam with a finger. BARRY (re: pollen) I can autograph that if you want. \"Bee Movie\" - JS REVISIONS 8/13/07 13. JACKSON Little gusty out there today, wasn’t it, comrades? BARRY Yeah. Gusty. BUZZ You know, we’re going to hit a sunflower patch about six miles from here tomorrow. BARRY Six miles, huh? ADAM (whispering) Barry. BUZZ It’s a puddle-jump for us. But maybe you’re not up for it. BARRY Maybe I am. ADAM (whispering louder) You are not! BUZZ We’re going, oh-nine hundred at JGate. ADAM (re: j-gate) Whoa. BUZZ (leaning in, on top of Barry) What do you think, Buzzy Boy? Are you bee enough? BARRY I might be. It all depends on what oh-nine hundred means. CUT TO: SEQ. 450 - “THE BALCONY” \"Bee Movie\" - JS REVISIONS 8/13/07 14. INT. BENSON HOUSE BALCONY - LATER Barry is standing on the balcony alone, looking out over the city. Martin Benson ENTERS, sneaks up behind Barry and gooses him in his ribs. MARTIN BENSON Honex! BARRY Oh, Dad. You surprised me. MARTIN BENSON (laughing) Have you decided what you’re interested in, Son? BARRY Well, there’s a lot of choices. MARTIN BENSON But you only get one. Martin LAUGHS. BARRY Dad, do you ever get bored doing the same job every day? MARTIN BENSON Son, let me tell you something about stirring. (making the stirring motion) You grab that stick and you just move it around, and you stir it around. You get yourself into a rhythm, it’s a beautiful thing. BARRY You know dad, the more I think about it, maybe the honey field just isn’t right for me. MARTIN BENSON And you were thinking of what, making balloon animals? That’s a bad job for a guy with a stinger. \"Bee Movie\" - JS REVISIONS 8/13/07 15. BARRY Well no... MARTIN BENSON Janet, your son’s not sure he wants to go into honey. JANET BENSON Oh Barry, you are so funny sometimes. BARRY I’m not trying to be funny. MARTIN BENSON You’re not funny, you’re going into honey. Our son, the stirrer. JANET BENSON You’re going to be a stirrer?! BARRY No one’s listening to me. MARTIN BENSON Wait until you see the sticks I have for you. BARRY I can say anything I want right now. I’m going to get an ant tattoo. JANET BENSON Let’s open some fresh honey and celebrate. BARRY Maybe I’ll pierce my thorax! MARTIN BENSON (toasting) To honey! BARRY Shave my antennae! JANET BENSON To honey! \"Bee Movie\" - JS REVISIONS 8/13/07 16. BARRY Shack up with a grasshopper, get a gold tooth, and start calling everybody “Dawg.” CUT TO: SEQ. 760 - “JOB PLACEMENT” EXT. HONEX LOBBY - CONTINUOUS ANGLE ON: A BEE BUS STOP. One group of bees stands on the pavement, as another group hovers above them. A doubledecker bus pulls up. The hovering bees get on the top level, and the standing bees get on the bottom. Barry and Adam pull up outside of Honex. ADAM I can’t believe we’re starting work today. BARRY Today’s the day. Adam jumps out of the car. ADAM (O.C) Come on. All the good jobs will be gone. BARRY Yeah, right... ANGLE ON: A BOARD READING: “JOB PLACEMENT BOARD”. Buzzwell, the Bee Processor, is at the counter. Another BEE APPLICANT, SANDY SHRIMPKIN is EXITING. SANDY SHRIMPKIN Is it still available? BUZZWELL Hang on. (he looks at changing numbers on the board) Two left. And...one of them’s yours. Congratulations Son, step to the side please. \"Bee Movie\" - JS REVISIONS 8/13/07 17. SANDY SHRIMPKIN Yeah! ADAM (to Sandy, leaving) What did you get? SANDY SHRIMPKIN Picking the crud out. That is stellar! ADAM Wow. BUZZWELL (to Adam and Barry) Couple of newbies? ADAM Yes Sir. Our first day. We are ready. BUZZWELL Well, step up and make your choice. ANGLE ON: A CHART listing the different sectors of Honex. Heating, Cooling, Viscosity, Krelman, Pollen Counting, Stunt Bee, Pouring, Stirrer, Humming, Regurgitating, Front Desk, Hair Removal, Inspector No. 7, Chef, Lint Coordinator, Stripe Supervisor, Antennae-ball polisher, Mite Wrangler, Swatting Counselor, Wax Monkey, Wing Brusher, Hive Keeper, Restroom Attendant. ADAM (to Barry) You want to go first? BARRY No, you go. ADAM Oh my. What’s available? BUZZWELL Restroom attendant is always open, and not for the reason you think. ADAM Any chance of getting on to the Krelman, Sir? BUZZWELL Sure, you’re on. \"Bee Movie\" - JS REVISIONS 8/13/07 18. He plops the KRELMAN HAT onto Adam’s head. ANGLE ON: The job board. THE COLUMNS READ: “OCCUPATION” “POSITIONS AVAILABLE”, and “STATUS”. The middle column has numbers, and the right column has job openings flipping between “open”, “pending”, and “closed”. BUZZWELL (CONT’D) Oh, I’m sorry. The Krelman just closed out. ADAM Oh! He takes the hat off Adam. BUZZWELL Wax Monkey’s always open. The Krelman goes from “Closed” to “Open”. BUZZWELL (CONT’D) And the Krelman just opened up again. ADAM What happened? BUZZWELL Well, whenever a bee dies, that’s an opening. (pointing at the board) See that? He’s dead, dead, another dead one, deady, deadified, two more dead. Dead from the neck up, dead from the neck down. But, that’s life. ANGLE ON: Barry’s disturbed expression. ADAM (feeling pressure to decide) Oh, this is so hard. Heating, cooling, stunt bee, pourer, stirrer, humming, inspector no. 7, lint coordinator, stripe supervisor, antenna-ball polisher, mite wrangler-- Barry, Barry, what do you think I should-- Barry? Barry? \"Bee Movie\" - JS REVISIONS 8/13/07 19. Barry is gone. CUT TO: SEQ. 775 - “LOU LODUCA SPEECH” EXT. J-GATE - SAME TIME Splitz, Jackson, Buzz, Lou and two other BEES are going through final pre-flight checks. Barry ENTERS. LOU LODUCA Alright, we’ve got the sunflower patch in quadrant nine. Geranium window box on Sutton Place... Barry’s antennae rings, like a phone. ADAM (V.O) What happened to you? Where are you? Barry whispers throughout. BARRY I’m going out. ADAM (V.O) Out? Out where? BARRY Out there. ADAM (V.O) (putting it together) Oh no. BARRY I have to, before I go to work for the rest of my life. ADAM (V.O) You’re going to die! You’re crazy! Hello? BARRY Oh, another call coming in. \"Bee Movie\" - JS REVISIONS 8/13/07 20. ADAM (V.O) You’re cra-- Barry HANGS UP. ANGLE ON: Lou Loduca. LOU LODUCA If anyone’s feeling brave, there’s a Korean Deli on 83rd that gets their roses today. BARRY (timidly) Hey guys. BUZZ Well, look at that. SPLITZ Isn’t that the kid we saw yesterday? LOU LODUCA (to Barry) Hold it son, flight deck’s restricted. JACKSON It’s okay Lou, we’re going to take him up. Splitz and Jackson CHUCKLE. LOU LODUCA Really? Feeling lucky, are ya? A YOUNGER SMALLER BEE THAN BARRY, CHET, runs up with a release waiver for Barry to sign. CHET Sign here. Here. Just initial that. Thank you. LOU LODUCA Okay, you got a rain advisory today and as you all know, bees cannot fly in rain. So be careful. As always, (reading off clipboard) watch your brooms, hockey sticks, dogs, birds, bears, and bats. \"Bee Movie\" - JS REVISIONS 8/13/07 21. Also, I got a couple reports of root beer being poured on us. Murphy’s in a home because of it, just babbling like a cicada. BARRY That’s awful. LOU LODUCA And a reminder for all you rookies, bee law number one, absolutely no talking to humans. Alright, launch positions! The Jocks get into formation, chanting as they move. LOU LODUCA (CONT’D) Black and Yellow! JOCKS Hello! SPLITZ (to Barry) Are you ready for this, hot shot? BARRY Yeah. Yeah, bring it on. Barry NODS, terrified. BUZZ Wind! - CHECK! JOCK #1 Antennae! - CHECK! JOCK #2 Nectar pack! - CHECK! JACKSON Wings! - CHECK! SPLITZ Stinger! - CHECK! BARRY Scared out of my shorts - CHECK. LOU LODUCA Okay ladies, let’s move it out. Everyone FLIPS their goggles down. Pit crew bees CRANK their wings, and remove the starting blocks. We hear loud HUMMING. \"Bee Movie\" - JS REVISIONS 8/13/07 22. LOU LODUCA (CONT'D) LOU LODUCA (CONT’D) Pound those petunia's, you striped stem-suckers! All of you, drain those flowers! A FLIGHT DECK GUY in deep crouch hand-signals them out the archway as the backwash from the bee wings FLUTTERS his jump suit. Barry follows everyone. SEQ. 800 - “FLYING WITH THE JOCKS” The bees climb above tree tops in formation. Barry is euphoric. BARRY Whoa! I’m out! I can’t believe I’m out! So blue. Ha ha ha! (a beat) I feel so fast...and free. (re: kites in the sky) Box kite! Wow! They fly by several bicyclists, and approach a patch of flowers. BARRY (CONT'D) Flowers! SPLITZ This is blue leader. We have roses visual. Bring it around thirty degrees and hold. BARRY (sotto) Roses. JACKSON Thirty degrees, roger, bringing it around. Many pollen jocks break off from the main group. They use their equipment to collect nectar from flowers. Barry flies down to watch the jocks collect the nectar. JOCK Stand to the side kid, it’s got a bit of a kick. The jock fires the gun, and recoils. Barry watches the gun fill up with nectar. \"Bee Movie\" - JS REVISIONS 8/13/07 23. BARRY Oh, that is one Nectar Collector. JOCK You ever see pollination up close? BARRY No, Sir. He takes off, and the excess pollen dust falls causing the flowers to come back to life. JOCK (as he pollinates) I pick some pollen up over here, sprinkle it over here, maybe a dash over there, pinch on that one...see that? It’s a little bit of magic, ain’t it? The FLOWERS PERK UP as he pollinates. BARRY Wow. That’s amazing. Why do we do that? JOCK ...that’s pollen power, Kid. More pollen, more flowers, more nectar, more honey for us. BARRY Cool. The Jock WINKS at Barry. Barry rejoins the other jocks in the sky. They swoop in over a pond, kissing the surface. We see their image reflected in the water; they’re really moving. They fly over a fountain. BUZZ I’m picking up a lot of bright yellow, could be daisies. Don’t we need those? SPLITZ Copy that visual. We see what appear to be yellow flowers on a green field. \"Bee Movie\" - JS REVISIONS 8/13/07 24. They go into a deep bank and dive. BUZZ Hold on, one of these flowers seems to be on the move. SPLITZ Say again...Are you reporting a moving flower? BUZZ Affirmative. SEQ. 900 - “TENNIS GAME” The pollen jocks land. It is a tennis court with dozens of tennis balls. A COUPLE, VANESSA and KEN, plays tennis. The bees land right in the midst of a group of balls. KEN (O.C) That was on the line! The other bees start walking around amongst the immense, yellow globes. SPLITZ This is the coolest. What is it? They stop at a BALL on a white line and look up at it. JACKSON I don’t know, but I’m loving this color. SPLITZ (smelling tennis ball) Smells good. Not like a flower. But I like it. JACKSON Yeah, fuzzy. BUZZ Chemical-y. JACKSON Careful, guys, it’s a little grabby. Barry LANDS on a ball and COLLAPSES. \"Bee Movie\" - JS REVISIONS 8/13/07 25. BARRY Oh my sweet lord of bees. JACKSON Hey, candy brain, get off there! Barry attempts to pulls his legs off, but they stick. BARRY Problem! A tennis shoe and a hand ENTER FRAME. The hand picks up the ball with Barry underneath it. BARRY (CONT'D) Guys! BUZZ This could be bad. JACKSON Affirmative. Vanessa walks back to the service line, BOUNCES the ball. Each time it BOUNCES, the other bees cringe and GASP. ANGLE ON: Barry, terrified. Pure dumb luck, he’s not getting squished. BARRY (with each bounce) Very close...Gonna Hurt...Mamma’s little boy. SPLITZ You are way out of position, rookie. ANGLE ON: Vanessa serving. We see Barry and the ball up against the racket as she brings it back. She tosses the ball into the air; Barry’s eyes widen. The ball is STRUCK, and the rally is on. KEN Coming in at you like a missile! Ken HITS the ball back. Barry feels the g-forces. ANGLE ON: The Pollen Jocks watching Barry pass by them in SLOW MOTION. \"Bee Movie\" - JS REVISIONS 8/13/07 26. BARRY (in slow motion) Help me! JACKSON You know, I don't think these are flowers. SPLITZ Should we tell him? JACKSON I think he knows. BARRY (O.S) What is this?! Vanessa HITS a high arcing lob. Ken waits, poised for the return. We see Barry having trouble maneuvering the ball from fatigue. KEN (overly confident) Match point! ANGLE ON: Ken running up. He has a killer look in his eyes. He’s going to hit the ultimate overhead smash. KEN (CONT'D) You can just start packing up Honey, because I believe you’re about to eat it! ANGLE ON: Pollen Jocks. JACKSON Ahem! Ken is distracted by the jock. KEN What? No! He misses badly. The ball rockets into oblivion. Barry is still hanging on. ANGLE ON: Ken, berating himself. KEN (CONT’D) Oh, you cannot be serious. We hear the ball WHISTLING, and Barry SCREAMING. \"Bee Movie\" - JS REVISIONS 8/13/07 27. BARRY Yowser!!! SEQ. 1000 - “SUV” The ball flies through the air, and lands in the middle of the street. It bounces into the street again, and sticks in the grille of an SUV. INT. CAR ENGINE - CONTINUOUS BARRY’S POV: the grille of the SUV sucks him up. He tumbles through a black tunnel, whirling vanes, and pistons. BARRY AHHHHHHHHHHH!! OHHHH!! EECHHH!! AHHHHHH!! Barry gets chilled by the A/C system, and sees a frozen grasshopper. BARRY (CONT’D) (re: grasshopper) Eww, gross. CUT TO: INT. CAR - CONTINUOUS The car is packed with a typical suburban family: MOTHER, FATHER, eight-year old BOY, LITTLE GIRL in a car seat and a GRANDMOTHER. A big slobbery DOG is behind a grate. Barry pops into the passenger compartment, hitting the Mother’s magazine. MOTHER There’s a bee in the car! They all notice the bee and start SCREAMING. BARRY Aaahhhh! Barry tumbles around the car. We see the faces from his POV. MOTHER Do something! \"Bee Movie\" - JS REVISIONS 8/13/07 28. FATHER I’m driving! Barry flies by the little girl in her CAR SEAT. She waves hello. LITTLE GIRL Hi, bee. SON He’s back here! He’s going to sting me! The car SWERVES around the road. Barry flies into the back, where the slobbery dog SNAPS at him. Barry deftly avoids the jaws and gross, flying SPITTLE. MOTHER Nobody move. If you don’t move, he won’t sting you. Freeze! Everyone in the car freezes. Barry freezes. They stare at each other, eyes going back and forth, waiting to see who will make the first move. Barry blinks. GRANNY He blinked! Granny pulls out a can of HAIR SPRAY. SON Spray him, Granny! Granny sprays the hair spray everywhere. FATHER What are you doing? GRANNY It’s hair spray! Extra hold! MOTHER Kill it! Barry gets sprayed back by the hair spray, then sucked out of the sunroof. CUT TO: \"Bee Movie\" - JS REVISIONS 8/13/07 29. EXT. CITY STREET - CONTINUOUS BARRY Wow. The tension level out here is unbelievable. I’ve got to get home. As Barry flies down the street, it starts to RAIN. He nimbly avoids the rain at first. BARRY (CONT’D) Whoa. Whoa! Can’t fly in rain! Can’t fly in rain! Can’t fly in-- A couple of drops hit him, his wings go limp and he starts falling. BARRY (CONT'D) Mayday! Mayday! Bee going down! Barry sees a window ledge and aims for it and just makes it. Shivering and exhausted, he crawls into an open window as it CLOSES. SEQ. 1100 - “VANESSA SAVES BARRY” INT. VANESSA’S APARTMENT - CONTINUOUS Inside the window, Barry SHAKES off the rain like a dog. Vanessa, Ken, Andy, and Anna ENTER the apartment. VANESSA Ken, can you close the window please? KEN Huh? Oh. (to Andy) Hey, check out my new resume. I made it into a fold-out brochure. You see? It folds out. Ken holds up his brochure, with photos of himself, and a resume in the middle. ANGLE ON: Barry hiding behind the curtains, as Ken CLOSES THE WINDOW. \"Bee Movie\" - JS REVISIONS 8/13/07 30. BARRY Oh no, more humans. I don’t need this. Barry HOVERS up into the air and THROWS himself into the glass. BARRY (CONT’D) (dazed) Ow! What was that? He does it again, and then multiple more times. BARRY (CONT'D) Maybe this time...this time, this time, this time, this time, this time, this time, this time. Barry JUMPS onto the drapes. BARRY (CONT'D) (out of breath) Drapes! (then, re: glass) That is diabolical. KEN It’s fantastic. It’s got all my special skills, even my top ten favorite movies. ANDY What’s your number one? Star Wars? KEN Ah, I don’t go for that, (makes Star Wars noises), kind of stuff. ANGLE ON: Barry. BARRY No wonder we’re not supposed to talk to them. They’re out of their minds. KEN When I walk out of a job interview they’re flabbergasted. They can’t believe the things I say. Barry looks around and sees the LIGHT BULB FIXTURE in the middle of the ceiling. \"Bee Movie\" - JS REVISIONS 8/13/07 31. BARRY (re: light bulb) Oh, there’s the sun. Maybe that’s a way out. Barry takes off and heads straight for the light bulb. His POV: The seventy-five watt label grows as he gets closer. BARRY (CONT’D) I don’t remember the sun having a big seventy five on it. Barry HITS the bulb and is KNOCKED SILLY. He falls into a BOWL OF GUACAMOLE. Andy dips his chip in the guacamole, taking Barry with it. ANGLE ON: Ken and Andy. KEN I’ll tell you what. You know what? I predicted global warming. I could feel it getting hotter. At first I thought it was just me. Barry’s POV: Giant human mouth opening. KEN (CONT’D) Wait! Stop! Beeeeeee! ANNA Kill it! Kill it! They all JUMP up from their chairs. Andy looks around for something to use. Ken comes in for the kill with a big TIMBERLAND BOOT on each hand. KEN Stand back. These are winter boots. Vanessa ENTERS, and stops Ken from squashing Barry. VANESSA (grabs Ken’s arm) Wait. Don’t kill him. CLOSE UP: on Barry’s puzzled face. KEN You know I’m allergic to them. This thing could kill me. \"Bee Movie\" - JS REVISIONS 8/13/07 32. VANESSA Why does his life have any less value than yours? She takes a GLASS TUMBLER and places it over Barry. KEN Why does his life have any less value than mine? Is that your statement? VANESSA I’m just saying, all life has value. You don’t know what he’s capable of feeling. Barry looks up through the glass and watches this conversation, astounded. Vanessa RIPS Ken’s resume in half and SLIDES it under the glass. KEN (wistful) My brochure. There’s a moment of eye contact as she carries Barry to the window. She opens it and sets him free. VANESSA There you go, little guy. KEN (O.C) I’m not scared of them. But, you know, it’s an allergic thing. ANDY (O.C) * Hey, why don’t you put that on your * resume-brochure? * KEN (O.C) It’s not funny, my whole face could puff up. ANDY (O.C) Make it one of your “Special Skills.” KEN (O.C) You know, knocking someone out is also a special skill. CUT TO: \"Bee Movie\" - JS REVISIONS 8/13/07 33. EXT. WINDOWSILL - CONTINUOUS Barry stares over the window frame. He can’t believe what’s just happened. It is still RAINING. DISSOLVE TO: SEQ. 1200 - “BARRY SPEAKS” EXT. WINDOWSILL - LATER Barry is still staring through the window. Inside, everyone’s saying their good-byes. KEN Vanessa, next week? Yogurt night? VANESSA Uh, yeah sure Ken. You know, whatever. KEN You can put carob chips on there. VANESSA Good night. KEN (as he exits) Supposed to be less calories, or something. VANESSA Bye. She shuts the door. Vanessa starts cleaning up. BARRY I’ve got to say something. She saved my life. I’ve got to say something. Alright, here it goes. Barry flies in. \"Bee Movie\" - JS REVISIONS 8/13/07 34. INT. VANESSA’S APARTMENT - CONTINUOUS Barry hides himself on different PRODUCTS placed along the kitchen shelves. He hides on a Bumblebee Tuna can, and a “Greetings From Coney Island” MUSCLE-MAN POSTCARD on the fridge. BARRY (on fridge) What would I say? (landing on a bottle) I could really get in trouble. He stands looking at Vanessa. BARRY (CONT'D) It’s a bee law. You’re not supposed to talk to a human. I can’t believe I’m doing this. I’ve got to. Oh, I can’t do it! Come on! No, yes, no, do it! I can’t. How should I start it? You like jazz? No, that’s no good. Here she comes. Speak, you fool. As Vanessa walks by, Barry takes a DEEP BREATH. BARRY (CONT’D) (cheerful) Umm...hi. Vanessa DROPS A STACK OF DISHES, and HOPS BACK. BARRY (CONT’D) I’m sorry. VANESSA You’re talking. BARRY Yes, I know, I know. VANESSA You’re talking. BARRY I know, I’m sorry. I’m so sorry. VANESSA It’s okay. It’s fine. It’s just, I know I’m dreaming, but I don’t recall going to bed. \"Bee Movie\" - JS REVISIONS 8/13/07 35. BARRY Well, you know I’m sure this is very disconcerting. VANESSA Well yeah. I mean this is a bit of a surprise to me. I mean...you’re a bee. BARRY Yeah, I am a bee, and you know I’m not supposed to be doing this, but they were all trying to kill me and if it wasn’t for you...I mean, I had to thank you. It’s just the way I was raised. Vanessa intentionally JABS her hand with a FORK. VANESSA Ow! BARRY That was a little weird. VANESSA (to herself) I’m talking to a bee. BARRY Yeah. VANESSA I’m talking to a bee. BARRY Anyway... VANESSA And a bee is talking to me... BARRY I just want you to know that I’m grateful, and I’m going to leave now. VANESSA Wait, wait, wait, wait, how did you learn to do that? BARRY What? \"Bee Movie\" - JS REVISIONS 8/13/07 36. VANESSA The talking thing. BARRY Same way you did, I guess. Mama, Dada, honey, you pick it up. VANESSA That’s very funny. BARRY Yeah. Bees are funny. If we didn’t laugh, we’d cry. With what we have to deal with. Vanessa LAUGHS. BARRY (CONT’D) Anyway. VANESSA Can I, uh, get you something? BARRY Like what? VANESSA I don’t know. I mean, I don’t know. Coffee? BARRY Well, uh, I don’t want to put you out. VANESSA It’s no trouble. BARRY Unless you’re making anyway. VANESSA Oh, it takes two minutes. BARRY Really? VANESSA It’s just coffee. BARRY I hate to impose. \"Bee Movie\" - JS REVISIONS 8/13/07 37. VANESSA Don’t be ridiculous. BARRY Actually, I would love a cup. VANESSA Hey, you want a little rum cake? BARRY I really shouldn’t. VANESSA Have a little rum cake. BARRY No, no, no, I can’t. VANESSA Oh, come on. BARRY You know, I’m trying to lose a couple micrograms here. VANESSA Where? BARRY Well... These stripes don’t help. VANESSA You look great. BARRY I don’t know if you know anything about fashion. Vanessa starts POURING the coffee through an imaginary cup and directly onto the floor. BARRY (CONT'D) Are you alright? VANESSA No. DISSOLVE TO: SEQ. 1300 - “ROOFTOP COFFEE” \"Bee Movie\" - JS REVISIONS 8/13/07 38. EXT. VANESSA’S ROOF - LATER Barry and Vanessa are drinking coffee on her roof terrace. He is perched on her keychain. BARRY ...He can’t get a taxi. He’s making the tie in the cab, as they’re flying up Madison. So he finally gets there. VANESSA Uh huh? BARRY He runs up the steps into the church, the wedding is on... VANESSA Yeah? BARRY ...and he says, watermelon? I thought you said Guatemalan. VANESSA Uh huh? BARRY Why would I marry a watermelon? Barry laughs. Vanessa doesn’t. VANESSA Oh! Is that, uh, a bee joke? BARRY Yeah, that’s the kind of stuff that we do. VANESSA Yeah, different. A BEAT. VANESSA (CONT’D) So anyway...what are you going to do, Barry? \"Bee Movie\" - JS REVISIONS 8/13/07 39. BARRY About work? I don’t know. I want to do my part for the hive, but I can’t do it the way they want. VANESSA I know how you feel. BARRY You do? VANESSA Sure, my parents wanted me to be a lawyer or doctor, but I wanted to be a florist. BARRY Really? VANESSA My only interest is flowers. BARRY Our new queen was just elected with that same campaign slogan. VANESSA Oh. BARRY Anyway, see there’s my hive, right there. You can see it. VANESSA Oh, you’re in Sheep Meadow. BARRY (excited) Yes! You know the turtle pond? VANESSA Yes? BARRY I’m right off of that. VANESSA Oh, no way. I know that area. Do you know I lost a toe-ring there once? BARRY Really? \"Bee Movie\" - JS REVISIONS 8/13/07 40. VANESSA Yes. BARRY Why do girls put rings on their toes? VANESSA Why not? BARRY I don’t know. It’s like putting a hat on your knee. VANESSA Really? Okay. A JANITOR in the background changes a LIGHTBULB. To him, it appears that Vanessa is talking to an imaginary friend. JANITOR You all right, ma’am? VANESSA Oh, yeah, fine. Just having two cups of coffee. BARRY Anyway, this has been great. (wiping his mouth) Thanks for the coffee. Barry gazes at Vanessa. VANESSA Oh yeah, it’s no trouble. BARRY Sorry I couldn’t finish it. Vanessa giggles. BARRY (CONT'D) (re: coffee) If I did, I’d be up the rest of my life. Ummm. Can I take a piece of this with me? VANESSA Sure. Here, have a crumb. She takes a CRUMB from the plate and hands it to Barry. \"Bee Movie\" - JS REVISIONS 8/13/07 41. BARRY (a little dreamy) Oh, thanks. VANESSA Yeah. There is an awkward pause. BARRY Alright, well then, I guess I’ll see you around, or not, or... VANESSA Okay Barry. BARRY And thank you so much again, for before. VANESSA Oh that? BARRY Yeah. VANESSA Oh, that was nothing. BARRY Well, not nothing, but, anyway... Vanessa extends her hand, and shakes Barry’s gingerly. The Janitor watches. The lightbulb shorts out. The Janitor FALLS. CUT TO: SEQ. 1400 - “HONEX” INT. HONEX BUILDING - NEXT DAY ANGLE ON: A TEST BEE WEARING A PARACHUTE is in a wind tunnel, hovering through increasingly heavy wind. SIGNS UNDER A FLASHING LIGHT READ: “Test In Progress” & “Hurricane Survival Test”. 2 BEES IN A LAB COATS are observing behind glass. \"Bee Movie\" - JS REVISIONS 8/13/07 42. LAB COAT BEE 1 This can’t possibly work. LAB COAT BEE 2 Well, he’s all set to go, we may as well try it. (into the mic) Okay Dave, pull the chute. The test bee opens his parachute. He’s instantly blown against the rear wall. Adam and Barry ENTER. ADAM Sounds amazing. BARRY Oh, it was amazing. It was the scariest, happiest moment of my life. ADAM Humans! Humans! I can’t believe you were with humans! Giant scary humans! What were they like? BARRY Huge and crazy. They talk crazy, they eat crazy giant things. They drive around real crazy. ADAM And do they try and kill you like on TV? BARRY Some of them. But some of them don’t. ADAM How’d you get back? BARRY Poodle. ADAM Look, you did it. And I’m glad. You saw whatever you wanted to see out there, you had your “experience”, and now you’re back, you can pick out your job, and everything can be normal. \"Bee Movie\" - JS REVISIONS 8/13/07 43. ANGLE ON: LAB BEES examining a CANDY CORN through a microscope. BARRY Well... ADAM Well? BARRY Well, I met someone. ADAM You met someone? Was she Bee-ish? BARRY Mmm. ADAM Not a WASP? Your parents will kill you. BARRY No, no, no, not a wasp. ADAM Spider? BARRY You know, I’m not attracted to the spiders. I know to everyone else it’s like the hottest thing with the eight legs and all. I can’t get by that face. Barry makes a spider face. ADAM So, who is she? BARRY She’s a human. ADAM Oh no, no, no, no. That didn’t happen. You didn’t do that. That is a bee law. You wouldn’t break a bee law. BARRY Her name’s Vanessa. \"Bee Movie\" - JS REVISIONS 8/13/07 44. ADAM Oh, oh boy! BARRY She’s so-o nice. And she’s a florist! ADAM Oh, no. No, no, no! You’re dating a human florist? BARRY We’re not dating. ADAM You’re flying outside the hive. You’re talking to human beings that attack our homes with power washers and M-80’s. That’s 1/8 of a stick of dynamite. BARRY She saved my life. And she understands me. ADAM This is over. Barry pulls out the crumb. BARRY Eat this. Barry stuffs the crumb into Adam’s face. ADAM This is not over. What was that? BARRY They call it a crumb. ADAM That was SO STINGING STRIPEY! BARRY And that’s not even what they eat. That just falls off what they eat. Do you know what a Cinnabon is? ADAM No. \"Bee Movie\" - JS REVISIONS 8/13/07 45. BARRY It’s bread... ADAM Come in here! BARRY and cinnamon, ADAM Be quiet! BARRY and frosting...they heat it up-- ADAM Sit down! INT. ADAM’S OFFICE - CONTINUOUS BARRY Really hot! ADAM Listen to me! We are not them. We’re us. There’s us and there’s them. BARRY Yes, but who can deny the heart that is yearning... Barry rolls his chair down the corridor. ADAM There’s no yearning. Stop yearning. Listen to me. You have got to start thinking bee, my friend. ANOTHER BEE JOINS IN. ANOTHER BEE Thinking bee. WIDER SHOT AS A 3RD BEE ENTERS, popping up over the cubicle wall. 3RD BEE Thinking bee. EVEN WIDER SHOT AS ALL THE BEES JOIN IN. \"Bee Movie\" - JS REVISIONS 8/13/07 46. OTHER BEES Thinking bee. Thinking bee. Thinking bee. CUT TO: SEQ. 1500 - “POOLSIDE NAGGING” EXT. BACKYARD PARENT’S HOUSE - DAY Barry sits on a RAFT in a hexagon honey pool, legs dangling into the water. Janet Benson and Martin Benson stand over him wearing big, sixties sunglasses and cabana-type outfits. The sun shines brightly behind their heads. JANET BENSON (O.C) There he is. He’s in the pool. MARTIN BENSON You know what your problem is, Barry? BARRY I’ve got to start thinking bee? MARTIN BENSON Barry, how much longer is this going to go on? It’s been three days. I don’t understand why you’re not working. BARRY Well, I’ve got a lot of big life decisions I’m thinking about. MARTIN BENSON What life? You have no life! You have no job! You’re barely a bee! Barry throws his hands in the air. BARRY Augh. JANET BENSON Would it kill you to just make a little honey? Barry ROLLS off the raft and SINKS to the bottom of the pool. We hear his parents’ MUFFLED VOICES from above the surface. \"Bee Movie\" - JS REVISIONS 8/13/07 47. JANET BENSON (CONT'D) (muffled) Barry, come out from under there. Your father’s talking to you. Martin, would you talk to him? MARTIN BENSON Barry, I’m talking to you. DISSOLVE TO: EXT. PICNIC AREA - DAY MUSIC: “Sugar Sugar” by the Archies. Barry and Vanessa are having a picnic. A MOSQUITO lands on Vanessa’s leg. She SWATS it violently. Barry’s head whips around, aghast. They stare at each other awkwardly in a frozen moment, then BURST INTO HYSTERICAL LAUGHTER. Vanessa GETS UP. VANESSA You coming? BARRY Got everything? VANESSA All set. Vanessa gets into a one-man Ultra Light plane with a black and yellow paint scheme. She puts on her helmet. BARRY You go ahead, I’ll catch up. VANESSA (come hither wink) Don’t be too long. The Ultra Light takes off. Barry catches up. They fly sideby-side. VANESSA (CONT’D) Watch this! Vanessa does a loop, and FLIES right into the side of a mountain, BURSTING into a huge ball of flames. \"Bee Movie\" - JS REVISIONS 8/13/07 48. BARRY (yelling, anguished) Vanessa! EXT. BARRY’S PARENT’S HOUSE - CONTINUOUS ANGLE ON: Barry’s face bursting through the surface of the pool, GASPING for air, eyes opening in horror. MARTIN BENSON We’re still here, Barry. JANET BENSON I told you not to yell at him. He doesn’t respond when you yell at him. MARTIN BENSON Then why are you yelling at me? JANET BENSON Because you don’t listen. MARTIN BENSON I’m not listening to this. Barry is toweling off, putting on his sweater. BARRY Sorry Mom, I’ve got to go. JANET BENSON Where are you going? BARRY Nowhere. I’m meeting a friend. Barry JUMPS off the balcony and EXITS. JANET BENSON (calling after him) A girl? Is this why you can’t decide? BARRY Bye! JANET BENSON I just hope she’s Bee-ish. CUT TO: \"Bee Movie\" - JS REVISIONS 8/13/07 49. SEQ. 1700 - “STREETWALK/SUPERMARKET” EXT. VANESSA’S FLORIST SHOP - DAY Vanessa FLIPS the sign to say “Sorry We Missed You”, and locks the door. ANGLE ON: A POSTER on Vanessa’s door for the Tournament of Roses Parade in Pasadena. BARRY So they have a huge parade of just flowers every year in Pasadena? VANESSA Oh, to be in the Tournament of Roses, that’s every florist’s dream. Up on a float, surrounded by flowers, crowds cheering. BARRY Wow, a tournament. Do the roses actually compete in athletic events? VANESSA No. Alright, I’ve got one. How come you don’t fly everywhere? BARRY It’s exhausting. Why don’t you run everywhere? VANESSA Hmmm. BARRY Isn’t that faster? VANESSA Yeah, okay. I see, I see. Alright, your turn. Barry and Vanessa walk/fly down a New York side street, no other pedestrians near them. BARRY Ah! Tivo. You can just freeze live TV? That’s insane. \"Bee Movie\" - JS REVISIONS 8/13/07 50. VANESSA What, you don’t have anything like that? BARRY We have Hivo, but it’s a disease. It’s a horrible, horrible disease. VANESSA Oh my. They turn the corner onto a busier avenue and people start to swat at Barry. MAN Dumb bees! VANESSA You must just want to sting all those jerks. BARRY We really try not to sting. It’s usually fatal for us. VANESSA So you really have to watch your temper? They ENTER a SUPERMARKET. CUT TO: INT. SUPERMARKET BARRY Oh yeah, very carefully. You kick a wall, take a walk, write an angry letter and throw it out. You work through it like any emotion-- anger, jealousy, (under his breath) lust. Barry hops on top of some cardboard boxes in the middle of an aisle. A stock boy, HECTOR, whacks him with a rolled up magazine. VANESSA (to Barry) Oh my goodness. Are you okay? \"Bee Movie\" - JS REVISIONS 8/13/07 51. BARRY Yeah. Whew! Vanessa WHACKS Hector over the head with the magazine. VANESSA (to Hector) What is wrong with you?! HECTOR It’s a bug. VANESSA Well he’s not bothering anybody. Get out of here, you creep. Vanessa pushes him, and Hector EXITS, muttering. BARRY (shaking it off) What was that, a Pick and Save circular? VANESSA Yeah, it was. How did you know? BARRY It felt like about ten pages. Seventy-five’s pretty much our limit. VANESSA Boy, you’ve really got that down to a science. BARRY Oh, we have to. I lost a cousin to Italian Vogue. VANESSA I’ll bet. Barry stops, sees the wall of honey jars. BARRY What, in the name of Mighty Hercules, is this? How did this get here? Cute Bee? Golden Blossom? Ray Liotta Private Select? VANESSA Is he that actor? \"Bee Movie\" - JS REVISIONS 8/13/07 52. BARRY I never heard of him. Why is this here? VANESSA For people. We eat it. BARRY Why? (gesturing around the market) You don’t have enough food of your own? VANESSA Well yes, we-- BARRY How do you even get it? VANESSA Well, bees make it... BARRY I know who makes it! And it’s hard to make it! There’s Heating and Cooling, and Stirring...you need a whole Krelman thing. VANESSA It’s organic. BARRY It’s our-ganic! VANESSA It’s just honey, Barry. BARRY Just...what?! Bees don’t know about this. This is stealing. A lot of stealing! You’ve taken our homes, our schools, our hospitals. This is all we have. And it’s on sale? I’m going to get to the bottom of this. I’m going to get to the bottom of all of this! He RIPS the label off the Ray Liotta Private Select. CUT TO: \"Bee Movie\" - JS REVISIONS 8/13/07 53. SEQ. 1800 - “WINDSHIELD” EXT. BACK OF SUPERMARKET LOADING DOCK - LATER THAT DAY Barry disguises himself by blacking out his yellow lines with a MAGIC MARKER and putting on some war paint. He sees Hector, the stock boy, with a knife CUTTING open cardboard boxes filled with honey jars. MAN You almost done? HECTOR Almost. Barry steps in some honey, making a SNAPPING noise. Hector stops and turns. HECTOR (CONT’D) He is here. I sense it. Hector grabs his BOX CUTTER. Barry REACTS, hides himself behind the box again. HECTOR (CONT’D) (talking too loud, to no one in particular) Well, I guess I’ll go home now, and just leave this nice honey out, with no one around. A BEAT. Hector pretends to exit. He takes a couple of steps in place. ANGLE ON: The honey jar. Barry steps out into a moody spotlight. BARRY You’re busted, box boy! HECTOR Ah ha! I knew I heard something. So, you can talk. Barry flies up, stinger out, pushing Hector up against the wall. As Hector backs up, he drops his knife. BARRY Oh, I can talk. And now you’re going to start talking. \"Bee Movie\" - JS REVISIONS 8/13/07 54. Where are you getting all the sweet stuff? Who’s your supplier?! HECTOR I don’t know what you’re talking about. I thought we were all friends. The last thing we want to do is upset any of you...bees! Hector grabs a PUSHPIN. Barry fences with his stinger. HECTOR (CONT’D) You’re too late. It’s ours now! BARRY You, sir, have crossed the wrong sword. HECTOR You, sir, are about to be lunch for my iguana, Ignacio! Barry and Hector get into a cross-swords, nose-to-nose confrontation. BARRY Where is the honey coming from? Barry knocks the pushpin out of his hand. Barry puts his stinger up to Hector’s nose. BARRY (CONT'D) Tell me where?! HECTOR (pointing to a truck) Honey Farms. It comes from Honey Farms. ANGLE ON: A Honey Farms truck leaving the parking lot. Barry turns, takes off after the truck through an alley. He follows the truck out onto a busy street, dodging a bus, and several cabs. CABBIE Crazy person! He flies through a metal pipe on the top of a truck. BARRY OOOHHH! \"Bee Movie\" - JS REVISIONS 8/13/07 55. BARRY (CONT'D) Barry grabs onto a bicycle messenger’s backpack. The honey farms truck starts to pull away. Barry uses the bungee cord to slingshot himself towards the truck. He lands on the windshield, where the wind plasters him to the glass. He looks up to find himself surrounded by what appear to be DEAD BUGS. He climbs across, working his way around the bodies. BARRY (CONT’D) Oh my. What horrible thing has happened here? Look at these faces. They never knew what hit them. And now they’re on the road to nowhere. A MOSQUITO opens his eyes. MOOSEBLOOD Pssst! Just keep still. BARRY What? You’re not dead? MOOSEBLOOD Do I look dead? Hey man, they will wipe anything that moves. Now, where are you headed? BARRY To Honey Farms. I am onto something huge here. MOOSEBLOOD I’m going to Alaska. Moose blood. Crazy stuff. Blows your head off. LADYBUG I’m going to Tacoma. BARRY (to fly) What about you? MOOSEBLOOD He really is dead. BARRY Alright. The WIPER comes towards them. \"Bee Movie\" - JS REVISIONS 8/13/07 56. MOOSEBLOOD Uh oh. BARRY What is that? MOOSEBLOOD Oh no! It’s a wiper, triple blade! BARRY Triple blade? MOOSEBLOOD Jump on. It’s your only chance, bee. They hang on as the wiper goes back and forth. MOOSEBLOOD (CONT'D) (yelling to the truck driver through the glass) Why does everything have to be so dog-gone clean?! How much do you people need to see? Open your eyes! Stick your head out the window! CUT TO: INT. TRUCK CAB SFX: Radio. RADIO VOICE For NPR News in Washington, I’m Carl Kasell. EXT. TRUCK WINDSHIELD MOOSEBLOOD But don’t kill no more bugs! The Mosquito is FLUNG off of the wiper. MOOSEBLOOD (CONT'D) Beeeeeeeeeeeeee! BARRY Moose blood guy! \"Bee Movie\" - JS REVISIONS 8/13/07 57. Barry slides toward the end of the wiper, is thrown off, but he grabs the AERIAL and hangs on for dear life. Barry looks across and sees a CRICKET on another vehicle in the exact same predicament. They look at each other and SCREAM in unison. BARRY AND CRICKET Aaaaaaaaaah! ANOTHER BUG grabs onto the aerial, and screams as well. INT. TRUCK CAB - SAME TIME DRIVER You hear something? TRUCKER PASSENGER Like what? DRIVER Like tiny screaming. TRUCKER PASSENGER Turn off the radio. The driver reaches down and PRESSES a button, lowering the aerial. EXT. TRUCK WINDSHIELD - SAME TIME Barry and the other bug do a “choose up” to the bottom, Barry wins. BARRY Aha! Then he finally has to let go and gets thrown into the truck horn atop cab. Mooseblood is inside. MOOSEBLOOD Hey, what’s up bee boy? BARRY Hey, Blood! DISSOLVE TO: \"Bee Movie\" - JS REVISIONS 8/13/07 58. INT. TRUCK HORN - LATER BARRY ...and it was just an endless row of honey jars as far as the eye could see. MOOSEBLOOD Wow. BARRY So I’m just assuming wherever this honey truck goes, that’s where they’re getting it. I mean, that honey’s ours! MOOSEBLOOD Bees hang tight. BARRY Well, we’re all jammed in there. It’s a close community. MOOSEBLOOD Not us, man. We’re on our own. Every mosquito is on his own. BARRY But what if you get in trouble? MOOSEBLOOD Trouble? You're a mosquito. You're in trouble! Nobody likes us. They’re just all smacking. People see a mosquito, smack, smack! BARRY At least you’re out in the world. You must meet a lot of girls. MOOSEBLOOD Mosquito girls try to trade up; get with a moth, dragonfly...mosquito girl don’t want no mosquito. A BLOOD MOBILE pulls up alongside. MOOSEBLOOD (CONT'D) Whoa, you have got to be kidding me. Mooseblood’s about to leave the building. So long bee. \"Bee Movie\" - JS REVISIONS 8/13/07 59. Mooseblood EXITS the horn, and jumps onto the blood mobile. MOOSEBLOOD (CONT'D) Hey guys. I knew I’d catch you all down here. Did you bring your crazy straws? CUT TO: SEQ. 1900 - “THE APIARY” EXT. APIARY - LATER Barry sees a SIGN, “Honey Farms” The truck comes to a stop. SFX: The Honey farms truck blares its horn. Barry flies out, lands on the hood. ANGLE ON: Two BEEKEEPERS, FREDDY and ELMO, walking around to the back of the gift shop. Barry follows them, and lands in a nearby tree FREDDY ...then we throw it in some jars, slap a label on it, and it’s pretty much pure profit. BARRY What is this place? ELMO Bees got a brain the size of a pinhead. FREDDY They are pinheads. The both LAUGH. ANGLE ON: Barry REACTING. They arrive at the back of the shop where one of them opens a SMOKER BOX. FREDDY (CONT’D) Hey, check out the new smoker. \"Bee Movie\" - JS REVISIONS 8/13/07 60. ELMO Oh, Sweet. That’s the one you want. FREDDY The Thomas 3000. BARRY Smoker? FREDDY 90 puffs a minute, semi-automatic. Twice the nicotine, all the tar. They LAUGH again, nefariously. FREDDY (CONT’D) Couple of breaths of this, and it knocks them right out. They make the honey, and we make the money. BARRY “They make the honey, and we make the money?” Barry climbs onto the netting of Freddy’s hat. He climbs up to the brim and looks over the edge. He sees the apiary boxes as Freddy SMOKES them. BARRY (CONT'D) Oh my. As Freddy turns around, Barry jumps into an open apiary box, and into an apartment. HOWARD and FRAN are just coming to from the smoking. BARRY (CONT’D) What’s going on? Are you okay? HOWARD Yeah, it doesn’t last too long. HE COUGHS a few times. BARRY How did you two get here? Do you know you’re in a fake hive with fake walls? HOWARD (pointing to a picture on the wall) \"Bee Movie\" - JS REVISIONS 8/13/07 61. Our queen was moved here, we had no choice. BARRY (looking at a picture on the wall) This is your queen? That’s a man in women’s clothes. That’s a dragqueen! The other wall opens. Barry sees the hundreds of apiary boxes. BARRY (CONT'D) What is this? Barry pulls out his camera, and starts snapping. BARRY (CONT’D) Oh no. There’s hundreds of them. (V.O, as Barry takes pictures) Bee honey, our honey, is being brazenly stolen on a massive scale. CUT TO: SEQ. 2100 - “BARRY TELLS FAMILY” INT. BARRY’S PARENT’S HOUSE - LIVING ROOM - LATER Barry has assembled his parents, Adam, and Uncle Carl. BARRY This is worse than anything the bears have done to us. And I intend to do something about it. JANET BENSON Oh Barry, stop. MARTIN BENSON Who told you that humans are taking our honey? That’s just a rumor. BARRY Do these look like rumors? Barry throws the PICTURES on the table. Uncle Carl, cleaning his glasses with his shirt tail, digs through a bowl of nuts with his finger. \"Bee Movie\" - JS REVISIONS 8/13/07 62. HOWARD (CONT'D) UNCLE CARL That’s a conspiracy theory. These are obviously doctored photos. JANET BENSON Barry, how did you get mixed up in all this? ADAM (jumping up) Because he’s been talking to humans! JANET BENSON Whaaat? MARTIN BENSON Talking to humans?! Oh Barry. ADAM He has a human girlfriend and they make out! JANET BENSON Make out? Barry? BARRY We do not. ADAM You wish you could. BARRY Who’s side are you on? ADAM The bees! Uncle Carl stands up and pulls his pants up to his chest. UNCLE CARL I dated a cricket once in San Antonio. Man, those crazy legs kept me up all night. Hotcheewah! JANET BENSON Barry, this is what you want to do with your life? BARRY This is what I want to do for all our lives. Nobody works harder than bees. \"Bee Movie\" - JS REVISIONS 8/13/07 63. Dad, I remember you coming home some nights so overworked, your hands were still stirring. You couldn’t stop them. MARTIN BENSON Ehhh... JANET BENSON (to Martin) I remember that. BARRY What right do they have to our hardearned honey? We’re living on two cups a year. They’re putting it in lip balm for no reason what-soever. MARTIN BENSON Even if it’s true, Barry, what could one bee do? BARRY I’m going to sting them where it really hurts. MARTIN BENSON In the face? BARRY No. MARTIN BENSON In the eye? That would really hurt. BARRY No. MARTIN BENSON Up the nose? That’s a killer. BARRY No. There’s only one place you can sting the humans. One place where it really matters. CUT TO: SEQ. 2300 - “HIVE AT 5 NEWS/BEE LARRY KING” \"Bee Movie\" - JS REVISIONS 8/13/07 64. BARRY (CONT'D) INT. NEWS STUDIO - DAY DRAMATIC NEWS MUSIC plays as the opening news sequence rolls. We see the “Hive at Five” logo, followed by shots of past news events: A BEE freeway chase, a BEE BEARD protest rally, and a BEAR pawing at the hive as the BEES flee in panic. BOB BUMBLE (V.O.) Hive at Five, the hive’s only full hour action news source... SHOTS of NEWSCASTERS flash up on screen. BOB BUMBLE (V.O.) (CONT'D) With Bob Bumble at the anchor desk... BOB has a big shock of anchorman hair, gray temples and overly white teeth. BOB BUMBLE (V.O.) (CONT'D) ...weather with Storm Stinger, sports with Buzz Larvi, and Jeanette Chung. JEANETTE is an Asian bee. BOB BUMBLE (CONT'D) Good evening, I’m Bob Bumble. JEANETTE CHUNG And I’m Jeanette Chung. BOB BUMBLE Our top story, a tri-county bee, Barry Benson... INSERT: Barry’s graduation picture. BOB BUMBLE (CONT'D) ...is saying he intends to sue the human race for stealing our honey, packaging it, and profiting from it illegally. CUT TO: \"Bee Movie\" - JS REVISIONS 8/13/07 65. INT. BEENN STUDIO - BEE LARRY KING LIVE BEE LARRY KING, wearing suspenders and glasses, is interviewing Barry. A LOWER-THIRD CHYRON reads: “Bee Larry King Live.” BEE LARRY KING Don’t forget, tomorrow night on Bee Larry King, we are going to have three former Queens all right here in our studio discussing their new book, “Classy Ladies,” out this week on Hexagon. (to Barry) Tonight, we’re talking to Barry Benson. Did you ever think, I’m just a kid from the hive, I can’t do this? BARRY Larry, bees have never been afraid to change the world. I mean, what about Bee-Columbus? Bee-Ghandi? Be-geesus? BEE LARRY KING Well, where I’m from you wouldn’t think of suing humans. We were thinking more like stick ball, candy stores. BARRY How old are you? BEE LARRY KING I want you to know that the entire bee community is supporting you in this case, which is certain to be the trial of the bee century. BARRY Thank you, Larry. You know, they have a Larry King in the human world, too. BEE LARRY KING It’s a common name. Next week on Bee Larry King... \"Bee Movie\" - JS REVISIONS 8/13/07 66. BARRY No, I mean he looks like you. And he has a show with suspenders and different colored dots behind him. BEE LARRY KING Next week on Bee Larry King... BARRY Old guy glasses, and there’s quotes along the bottom from the guest you’re watching even though you just heard them... BEE LARRY KING Bear week next week! They’re scary, they’re hairy, and they’re here live. Bee Larry King EXITS. BARRY Always leans forward, pointy shoulders, squinty eyes... (lights go out) Very Jewish. CUT TO: SEQ. 2400 - “FLOWER SHOP” INT. VANESSA’S FLOWER SHOP - NIGHT Stacks of law books are piled up, legal forms, etc. Vanessa is talking with Ken in the other room. KEN Look, in tennis, you attack at the point of weakness. VANESSA But it was my grandmother, Ken. She’s 81. KEN Honey, her backhand’s a joke. I’m not going to take advantage of that? \"Bee Movie\" - JS REVISIONS 8/13/07 67. BARRY (O.C) Quiet please. Actual work going on here. KEN Is that that same bee? BARRY (O.C) Yes it is. VANESSA I’m helping him sue the human race. KEN What? Barry ENTERS. BARRY Oh, hello. KEN Hello Bee. Barry flies over to Vanessa. VANESSA This is Ken. BARRY Yeah, I remember you. Timberland, size 10 1/2, Vibram sole I believe. KEN Why does he talk again, Hun? VANESSA (to Ken, sensing the tension) Listen, you’d better go because we’re really busy working. KEN But it’s our yogurt night. VANESSA (pushing him out the door) Oh...bye bye. She CLOSES the door. KEN Why is yogurt night so difficult?! \"Bee Movie\" - JS REVISIONS 8/13/07 68. Vanessa ENTERS the back room carrying coffee. VANESSA Oh you poor thing, you two have been at this for hours. BARRY Yes, and Adam here has been a huge help. ANGLE ON: A EMPTY CINNABON BOX with Adam asleep inside, covered in frosting. VANESSA How many sugars? BARRY Just one. I try not to use the competition. So, why are you helping me, anyway? VANESSA Bees have good qualities. BARRY (rowing on the sugar cube like a gondola) Si, Certo. VANESSA And it feels good to take my mind off the shop. I don’t know why, instead of flowers, people are giving balloon bouquets now. BARRY Yeah, those are great...if you’re 3. VANESSA And artificial flowers. BARRY (re: plastic flowers) Oh, they just get me psychotic! VANESSA Yeah, me too. BARRY The bent stingers, the pointless pollination. \"Bee Movie\" - JS REVISIONS 8/13/07 69. VANESSA Bees must hate those fake plastic things. BARRY There’s nothing worse than a daffodil that’s had work done. VANESSA (holding up the lawsuit documents) Well, maybe this can make up for it a little bit. CUT TO: EXT. VANESSA’S FLORIST SHOP They EXIT the store, and cross to the mailbox. VANESSA You know Barry, this lawsuit is a pretty big deal. BARRY I guess. VANESSA Are you sure that you want to go through with it? BARRY Am I sure? (kicking the envelope into the mailbox) When I’m done with the humans, they won’t be able to say, “Honey, I’m home,” without paying a royalty. CUT TO: SEQ. 2700 - “MEET MONTGOMERY” EXT. MANHATTAN COURTHOUSE - DAY P.O.V SHOT - A camera feed turns on, revealing a newsperson. \"Bee Movie\" - JS REVISIONS 8/13/07 70. PRESS PERSON #2 (talking to camera) Sarah, it’s an incredible scene here in downtown Manhattan where all eyes and ears of the world are anxiously waiting, because for the first time in history, we’re going to hear for ourselves if a honey bee can actually speak. ANGLE ON: Barry, Vanessa, and Adam getting out of the cab. The press spots Barry and Vanessa and pushes in. Adam sits on Vanessa’s shoulder. INT. COURTHOUSE - CONTINUOUS Barry, Vanessa, and Adam sit at the Plaintiff’s Table. VANESSA (turns to Barry) What have we gotten into here, Barry? BARRY I don’t know, but it’s pretty big, isn’t it? ADAM I can’t believe how many humans don’t have to be at work during the day. BARRY Hey, you think these billion dollar multinational food companies have good lawyers? CUT TO: EXT. COURTHOUSE STEPS - CONTINUOUS A BIG BLACK CAR pulls up. ANGLE ON: the grill filling the frame. We see the “L.T.M” monogram on the hood ornament. The defense lawyer, LAYTON T. MONTGOMERY comes out, squashing a bug on the pavement. CUT TO: \"Bee Movie\" - JS REVISIONS 8/13/07 71. INT. COURTHOUSE - CONTINUOUS Barry SHUDDERS. VANESSA What’s the matter? BARRY I don’t know. I just got a chill. Montgomery ENTERS. He walks by Barry’s table shaking a honey packet. MONTGOMERY Well, if it isn’t the B-Team. (re: the honey packet) Any of you boys work on this? He CHUCKLES. The JUDGE ENTERS. SEQ. 3000 - “WITNESSES” BAILIFF All rise! The Honorable Judge Bumbleton presiding. JUDGE (shuffling papers) Alright...Case number 4475, Superior Court of New York. Barry Bee Benson vs. the honey industry, is now in session. Mr. Montgomery, you are representing the five major food companies, collectively. ANGLE ON: Montgomery’s BRIEFCASE. It has an embossed emblem of an EAGLE, holding a gavel in one talon and a briefcase in the other. MONTGOMERY A privilege. JUDGE Mr. Benson. Barry STANDS. JUDGE (CONT’D) You are representing all bees of the world? \"Bee Movie\" - JS REVISIONS 8/13/07 72. Montgomery, the stenographer, and the jury lean in. CUT TO: EXT. COURTHOUSE - CONTINUOUS The spectators outside freeze. The helicopters angle forward to listen closely. CUT TO: INT. COURTHOUSE BARRY Bzzz bzzz bzzz...Ahh, I’m kidding, I’m kidding. Yes, your honor. We are ready to proceed. ANGLE ON: Courtroom hub-bub. JUDGE And Mr. Montgomery, your opening statement, please. Montgomery rises. MONTGOMERY (grumbles, clears his throat) Ladies and gentlemen of the jury. My grandmother was a simple woman. Born on a farm, she believed it was man's divine right to benefit from the bounty of nature God put before us. If we were to live in the topsy-turvy world Mr. Benson imagines, just think of what it would mean. Maybe I would have to negotiate with the silk worm for the elastic in my britches. Talking bee. How do we know this isn’t some sort of holographic motion picture capture Hollywood wizardry? They could be using laser beams, robotics, ventriloquism, cloning...for all we know he could be on steroids! Montgomery leers at Barry, who moves to the stand. \"Bee Movie\" - JS REVISIONS 8/13/07 73. JUDGE Mr. Benson? Barry makes his opening statement. BARRY Ladies and Gentlemen of the jury, there’s no trickery here. I’m just an ordinary bee. And as a bee, honey’s pretty important to me. It’s important to all bees. We invented it, we make it, and we protect it with our lives. Unfortunately, there are some people in this room who think they can take whatever they want from us cause we’re the little guys. And what I’m hoping is that after this is all over, you’ll see how by taking our honey, you’re not only taking away everything we have, but everything we are. ANGLE ON: Vanessa smiling. ANGLE ON: The BEE GALLERY wiping tears away. CUT TO: INT. BENSON HOUSE Barry’s family is watching the case on TV. JANET BENSON Oh, I wish he would dress like that all the time. So nice... CUT TO: INT. COURTROOM - LATER JUDGE Call your first witness. CUT TO: \"Bee Movie\" - JS REVISIONS 8/13/07 74. INT. COURTHOUSE - LATER BARRY So, Mr. Klauss Vanderhayden of Honey Farms. Pretty big company you have there? MR. VANDERHAYDEN I suppose so. BARRY And I see you also own HoneyBurton, and Hon-Ron. MR. VANDERHAYDEN Yes. They provide beekeepers for our farms. BARRY Beekeeper. I find that to be a very disturbing term, I have to say. I don’t imagine you employ any bee free-ers, do you? MR. VANDERHAYDEN No. BARRY I’m sorry. I couldn’t hear you. MR. VANDERHAYDEN (louder) No. BARRY No. Because you don’t free bees. You keep bees. And not only that, it seems you thought a bear would be an appropriate image for a jar of honey? MR. VANDERHAYDEN Well, they’re very lovable creatures. Yogi-bear, Fozzy-bear, Build-a-bear. BARRY Yeah, you mean like this?! Vanessa and the SUPERINTENDANT from her building ENTER with a GIANT FEROCIOUS GRIZZLY BEAR. He has a neck collar and chains extending from either side. \"Bee Movie\" - JS REVISIONS 8/13/07 75. By pulling the chains, they bring him directly in front of Vanderhayden. The bear LUNGES and ROARS. BARRY (CONT'D) Bears kill bees! How would you like his big hairy head crashing into your living room? Biting into your couch, spitting out your throwpillows...rowr, rowr! The bear REACTS. BEAR Rowr!! BARRY Okay, that’s enough. Take him away. Vanessa and the Superintendant pull the bear out of the courtroom. Vanderhayden TREMBLES. The judge GLARES at him. CUT TO: INT. COURTROOM- A LITTLE LATER Barry questions STING. BARRY So, Mr. Sting. Thank you for being here. Your name intrigues me, I have to say. Where have I heard it before? STING I was with a band called \"The Police\". BARRY But you've never been a police officer of any kind, have you? STING No, I haven't. \"Bee Movie\" - JS REVISIONS 8/13/07 76. BARRY No, you haven’t. And so, here we have yet another example of bee culture being casually stolen by a human for nothing more than a prance-about stage name. STING Oh please. BARRY Have you ever been stung, Mr. Sting? Because I'm feeling a little stung, Sting. Or should I say, (looking in folder) Mr. Gordon M. Sumner? The jury GASPS. MONTGOMERY (to his aides) That’s not his real name? You idiots! CUT TO: INT. COURTHOUSE- LATER BARRY Mr. Liotta, first may I offer my belated congratulations on your Emmy win for a guest spot on E.R. in 2005. LIOTTA Thank you. Thank you. Liotta LAUGHS MANIACALLY. BARRY I also see from your resume that you’re devilishly handsome, but with a churning inner turmoil that’s always ready to blow. LIOTTA I enjoy what I do. Is that a crime? \"Bee Movie\" - JS REVISIONS 8/13/07 77. BARRY Not yet it isn’t. But is this what it’s come to for you, Mr. Liotta? Exploiting tiny helpless bees so you don’t have to rehearse your part, and learn your lines, Sir? LIOTTA Watch it Benson, I could blow right now. BARRY This isn’t a goodfella. This is a badfella! LIOTTA (exploding, trying to smash Barry with the Emmy) Why doesn’t someone just step on this little creep and we can all go home? You’re all thinking it. Say it! JUDGE Order! Order in this courtroom! A MONTAGE OF NEWSPAPER HEADLINES FOLLOWS: NEW YORK POST: “Bees to Humans: Buzz Off”. NEW YORK TELEGRAM: “Sue Bee”. DAILY VARIETY: “Studio Dumps Liotta Project. Slams Door on Unlawful Entry 2.” CUT TO: SEQ. 3175 - “CANDLELIGHT DINNER” INT. VANESSA’S APARTMENT Barry and Vanessa are having a candle light dinner. Visible behind Barry is a “LITTLE MISSY” SET BOX, with the flaps open. BARRY Well, I just think that was awfully nice of that bear to pitch in like that. \"Bee Movie\" - JS REVISIONS 8/13/07 78. VANESSA I’m telling you, I think the jury’s on our side. BARRY Are we doing everything right...you know, legally? VANESSA I’m a florist. BARRY Right, right. Barry raises his glass. BARRY (CONT’D) Well, here’s to a great team. VANESSA To a great team. They toast. Ken ENTERS KEN Well hello. VANESSA Oh...Ken. BARRY Hello. VANESSA I didn’t think you were coming. KEN No, I was just late. I tried to call. But, (holding his cell phone) the battery... VANESSA I didn’t want all this to go to waste, so I called Barry. Luckily he was free. BARRY Yeah. KEN (gritting his teeth) Oh, that was lucky. \"Bee Movie\" - JS REVISIONS 8/13/07 79. VANESSA Well, there’s still a little left. I could heat it up. KEN Yeah, heat it up. Sure, whatever. Vanessa EXITS. Ken and Barry look at each other as Barry eats. BARRY So, I hear you’re quite a tennis player. I’m not much for the game myself. I find the ball a little grabby. KEN That’s where I usually sit. Right there. VANESSA (O.C) Ken, Barry was looking at your resume, and he agreed with me that “eating with chopsticks” isn’t really a special skill. KEN (to Barry) You think I don’t see what you’re doing? BARRY Hey look, I know how hard it is trying to find the right job. We certainly have that in common. KEN Do we? BARRY Well, bees have 100% employment, of course. But we do jobs like taking the crud out. KEN That’s just what I was thinking about doing. Ken holds his table knife up. It slips out of his hand. He goes under the table to pick it up. \"Bee Movie\" - JS REVISIONS 8/13/07 80. VANESSA Ken, I let Barry borrow your razor for his fuzz. I hope that was alright. Ken hits his head on the table. BARRY I’m going to go drain the old stinger. KEN Yeah, you do that. Barry EXITS to the bathroom, grabbing a small piece of a VARIETY MAGAZINE on the way. BARRY Oh, look at that. Ken slams the champagne down on the table. Ken closes his eyes and buries his face in his hands. He grabs a magazine on the way into the bathroom. SEQ. 2800 - “BARRY FIGHTS KEN” INT. BATHROOM - CONTINUOUS Ken ENTERS, closes the door behind him. He’s not happy. Barry is washing his hands. He glances back at Ken. KEN You know, I’ve just about had it with your little mind games. BARRY What’s that? KEN Italian Vogue. BARRY Mamma Mia, that’s a lot of pages. KEN It’s a lot of ads. BARRY Remember what Van said. Why is your life any more valuable than mine? \"Bee Movie\" - JS REVISIONS 8/13/07 81. KEN It’s funny, I just can’t seem to recall that! Ken WHACKS at Barry with the magazine. He misses and KNOCKS EVERYTHING OFF THE VANITY. Ken grabs a can of AIR FRESHENER. KEN (CONT'D) I think something stinks in here. He sprays at Barry. BARRY I love the smell of flowers. KEN Yeah? How do you like the smell of flames? Ken lights the stream. BARRY Not as much. Barry flies in a circle. Ken, trying to stay with him, spins in place. ANGLE ON: Flames outside the bathroom door. Ken slips on the Italian Vogue, falls backward into the shower, pulling down the shower curtain. The can hits him in the head, followed by the shower curtain rod, and the rubber duck. Ken reaches back, grabs the handheld shower head. He whips around, looking for Barry. ANGLE ON: A WATERBUG near the drain. WATERBUG Waterbug. Not taking sides. Barry is on the toilet tank. He comes out from behind a shampoo bottle, wearing a chapstick cap as a helmet. BARRY Ken, look at me! I’m wearing a chapstick hat. This is pathetic. ANGLE ON: Ken turning the hand shower nozzle from “GENTLE”, to “TURBO”, to “LETHAL”. \"Bee Movie\" - JS REVISIONS 8/13/07 82. KEN I’ve got issues! Ken fires the water at Barry, knocking him into the toilet. The items from the vanity (emory board, lipstick, eye curler, etc.) are on the toilet seat. Ken looks down at Barry. KEN (CONT'D) Well well well, a royal flush. BARRY You’re bluffing. KEN Am I? Ken flushes the toilet. Barry grabs the Emory board and uses it to surf. He puts his hand in the water while he’s surfing. Some water splashes on Ken. BARRY Surf’s up, dude! KEN Awww, poo water! He does some skate board-style half-pipe riding. Barry surfs out of the toilet. BARRY That bowl is gnarly. Ken tries to get a shot at him with the toilet brush. KEN Except for those dirty yellow rings. Vanessa ENTERS. VANESSA Kenneth! What are you doing? KEN You know what? I don’t even like honey! I don’t eat it! VANESSA We need to talk! \"Bee Movie\" - JS REVISIONS 8/13/07 83. She pulls Ken out by his ear. Ken glares at Barry. CUT TO: INT. HALLWAY - CONTINUOUS VANESSA He’s just a little bee. And he happens to be the nicest bee I’ve met in a long time. KEN Long time? What are you talking about? Are there other bugs in your life? VANESSA No, but there are other things bugging me in life. And you’re one of them! KEN Fine! Talking bees, no yogurt night...my nerves are fried from riding on this emotional rollercoaster. VANESSA Goodbye, Ken. KEN Augh! VANESSA Whew! Ken EXITS, then re-enters frame. KEN And for your information, I prefer sugar-free, artificial sweeteners, made by man! He EXITS again. The DOOR SLAMS behind him. VANESSA (to Barry) I’m sorry about all that. Ken RE-ENTERS. \"Bee Movie\" - JS REVISIONS 8/13/07 84. KEN I know it’s got an aftertaste! I like it! BARRY (re: Ken) I always felt there was some kind of barrier between Ken and me. (puts his hands in his pockets) I couldn’t overcome it. Oh well. VANESSA Are you going to be okay for the trial tomorrow? BARRY Oh, I believe Mr. Montgomery is about out of ideas. CUT TO: SEQ. 3300 - “ADAM STINGS MONTY” INT. COURTROOM - NEXT DAY ANGLE ON: Medium shot of Montgomery standing at his table. MONTGOMERY We would like to call Mr. Barry Benson Bee to the stand. ADAM (whispering to Vanessa) Now that’s a good idea. (to Barry) You can really see why he’s considered one of the very best lawyers-- Oh. Barry rolls his eyes. He gets up, takes the stand. A juror in a striped shirt APPLAUDS. MR. GAMMIL (whispering) Layton, you’ve got to weave some magic with this jury, or it’s going to be all over. Montgomery is holding a BOOK, “The Secret Life of Bees”. \"Bee Movie\" - JS REVISIONS 8/13/07 85. MONTGOMERY (confidently whispering) Oh, don’t worry Mr. Gammil. The only thing I have to do to turn this jury around is to remind them of what they don’t like about bees. (to Gammil) You got the tweezers? Mr. Gammil NODS, and pats his breast pocket. MR. GAMMIL Are you allergic? MONTGOMERY Only to losing, son. Only to losing. Montgomery approaches the stand. MONTGOMERY (CONT’D) Mr. Benson Bee. I’ll ask you what I think we’d all like to know. What exactly is your relationship to that woman? Montgomery points to Vanessa. BARRY We’re friends. MONTGOMERY Good friends? BARRY Yes. MONTGOMERY (softly in Barry’s face) How good? BARRY What? MONTGOMERY Do you live together? BARRY Wait a minute, this isn’t about-- \"Bee Movie\" - JS REVISIONS 8/13/07 86. MONTGOMERY Are you her little... (clearing throat) ... bed bug? BARRY (flustered) Hey, that’s not the kind of-- MONTGOMERY I’ve seen a bee documentary or two. Now, from what I understand, doesn’t your Queen give birth to all the bee children in the hive? BARRY Yeah, but-- MONTGOMERY So those aren’t even your real parents! ANGLE ON: Barry’s parents. MARTIN BENSON Oh, Barry. BARRY Yes they are! ADAM Hold me back! Vanessa holds him back with a COFFEE STIRRER. Montgomery points to Barry’s parents. MONTGOMERY You’re an illegitimate bee, aren’t you Benson? ADAM He’s denouncing bees! All the bees in the courtroom start to HUM. They’re agitated. MONTGOMERY And don’t y’all date your cousins? \"Bee Movie\" - JS REVISIONS 8/13/07 87. VANESSA (standing, letting go of Adam) Objection! Adam explodes from the table and flies towards Montgomery. ADAM I’m going to pin cushion this guy! Montgomery turns around and positions himself by the judge’s bench. He sticks his butt out. Montgomery winks at his team. BARRY Adam, don’t! It’s what he wants! Adam shoves Barry out of the way. Adam STINGS Montgomery in the butt. The jury REACTS, aghast. MONTGOMERY Ow! I’m hit! Oh, lordy, I am hit! The judge BANGS her gavel. JUDGE Order! Order! Please, Mr. Montgomery. MONTGOMERY The venom! The venom is coursing through my veins! I have been felled by a wing-ed beast of destruction. You see? You can’t treat them like equals. They’re strip-ed savages! Stinging’s the only thing they know! It’s their way! ANGLE ON: Adam, collapsed on the floor. Barry rushes to his side. BARRY Adam, stay with me. ADAM I can’t feel my legs. Montgomery falls on the Bailiff. BAILIFF Take it easy. \"Bee Movie\" - JS REVISIONS 8/13/07 88. MONTGOMERY Oh, what angel of mercy will come forward to suck the poison from my heaving buttocks? The JURY recoils. JUDGE Please, I will have order in this court. Order! Order, please! FADE TO: SEQ. 3400 - “ADAM AT HOSPITAL” INT. HOSPITAL - STREET LEVEL ROOM - DAY PRESS PERSON #1 (V.O) The case of the honey bees versus the human race took a pointed turn against the bees yesterday, when one of their legal team stung Layton T. Montgomery. Now here’s Don with the 5-day. A NURSE lets Barry into the room. Barry CARRIES a FLOWER. BARRY Thank you. Barry stands over Adam, in a bed. Barry lays the flower down next to him. The TV is on. BARRY (CONT'D) Hey buddy. ADAM Hey. BARRY Is there much pain? Adam has a BEE-SIZED PAINKILLER HONEY BUTTON near his head that he presses. ADAM (pressing the button) Yeah...I blew the whole case, didn’t I? \"Bee Movie\" - JS REVISIONS 8/13/07 89. BARRY Oh, it doesn’t matter. The important thing is you’re alive. You could have died. ADAM I’d be better off dead. Look at me. Adam THROWS the blanket off his lap, revealing a GREEN SANDWICH SWORD STINGER. ADAM (CONT’D) (voice cracking) They got it from the cafeteria, they got it from downstairs. In a tuna sandwich. Look, there’s a little celery still on it. BARRY What was it like to sting someone? ADAM I can’t explain it. It was all adrenaline...and then...ecstasy. Barry looks at Adam. BARRY Alright. ADAM You think that was all a trap? BARRY Of course. I’m sorry. I flew us right into this. What were we thinking? Look at us, we’re just a couple of bugs in this world. ADAM What do you think the humans will do to us if they win? BARRY I don’t know. ADAM I hear they put the roaches in motels. That doesn’t sound so bad. \"Bee Movie\" - JS REVISIONS 8/13/07 90. BARRY Adam, they check in, but they don’t check out. Adam GULPS. ADAM Oh my. ANGLE ON: the hospital window. We see THREE PEOPLE smoking outside on the sidewalk. The smoke drifts in. Adam COUGHS. ADAM (CONT’D) Say, could you get a nurse to close that window? BARRY Why? ADAM The smoke. Bees don’t smoke. BARRY Right. Bees don’t smoke. Bees don’t smoke! But some bees are smoking. Adam, that’s it! That’s our case. Adam starts putting his clothes on. ADAM It is? It’s not over? BARRY No. Get up. Get dressed. I’ve got to go somewhere. You get back the court and stall. Stall anyway you can. CUT TO: SEQ. 3500 - “SMOKING GUN” INT. COURTROOM - THE NEXT DAY Adam is folding a piece of paper into a boat. ADAM ...and assuming you’ve done step 29 correctly, you’re ready for the tub. \"Bee Movie\" - JS REVISIONS 8/13/07 91. ANGLE ON: The jury, all with paper boats of their own. JURORS Ooh. ANGLE ON: Montgomery frustrated with Gammil, who’s making a boat also. Monty crumples Gammil’s boat, and throws it at him. JUDGE Mr. Flayman? ADAM Yes? Yes, Your Honor? JUDGE Where is the rest of your team? ADAM (fumbling with his swordstinger) Well, your honor, it’s interesting. You know Bees are trained to fly kind of haphazardly and as a result quite often we don’t make very good time. I actually once heard a pretty funny story about a bee-- MONTGOMERY Your Honor, haven’t these ridiculous bugs taken up enough of this court’s valuable time? Montgomery rolls out from behind his table. He’s suspended in a LARGE BABY CHAIR with wheels. MONTGOMERY (CONT'D) How much longer are we going to allow these absurd shenanigans to go on? They have presented no compelling evidence to support their charges against my clients who have all run perfectly legitimate businesses. I move for a complete dismissal of this entire case. JUDGE Mr. Flayman, I am afraid I am going to have to consider Mr. Montgomery’s motion. \"Bee Movie\" - JS REVISIONS 8/13/07 92. ADAM But you can’t. We have a terrific case. MONTGOMERY Where is your proof? Where is the evidence? Show me the smoking gun. Barry bursts through the door. BARRY Hold it, your honor. You want a smoking gun? Here is your smoking gun. Vanessa ENTERS, holding a bee smoker Vanessa slams the beekeeper's SMOKER onto the judge’s bench. JUDGE What is that? BARRY It’s a Bee smoker. Montgomery GRABS the smoker. MONTGOMERY What, this? This harmless little contraption? This couldn’t hurt a fly, let alone a bee. He unintentionally points it towards the bee gallery, KNOCKING THEM ALL OUT. The jury GASPS. The press SNAPS pictures of them. BARRY Members of the jury, look at what has happened to bees who have never been asked, \"Smoking or Non?\" Is this what nature intended for us? To be forcibly addicted to these smoke machines in man-made wooden slat work camps? Living out our lives as honey slaves to the white man? Barry gestures dramatically towards Montgomery's racially mixed table. The BLACK LAWYER slowly moves his chair away. GAMMIL What are we going to do? \"Bee Movie\" - JS REVISIONS 8/13/07 93. MONTGOMERY (to Pross) He's playing the species card. Barry lands on the scale of justice, by the judge’s bench. It balances as he lands. BARRY Ladies and gentlemen, please, FreeThese-Bees! ANGLE ON: Jury, chanting \"Free the bees\". JUDGE The court finds in favor of the bees. The chaos continues. Barry flies over to Vanessa, with his hand up for a “high 5”. BARRY Vanessa, we won! VANESSA Yay! I knew you could do it. Highfive! She high 5’s Barry, sending him crashing to the table. He bounces right back up. VANESSA (CONT'D) Oh, sorry. BARRY Ow!! I’m okay. Vanessa, do you know what this means? All the honey is finally going to belong to the bees. Now we won’t have to work so hard all the time. Montgomery approaches Barry, surrounded by the press. The cameras and microphones go to Montgomery. MONTGOMERY (waving a finger) This is an unholy perversion of the balance of nature, Benson! You’ll regret this. ANGLE ON: Barry’s ‘deer in headlights’ expression, as the press pushes microphones in his face. \"Bee Movie\" - JS REVISIONS 8/13/07 94. PRESS PERSON 1 Barry, how much honey do you think is out there? BARRY Alright, alright, one at a time... SARAH Barry, who are you wearing? BARRY Uhhh, my sweater is Ralph Lauren, and I have no pants. The Press follows Barry as he EXITS. ANGLE ON: Adam and Vanessa. ADAM (putting papers away) What if Montgomery’s right? VANESSA What do you mean? ADAM We’ve been living the bee way a long time. 27 million years. DISSOLVE TO: SEQ. 3600 - “HONEY ROUNDUP” EXT. HONEY FARMS APIARY - MONTAGE SARAH (V.O) Congratulations on your victory. What are you going to demand as a settlement? BARRY (V.O) (over montage) First, we’re going to demand a complete shutdown of all bee work camps. Then, we want to get back all the honey that was ours to begin with. Every last drop. We demand an end to the glorification of the bear as anything more than a filthy, smelly, big-headed, bad breath, stink-machine. \"Bee Movie\" - JS REVISIONS 8/13/07 95. I believe we’re all aware of what they do in the woods. We will no longer tolerate derogatory beenegative nick-names, unnecessary inclusion of honey in bogus health products, and la-dee-da tea-time human snack garnishments. MONTAGE IMAGES: Close-up on an ATF JACKET, with the YELLOW LETTERS. Camera pulls back. We see an ARMY OF BEE AND HUMAN AGENTS wearing hastily made “Alcohol, Tobacco, Firearms, and Honey” jackets. Barry supervises. The gate to Honey Farms is locked permanently. All the smokers are collected and locked up. All the bees leave the Apiary. CUT TO: EXT. ATF OUTSIDE OF SUPERMARKET - MONTAGE Agents begin YANKING honey off the supermarket shelves, and out of shopping baskets. CUT TO: EXT. NEW HIVE CITY - MONTAGE The bees tear down a honey-bear statue. CUT TO: EXT. YELLOWSTONE FOREST - MONTAGE POV of a sniper’s crosshairs. An animated BEAR character looka-like, turns his head towards camera. BARRY Wait for my signal. ANGLE ON: Barry lowering his binoculars. BARRY (CONT'D) Take him out. The sniper SHOOTS the bear. It hits him in the shoulder. The bear looks at it. He gets woozy and the honey jar falls out of his lap, an ATF&H agent catches it. \"Bee Movie\" - JS REVISIONS 8/13/07 96. BARRY (V.O) (CONT'D) ATF&H AGENT (to the bear’s pig friend) He’ll have a little nausea for a few hours, then he’ll be fine. CUT TO: EXT. STING’S HOUSE - MONTAGE ATF&H agents SLAP CUFFS on Sting, who is meditating. STING But it’s just a prance-about stage name! CUT TO: INT. A WOMAN’S SHOWER - MONTAGE A WOMAN is taking a shower, and using honey shampoo. An ATF&H agent pulls the shower curtain aside, and grabs her bottle of shampoo. The woman SCREAMS. The agent turns to the 3 other agents, and Barry. ANGLE ON: Barry looking at the label on the shampoo bottle, shaking his head and writing in his clipboard. CUT TO: EXT. SUPERMARKET CAFE - MONTAGE Another customer, an old lady having her tea with a little jar of honey, gets her face pushed down onto the table and turned to the side by two agents. One of the agents has a gun on her. OLD LADY Can’t breathe. CUT TO: EXT. CENTRAL PARK - MONTAGE An OIL DRUM of honey is connected to Barry’s hive. \"Bee Movie\" - JS REVISIONS 8/13/07 97. BARRY Bring it in, boys. CUT TO: SEQ. 3650 - “NO MORE WORK” INT. HONEX - MONTAGE ANGLE ON: The honey goes past the 3-cup hash-mark, and begins to overflow. A WORKER BEE runs up to Buzzwell. WORKER BEE 1 Mr. Buzzwell, we just passed 3 cups, and there’s gallons mores coming. I think we need to shutdown. KEYCHAIN BEE (to Buzzwell) Shutdown? We’ve never shutdown. ANGLE ON: Buzzwell overlooking the factory floor. BUZZWELL Shutdown honey production! Stop making honey! ANGLE ON: TWO BEES, each with a KEY. BUZZWELL (CONT’D) Turn your key, Sir! They turn the keys simultaneously, War Games-style, shutting down the honey machines. ANGLE ON: the Taffy-Pull machine, Centrifuge, and Krelman all slowly come to a stop. The bees look around, bewildered. WORKER BEE 5 What do we do now? A BEAT. WORKER BEE 6 Cannon ball!! He jumps into a HONEY VAT, doesn’t penetrate the surface. He looks around, and slowly sinks down to his waist. \"Bee Movie\" - JS REVISIONS 8/13/07 98. EXT. HONEX FACTORY THE WHISTLE BLOWS, and the bees all stream out the exit. CUT TO: INT. J-GATE - CONTINUOUS Lou Loduca gives orders to the pollen jocks. LOU LODUCA We’re shutting down honey production. Mission abort. CUT TO: EXT. CENTRAL PARK Jackson receives the orders, mid-pollination. JACKSON Aborting pollination and nectar detail. Returning to base. CUT TO: EXT. NEW HIVE CITY ANGLE ON: Bees, putting sun-tan lotion on their noses and antennae, and sunning themselves on the balconies of the gyms. CUT TO: EXT. CENTRAL PARK ANGLE ON: THE FLOWERS starting to DROOP. CUT TO: INT. J-GATE J-Gate is deserted. CUT TO: \"Bee Movie\" - JS REVISIONS 8/13/07 99. EXT. NEW HIVE CITY ANGLE ON: Bees sunning themselves. A TIMER DINGS, and they all turn over. CUT TO: EXT. CENTRAL PARK TIME LAPSE of Central Park turning brown. CUT TO: EXT. VANESSA’S FLORIST SHOP CLOSE-UP SHOT: Vanessa writes “Sorry. No more flowers.” on a “Closed” sign, an turns it facing out. CUT TO: SEQ. 3700 - “IDLE HIVE” EXT. NEW HIVE CITY - DAY Barry flies at high speed. TRACKING SHOT into the hive, through the lobby of Honex, and into Adam’s office. CUT TO: INT. ADAM’S OFFICE - CONTINUOUS Barry meets Adam in his office. Adam’s office is in disarray. There are papers everywhere. He’s filling up his cardboard hexagon box. BARRY (out of breath) Adam, you wouldn’t believe how much honey was out there. ADAM Oh yeah? BARRY What’s going on around here? Where is everybody? Are they out celebrating? \"Bee Movie\" - JS REVISIONS 8/13/07 100. ADAM (exiting with a cardboard box of belongings) No, they’re just home. They don’t know what to do. BARRY Hmmm. ADAM They’re laying out, they’re sleeping in. I heard your Uncle Carl was on his way to San Antonio with a cricket. BARRY At least we got our honey back. They walk through the empty factory. ADAM Yeah, but sometimes I think, so what if the humans liked our honey? Who wouldn’t? It’s the greatest thing in the world. I was excited to be a part of making it. ANGLE ON: Adam’s desk on it’s side in the hall. ADAM (CONT’D) This was my new desk. This was my new job. I wanted to do it really well. And now...and now I can’t. Adam EXITS. CUT TO: SEQ. 3900 - “WORLD WITHOUT BEES” INT. STAIRWELL Vanessa and Barry are walking up the stairs to the roof. BARRY I don’t understand why they’re not happy. We have so much now. I thought their lives would be better. \"Bee Movie\" - JS REVISIONS 8/13/07 101. VANESSA Hmmm. BARRY They’re doing nothing. It’s amazing, honey really changes people. VANESSA You don’t have any idea what’s going on, do you? BARRY What did you want to show me? VANESSA This. They reach the top of the stairs. Vanessa opens the door. CUT TO: EXT. VANESSA’S ROOFTOP - CONTINUOUS Barry sees Vanessa’s flower pots and small garden have all turned brown. BARRY What happened here? VANESSA That is not the half of it... Vanessa turns Barry around with her two fingers, revealing the view of Central Park, which is also all brown. BARRY Oh no. Oh my. They’re all wilting. VANESSA Doesn’t look very good, does it? BARRY No. VANESSA And who’s fault do you think that is? \"Bee Movie\" - JS REVISIONS 8/13/07 102. BARRY Mmmm...you know, I’m going to guess, bees. VANESSA Bees? BARRY Specifically me. I guess I didn’t think that bees not needing to make honey would affect all these other things. VANESSA And it’s not just flowers. Fruits, vegetables...they all need bees. BARRY Well, that’s our whole SAT test right there. VANESSA So, you take away the produce, that affects the entire animal kingdom. And then, of course... BARRY The human species? VANESSA (clearing throat) Ahem! BARRY Oh. So, if there’s no more pollination, it could all just go south here, couldn’t it? VANESSA And I know this is also partly my fault. Barry takes a long SIGH. BARRY How about a suicide pact? VANESSA (not sure if he’s joking) How would we do it? BARRY I’ll sting you, you step on me. \"Bee Movie\" - JS REVISIONS 8/13/07 103. VANESSA That just kills you twice. BARRY Right, right. VANESSA Listen Barry. Sorry but I’ve got to get going. She EXITS. BARRY (looking out over the park) Had to open my mouth and talk... (looking back) Vanessa..? Vanessa is gone. CUT TO: SEQ. 3935 - “GOING TO PASADENA” EXT. NY STREET - CONTINUOUS Vanessa gets into a cab. Barry ENTERS. BARRY Vanessa. Why are you leaving? Where are you going? VANESSA To the final Tournament of Roses parade in Pasadena. They moved it up to this weekend because all the flowers are dying. It’s the last chance I’ll ever have to see it. BARRY Vanessa, I just want to say I’m sorry. I never meant it to turn out like this. VANESSA I know. Me neither. Vanessa cab drives away. \"Bee Movie\" - JS REVISIONS 8/13/07 104. BARRY (chuckling to himself) Tournament of Roses. Roses can’t do sports. Wait a minute...roses. Roses? Roses!? Vanessa! Barry follows shortly after. He catches up to it, and he pounds on the window. Barry follows shortly after Vanessa’s cab. He catches up to it, and he pounds on the window. INT. TAXI - CONTINUOUS Barry motions for her to roll the window down. She does so. BARRY Roses?! VANESSA Barry? BARRY (as he flies next to the cab) Roses are flowers. VANESSA Yes, they are. BARRY Flowers, bees, pollen! VANESSA I know. That’s why this is the last parade. BARRY Maybe not. The cab starts pulling ahead of Barry. BARRY (CONT'D) (re: driver) Could you ask him to slow down? VANESSA Could you slow down? The cabs slows. Barry flies in the window, and lands in the change box, which closes on him. \"Bee Movie\" - JS REVISIONS 8/13/07 105. VANESSA (CONT'D) Barry! Vanessa lets him out. Barry stands on the change box, in front of the driver’s license. BARRY Okay, I made a huge mistake! This is a total disaster, and it’s all my fault! VANESSA Yes, it kind of is. BARRY I’ve ruined the planet. And, I wanted to help with your flower shop. Instead, I’ve made it worse. VANESSA Actually, it’s completely closed down. BARRY Oh, I thought maybe you were remodeling. Nonetheless, I have another idea. And it’s greater than all my previous great ideas combined. VANESSA I don’t want to hear it. Vanessa closes the change box on Barry. BARRY (opening it again) Alright, here’s what I’m thinking. They have the roses, the roses have the pollen. I know every bee, plant, and flower bud in this park. All we’ve got to do is get what they’ve got back here with what we’ve got. VANESSA Bees... BARRY Park... VANESSA Pollen... \"Bee Movie\" - JS REVISIONS 8/13/07 106. BARRY Flowers... VANESSA Repollination! BARRY (on luggage handle, going up) Across the nation! CUT TO: SEQ. 3950 - “ROSE PARADE” EXT. PASADENA PARADE BARRY (V.O) Alright. Tournament of Roses. Pasadena, California. They’ve got nothing but flowers, floats, and cotton candy. Security will be tight. VANESSA I have an idea. CUT TO: EXT. FLOAT STAGING AREA ANGLE ON: Barry and Vanessa approaching a HEAVILY ARMED GUARD in front of the staging area. VANESSA Vanessa Bloome, FTD. Official floral business. He leans in to look at her badge. She SNAPS IT SHUT, VANESSA (CONT’D) Oh, it’s real. HEAVILY ARMED GUARD Sorry ma’am. That’s a nice brooch, by the way. VANESSA Thank you. It was a gift. \"Bee Movie\" - JS REVISIONS 8/13/07 107. They ENTER the staging area. BARRY (V.O) Then, once we’re inside, we just pick the right float. VANESSA How about the Princess and the Pea? BARRY Yeah. VANESSA I can be the princess, and-- BARRY ...yes, I think-- VANESSA You could be-- BARRY I’ve-- VANESSA The pea. BARRY Got it. CUT TO: EXT. FLOAT STAGING AREA - A FEW MOMENTS LATER Barry, dressed as a PEA, flies up and hovers in front of the princess on the “Princess and the Pea” float. The float is sponsored by Inflat-a-bed and a SIGN READS: “Inflat-a-bed: If it blows, it’s ours.” BARRY Sorry I’m late. Where should I sit? PRINCESS What are you? BARRY I believe I’m the pea. PRINCESS The pea? It’s supposed to be under the mattresses. \"Bee Movie\" - JS REVISIONS 8/13/07 108. BARRY Not in this fairy tale, sweetheart. PRINCESS I’m going to go talk to the marshall. BARRY You do that. This whole parade is a fiasco! She EXITS. Vanessa removes the step-ladder. The princess FALLS. Barry and Vanessa take off in the float. BARRY (CONT’D) Let’s see what this baby will do. ANGLE ON: Guy with headset talking to drivers. HEADSET GUY Hey! The float ZOOMS by. A young CHILD in the stands, TIMMY, cries. CUT TO: EXT. FLOAT STAGING AREA - A FEW MOMENTS LATER ANGLE ON: Vanessa putting the princess hat on. BARRY (V.O) Then all we do is blend in with traffic, without arousing suspicion. CUT TO: EXT. THE PARADE ROUTE - CONTINUOUS The floats go flying by the crowds. Barry and Vanessa’s float CRASHES through the fence. CUT TO: \"Bee Movie\" - JS REVISIONS 8/13/07 109. EXT. LA FREEWAY Vanessa and Barry speed, dodging and weaving, down the freeway. BARRY (V.O) And once we’re at the airport, there’s no stopping us. CUT TO: EXT. LAX AIRPORT Barry and Vanessa pull up to the curb, in front of an TSA AGENT WITH CLIPBOARD. TSA AGENT Stop. Security. Did you and your insect pack your own float? VANESSA (O.C) Yes. TSA AGENT Has this float been in your possession the entire time? VANESSA (O.C) Since the parade...yes. ANGLE ON: Barry holding his shoes. TSA AGENT Would you remove your shoes and everything in your pockets? Can you remove your stinger, Sir? BARRY That’s part of me. TSA AGENT I know. Just having some fun. Enjoy your flight. CUT TO: EXT. RUNWAY Barry and Vanessa’s airplane TAKES OFF. \"Bee Movie\" - JS REVISIONS 8/13/07 110. BARRY (O.C) Then, if we’re lucky, we’ll have just enough pollen to do the job. DISSOLVE TO: SEQ. 4025 - “COCKPIT FIGHT” INT. AIRPLANE Vanessa is on the aisle. Barry is on a laptop calculating flowers, pollen, number of bees, airspeed, etc. He does a “Stomp” dance on the keyboard. BARRY Can you believe how lucky we are? We have just enough pollen to do the job. I think this is going to work, Vanessa. VANESSA It’s got to work. PILOT (V.O) Attention passengers. This is Captain Scott. I’m afraid we have a bit of bad weather in the New York area. And looks like we’re going to be experiencing a couple of hours delay. VANESSA Barry, these are cut flowers with no water. They’ll never make it. BARRY I’ve got to get up there and talk to these guys. VANESSA Be careful. Barry flies up to the cockpit door. CUT TO: INT. COCKPIT - CONTINUOUS A female flight attendant, ANGELA, is in the cockpit with the pilots. \"Bee Movie\" - JS REVISIONS 8/13/07 111. There’s a KNOCK at the door. BARRY (C.O) Hey, can I get some help with this Sky Mall Magazine? I’d like to order the talking inflatable travel pool filter. ANGELA (to the pilots, irritated) Excuse me. CUT TO: EXT. CABIN - CONTINUOUS Angela opens the cockpit door and looks around. She doesn’t see anybody. ANGLE ON: Barry hidden on the yellow and black “caution” stripe. As Angela looks around, Barry zips into the cockpit. CUT TO: INT. COCKPIT BARRY Excuse me, Captain. I am in a real situation here... PILOT (pulling an earphone back, to the co-pilot) What did you say, Hal? CO-PILOT I didn’t say anything. PILOT (he sees Barry) Ahhh! Bee! BARRY No, no! Don’t freak out! There’s a chance my entire species-- CO-PILOT (taking off his earphones) Ahhh! \"Bee Movie\" - JS REVISIONS 8/13/07 112. The pilot grabs a “DUSTBUSTER” vacuum cleaner. He aims it around trying to vacuum up Barry. The co-pilot faces camera, as the pilot tries to suck Barry up. Barry is on the other side of the co-pilot. As they dosey-do, the toupee of the co-pilot begins to come up, still attached to the front. CO-PILOT (CONT'D) What are you doing? Stop! The toupee comes off the co-pilot’s head, and sticks in the Dustbuster. Barry runs across the bald head. BARRY Wait a minute! I’m an attorney! CO-PILOT Who’s an attorney? PILOT Don’t move. The pilot uses the Dustbuster to try and mash Barry, who is hovering in front of the co-pilot’s nose, and knocks out the co-pilot who falls out of his chair, hitting the life raft release button. The life raft inflates, hitting the pilot, knocking him into a wall and out cold. Barry surveys the situation. BARRY Oh, Barry. CUT TO: INT. AIRPLANE CABIN Vanessa studies her laptop, looking serious. SFX: PA CRACKLE. BARRY (V.O) (in captain voice) Good afternoon passengers, this is your captain speaking. Would a Miss Vanessa Bloome in 24F please report to the cockpit. And please hurry! \"Bee Movie\" - JS REVISIONS 8/13/07 113. ANGLE ON: The aisle, and Vanessa head popping up. CUT TO: INT. COCKPIT Vanessa ENTERS. VANESSA What happened here? BARRY I tried to talk to them, but then there was a Dustbuster, a toupee, a life raft exploded...Now one’s bald, one’s in a boat, and they’re both unconscious. VANESSA Is that another bee joke? BARRY No. No one’s flying the plane. The AIR TRAFFIC CONTROLLER, BUD, speaks over the radio. BUD This is JFK control tower. Flight 356, what’s your status? Vanessa presses a button, and the intercom comes on. VANESSA This is Vanessa Bloome. I’m a florist from New York. BUD Where’s the pilot? VANESSA He’s unconscious and so is the copilot. BUD Not good. Is there anyone onboard who has flight experience? A BEAT. BARRY As a matter of fact, there is. \"Bee Movie\" - JS REVISIONS 8/13/07 114. BUD Who’s that? VANESSA Barry Benson. BUD From the honey trial? Oh great. BARRY Vanessa, this is nothing more than a big metal bee. It’s got giant wings, huge engines. VANESSA I can’t fly a plane. BARRY Why not? Isn’t John Travolta a pilot? VANESSA Yes? BARRY How hard could it be? VANESSA Wait a minute. Barry, we’re headed into some lightning. CUT TO: Vanessa shrugs, and takes the controls. SEQ. 4150 - “BARRY FLIES PLANE” INT. BENSON HOUSE The family is all huddled around the TV at the Benson house. ANGLE ON: TV. Bob Bumble is broadcasting. BOB BUMBLE This is Bob Bumble. We have some late-breaking news from JFK airport, where a very suspenseful scene is developing. Barry Benson, fresh off his stunning legal victory... \"Bee Movie\" - JS REVISIONS 8/13/07 115. Adam SPRAYS a can of HONEY-WHIP into his mouth. ADAM That’s Barry. BOB BUMBLE ...is now attempting to land a plane, loaded with people, flowers, and an incapacitated flight crew. EVERYONE Flowers?! CUT TO: INT. AIR TRAFFIC CONTROL TOWER BUD Well, we have an electrical storm in the area, and two individuals at the controls of a jumbo jet with absolutely no flight experience. JEANETTE CHUNG Just a minute, Mr. Ditchwater, there’s a honey bee on that plane. BUD Oh, I’m quite familiar with Mr. Benson’s work, and his no-account compadres. Haven’t they done enough damage already? JEANETTE CHUNG But isn’t he your only hope right now? BUD Come on, technically a bee shouldn’t be able to fly at all. CUT TO: INT. COCKPIT. Barry REACTS BUD The wings are too small, their bodies are too big-- \"Bee Movie\" - JS REVISIONS 8/13/07 116. BARRY (over PA) Hey, hold on a second. Haven’t we heard this million times? The surface area of the wings, and the body mass doesn’t make sense? JEANETTE CHUNG Get this on the air. CAMERAMAN You got it! CUT TO: INT. BEE TV CONTROL ROOM An engineer throws a switch. BEE ENGINEER Stand by. We’re going live. The “ON AIR” sign illuminates. CUT TO: INT. VARIOUS SHOTS OF NEW HIVE CITY The news report plays on TV. The pollen jocks are sitting around, playing paddle-ball, Wheel-o, and one of them is spinning his helmet on his finger. Buzzwell is in an office cubicle, playing computer solitaire. Barry’s family and Adam watch from their living room. Bees sitting on the street curb turn around to watch the TV. BARRY Mr. Ditchwater, the way we work may be a mystery to you, because making honey takes a lot of bees doing a lot of small jobs. But let me tell you something about a small job. If you do it really well, it makes a big difference. More than we realized. To us, to everyone. That’s why I want to get bees back to doing what we do best. \"Bee Movie\" - JS REVISIONS 8/13/07 117. Working together. That’s the bee way. We’re not made of Jello. We get behind a fellow. Black and yellow. CROWD OF BEES Hello! CUT TO: INT. COCKPIT Barry is giving orders to Vanessa. BARRY Left, right, down, hover. VANESSA Hover? BARRY Forget hover. VANESSA You know what? This isn’t so hard. Vanessa pretends to HONK THE HORN. VANESSA (CONT’D) Beep, beep! Beep, beep! A BOLT OF LIGHTNING HITS the plane. The plane takes a sharp dip. VANESSA (CONT’D) Barry, what happened? BARRY (noticing the control panel) Wait a minute. I think we were on autopilot that whole time. VANESSA That may have been helping me. BARRY And now we’re not! VANESSA (V.O.) (folding her arms) Well, then it turns out I cannot fly a plane. \"Bee Movie\" - JS REVISIONS 8/13/07 118. BARRY (CONT'D) Vanessa struggles with the yoke. CUT TO: EXT. AIRPLANE The airplane goes into a steep dive. CUT TO: SEQ. 4175 - “CRASH LANDING” INT. J-GATE An ALERT SIGN READING: “Hive Alert. We Need:” Then the SIGNAL goes from “Two Bees” “Some Bees” “Every Bee There Is” Lou Loduca gathers the pollen jocks at J-Gate. LOU LODUCA All of you, let’s get behind this fellow. Move it out! The bees follow Lou Loduca, and EXIT J-Gate. CUT TO: INT. AIRPLANE COCKPIT BARRY Our only chance is if I do what I would do, and you copy me with the wings of the plane! VANESSA You don’t have to yell. BARRY I’m not yelling. We happen to be in a lot of trouble here. VANESSA It’s very hard to concentrate with that panicky tone in your voice. BARRY It’s not a tone. I’m panicking! CUT TO: \"Bee Movie\" - JS REVISIONS 8/13/07 119. EXT. JFK AIRPORT ANGLE ON: The bees arriving and massing at the airport. CUT TO: INT. COCKPIT Barry and Vanessa alternately SLAP EACH OTHER IN THE FACE. VANESSA I don’t think I can do this. BARRY Vanessa, pull yourself together. Listen to me, you have got to snap out of it! VANESSA You snap out of it! BARRY You snap out of it! VANESSA You snap out of it! BARRY You snap out of it! VANESSA You snap out of it! CUT TO: EXT. AIRPLANE A GIGANTIC SWARM OF BEES flies in to hold the plane up. CUT TO: INT. COCKPIT - CONTINUOUS BARRY You snap out of it! VANESSA You snap out of it! \"Bee Movie\" - JS REVISIONS 8/13/07 120. BARRY You snap-- VANESSA Hold it! BARRY (about to slap her again) Why? Come on, it’s my turn. VANESSA How is the plane flying? Barry’s antennae ring. BARRY I don’t know. (answering) Hello? CUT TO: EXT. AIRPLANE ANGLE ON: The underside of the plane. The pollen jocks have massed all around the underbelly of the plane, and are holding it up. LOU LODUCA Hey Benson, have you got any flowers for a happy occasion in there? CUT TO: INT. COCKPIT Lou, Buzz, Splitz, and Jackson come up alongside the cockpit. BARRY The pollen jocks! VANESSA They do get behind a fellow. BARRY Black and yellow. LOU LODUCA (over headset) Hello. \"Bee Movie\" - JS REVISIONS 8/13/07 121. Alright you two, what do you say we drop this tin can on the blacktop? VANESSA What blacktop? Where? I can’t see anything. Can you? BARRY No, nothing. It’s all cloudy. CUT TO: EXT. RUNWAY Adam SHOUTS. ADAM Come on, you’ve got to think bee, Barry. Thinking bee, thinking bee. ANGLE ON: Overhead shot of runway. The bees are in the formation of a flower. In unison they move, causing the flower to FLASH YELLOW AND BLACK. BEES (chanting) Thinking bee, thinking bee. CUT TO: INT. COCKPIT We see through the swirling mist and clouds. A GIANT SHAPE OF A FLOWER is forming in the middle of the runway. BARRY Wait a minute. I think I’m feeling something. VANESSA What? BARRY I don’t know, but it’s strong. And it’s pulling me, like a 27 million year old instinct. Bring the nose of the plane down. \"Bee Movie\" - JS REVISIONS 8/13/07 122. LOU LODUCA (CONT'D) EXT. RUNWAY All the bees are on the runway chanting “Thinking Bee”. CUT TO: INT. CONTROL TOWER RICK What in the world is on the tarmac? ANGLE ON: Dave OTS onto runway seeing a flower being formed by millions of bees. BUD Get some lights on that! CUT TO: EXT. RUNWAY ANGLE ON: AIRCRAFT LANDING LIGHT SCAFFOLD by the side of the runway, illuminating the bees in their flower formation. INT. COCKPIT BARRY Vanessa, aim for the flower! VANESSA Oh, okay? BARRY Cut the engines! VANESSA Cut the engines? BARRY We’re going in on bee power. Ready boys? LOU LODUCA Affirmative. CUT TO: \"Bee Movie\" - JS REVISIONS 8/13/07 123. INT. AIRPLANE COCKPIT BARRY Good, good, easy now. Land on that flower! Ready boys? Give me full reverse. LOU LODUCA Spin it around! The plane attempts to land on top of an “Aloha Airlines” plane with flowers painted on it. BARRY (V.O) I mean the giant black and yellow pulsating flower made of millions of bees! VANESSA Which flower? BARRY That flower! VANESSA I’m aiming at the flower! The plane goes after a FAT GUY IN A HAWAIIAN SHIRT. BARRY (V.O) That’s a fat guy in a flowered shirt! The other other flower! The big one. He snaps a photo and runs away. BARRY (CONT'D) Full forward. Ready boys? Nose down. Bring your tail up. Rotate around it. VANESSA Oh, this is insane, Barry. BARRY This is the only way I know how to fly. CUT TO: \"Bee Movie\" - JS REVISIONS 8/13/07 124. AIR TRAFFIC CONTROL TOWER BUD Am I koo-koo kachoo, or is this plane flying in an insect-like pattern? CUT TO: EXT. RUNWAY BARRY (V.O) Get your nose in there. Don’t be afraid of it. Smell it. Full reverse! Easy, just drop it. Be a part of it. Aim for the center! Now drop it in. Drop it in, woman! The plane HOVERS and MANEUVERS, landing in the center of the giant flower, like a bee. The FLOWERS from the cargo hold spill out onto the runway. INT. AIPLANE CABIN The passengers are motionless for a beat. PASSENGER Come on already! They hear the “ding ding”, and all jump up to grab their luggage out of the overheads. SEQ. 4225 - “RUNWAY SPEECH” EXT. RUNWAY - CONTINUOUS The INFLATABLE SLIDES pop out the side of the plane. The passengers escape. Barry and Vanessa slide down out of the cockpit. Barry and Vanessa exhale a huge breath. VANESSA Barry, we did it. You taught me how to fly. Vanessa raises her hand up for a high five. \"Bee Movie\" - JS REVISIONS 8/13/07 125. BARRY Yes. No high five. VANESSA Right. ADAM Barry, it worked. Did you see the giant flower? BARRY What giant flower? Where? Of course I saw the flower! That was genius, man. Genius! ADAM Thank you. BARRY But we’re not done yet. Barry flies up to the wing of the plane, and addresses the bee crowd. BARRY (CONT’D) Listen everyone. This runway is covered with the last pollen from the last flowers available anywhere on Earth. That means this is our last chance. We’re the only ones who make honey, pollinate flowers, and dress like this. If we’re going to survive as a species, this is our moment. So what do you all say? Are we going to be bees, or just Museum of Natural History key chains? BEES We’re bees! KEYCHAIN BEE Keychain! BARRY Then follow me... Except Keychain. BUZZ Hold on Barry. You’ve earned this. Buzz puts a pollen jock jacket and helmet with Barry’s name on it on Barry. \"Bee Movie\" - JS REVISIONS 8/13/07 126. BARRY I’m a pollen jock! (looking at the jacket. The sleeves are a little long) And it’s a perfect fit. All I’ve got to do are the sleeves. The Pollen Jocks toss Barry a gun. BARRY (CONT’D) Oh yeah! ANGLE ON: Martin and Janet Benson. JANET BENSON That’s our Barry. All the bees descend upon the flowers on the tarmac, and start collecting pollen. CUT TO: SEQ. 4250 - “RE-POLLINATION” EXT. SKIES - CONTINUOUS The squadron FLIES over the city, REPOLLINATING trees and flowers as they go. Barry breaks off from the group, towards Vanessa’s flower shop. CUT TO: EXT. VANESSA’S FLOWER SHOP - CONTINUOUS Barry REPOLLINATES Vanessa’s flowers. CUT TO: EXT. CENTRAL PARK - CONTINUOUS ANGLE ON: Timmy with a frisbee, as the bees fly by. TIMMY Mom, the bees are back! \"Bee Movie\" - JS REVISIONS 8/13/07 127. Central Park is completely repollinated by the bees. DISSOLVE TO: INT. HONEX - CONTINUOUS Honex is back to normal and everyone is busily working. ANGLE ON: Adam, putting his Krelman hat on. ADAM If anyone needs to make a call, now’s the time. I’ve got a feeling we’ll be working late tonight! The bees CHEER. CUT TO: SEQ. 4355 EXT: VANESSA’S FLOWER SHOP With a new sign out front. “Vanessa & Barry: Flowers, Honey, Legal Advice” DISSOLVE TO: INT: FLOWER COUNTER Vanessa doing a brisk trade with many customers. CUT TO: INT: FLOWER SHOP - CONTINUOUS Vanessa is selling flowers. In the background, there are SHELVES STOCKED WITH HONEY. VANESSA (O.C.) Don’t forget these. Have a great afternoon. Yes, can I help who’s next? Who’s next? Would you like some honey with that? It is beeapproved. SIGN ON THE BACK ROOM DOOR READS: “Barry Benson: Insects at Law”. \"Bee Movie\" - JS REVISIONS 8/13/07 128. Camera moves into the back room. ANGLE ON: Barry. ANGLE ON: Barry’s COW CLIENT. COW Milk, cream, cheese...it’s all me. And I don’t see a nickel. BARRY Uh huh? Uh huh? COW (breaking down) Sometimes I just feel like a piece of meat. BARRY I had no idea. VANESSA Barry? I’m sorry, have you got a moment? BARRY Would you excuse me? My mosquito associate here will be able to help you. Mooseblood ENTERS. MOOSEBLOOD Sorry I’m late. COW He’s a lawyer too? MOOSEBLOOD Ma’am, I was already a bloodsucking parasite. All I needed was * a briefcase. * ANGLE ON: Flower Counter. VANESSA (to customer) Have a great afternoon! (to Barry) Barry, I just got this huge tulip order for a wedding, and I can’t get them anywhere. \"Bee Movie\" - JS REVISIONS 8/13/07 129. BARRY Not a problem, Vannie. Just leave it to me. Vanessa turns back to deal with a customer. VANESSA You’re a life-saver, Barry. (to the next customer) Can I help who’s next? Who’s next? ANGLE ON: Vanessa smiling back at Barry. Barry smiles too, then snaps himself out of it. BARRY (speaks into his antennae) Alright. Scramble jocks, it’s time to fly! VANESSA Thank you, Barry! EXT. FLOWER SHOP - CONTINUOUS ANGLE ON: Ken and Andy walking down the street. KEN (noticing the new sign) Augh! What in the world? It’s that bee again! ANDY (guiding Ken protectively) Let it go, Kenny. KEN That bee is living my life! When will this nightmare end? ANDY Let it all go. They don’t break stride. ANGLE ON: Camera in front of Barry as he flies out the door and up into the sky. Pollen jocks fold in formation behind him as they zoom into the park. BARRY (to Splitz) Beautiful day to fly. \"Bee Movie\" - JS REVISIONS 8/13/07 130. JACKSON Sure is. BARRY Between you and me, I was dying to get out of that office. FADE OUT: \"Bee Movie\" - JS REVISIONS 8/13/07 131.",
      "url": "https://github.com/danderfer/Comp_Sci_Sem_2",
      "language": "Python",
      "stars": 145,
      "forks": 28,
      "tags": [],
      "created_at": "2025-08-11T09:48:23.154000",
      "updated_at": "2025-08-27T09:38:57.550000",
      "trend_date": "2025-08-14T17:32:44.558000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.558000"
    },
    {
      "id": 1649,
      "name": "block-chain-demo",
      "full_name": "simonsjy/block-chain-demo",
      "owner": "simonsjy",
      "description": "以比特币白皮书为依据，简化模型，使用java实现的区块链系统。",
      "url": "https://github.com/simonsjy/block-chain-demo",
      "language": "Java",
      "stars": 128,
      "forks": 46,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.575000",
      "updated_at": "2025-08-27T09:38:57.575000",
      "trend_date": "2025-08-27T09:38:57.575000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.576000"
    },
    {
      "id": 1677,
      "name": "blockchainbean2",
      "full_name": "IBM/blockchainbean2",
      "owner": "IBM",
      "description": "This code pattern shows how to model a supply-chain network using the IBM Blockchain Platform and is based on a collaboration with Brooklyn Roasting Company. The story, along with the supply-chain documents that were used to model this network, can be found at: https://www.ibm.com/blockchainbean. Note that the 'view the blockchain' button is being migrated''",
      "url": "https://github.com/IBM/blockchainbean2",
      "language": "TypeScript",
      "stars": 126,
      "forks": 82,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.588000",
      "updated_at": "2025-08-27T09:38:57.588000",
      "trend_date": "2025-08-27T09:38:57.588000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.588000"
    },
    {
      "id": 1622,
      "name": "crypto_identifier",
      "full_name": "Acceis/crypto_identifier",
      "owner": "Acceis",
      "description": "Crypto tool for pentest and ctf : try to uncipher data using multiple algorithms and block chaining modes. Usefull for a quick check on unknown cipher text and key dictionnary",
      "url": "https://github.com/Acceis/crypto_identifier",
      "language": "Python",
      "stars": 123,
      "forks": 24,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.558000",
      "updated_at": "2025-08-27T09:38:57.558000",
      "trend_date": "2025-08-27T09:38:57.558000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.558000"
    },
    {
      "id": 1710,
      "name": "TAC",
      "full_name": "TraceabilityChain/TAC",
      "owner": "TraceabilityChain",
      "description": "We hope to, basing on the technology of block chain, adopting unique non-tamper distributed ledger characteristics of the block chain, build the traceability cloud platform, solve the enterprise's difficulties in information traceability",
      "url": "https://github.com/TraceabilityChain/TAC",
      "language": "Go",
      "stars": 121,
      "forks": 22,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.602000",
      "updated_at": "2025-08-27T09:38:57.602000",
      "trend_date": "2025-08-27T09:38:57.602000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.602000"
    },
    {
      "id": 1672,
      "name": "chain",
      "full_name": "mimorisuzuko/chain",
      "owner": "mimorisuzuko",
      "description": "A New Visual Programming Environment to Build JavaScript By Linking Blocks",
      "url": "https://github.com/mimorisuzuko/chain",
      "language": "JavaScript",
      "stars": 114,
      "forks": 4,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.586000",
      "updated_at": "2025-08-27T09:38:57.586000",
      "trend_date": "2025-08-27T09:38:57.586000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.586000"
    },
    {
      "id": 1698,
      "name": "OAK-blockchain",
      "full_name": "AvaProtocol/OAK-blockchain",
      "owner": "AvaProtocol",
      "description": "OAK(Onchain Autonomous Framework) is a unique blockchain built on Substrate framework with event-driven smart contract VM, autonomous transactions, and on-chain scheduler.",
      "url": "https://github.com/AvaProtocol/OAK-blockchain",
      "language": "Rust",
      "stars": 112,
      "forks": 72,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.597000",
      "updated_at": "2025-08-27T09:38:57.597000",
      "trend_date": "2025-08-27T09:38:57.597000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.597000"
    },
    {
      "id": 1711,
      "name": "btcplex",
      "full_name": "tsileo/btcplex",
      "owner": "tsileo",
      "description": "BTCplex is an open source Bitcoin block chain browser written in Go, it allows you to search and navigate the block chain.",
      "url": "https://github.com/tsileo/btcplex",
      "language": "Go",
      "stars": 104,
      "forks": 19,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.603000",
      "updated_at": "2025-08-27T09:38:57.603000",
      "trend_date": "2025-08-27T09:38:57.603000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.603000"
    },
    {
      "id": 1673,
      "name": "Supply-Chain-Blockchain",
      "full_name": "faizack/Supply-Chain-Blockchain",
      "owner": "faizack",
      "description": "Supply Chain Management Using Blockchain",
      "url": "https://github.com/faizack/Supply-Chain-Blockchain",
      "language": "JavaScript",
      "stars": 99,
      "forks": 26,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.587000",
      "updated_at": "2025-08-27T09:38:57.587000",
      "trend_date": "2025-08-27T09:38:57.587000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.587000"
    },
    {
      "id": 1712,
      "name": "dotcoin",
      "full_name": "michain/dotcoin",
      "owner": "michain",
      "description": "A simple and integrity blockchain implementation in Golang",
      "url": "https://github.com/michain/dotcoin",
      "language": "Go",
      "stars": 93,
      "forks": 20,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.603000",
      "updated_at": "2025-08-27T09:38:57.603000",
      "trend_date": "2025-08-27T09:38:57.603000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.603000"
    },
    {
      "id": 1674,
      "name": "Blockchain_SupplyChain",
      "full_name": "kamalkishorm/Blockchain_SupplyChain",
      "owner": "kamalkishorm",
      "description": "Pharmaceutical SupplyChain using Ethereum Blockchain Network.",
      "url": "https://github.com/kamalkishorm/Blockchain_SupplyChain",
      "language": "JavaScript",
      "stars": 90,
      "forks": 49,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.587000",
      "updated_at": "2025-08-27T09:38:57.587000",
      "trend_date": "2025-08-27T09:38:57.587000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.587000"
    },
    {
      "id": 1678,
      "name": "client",
      "full_name": "polkadot-js/client",
      "owner": "polkadot-js",
      "description": "An alternative Polkadot Runtime Environment implementation acting as a full-node (excluding block production for validators) for syncing with Substrate-based chains. ",
      "url": "https://github.com/polkadot-js/client",
      "language": "TypeScript",
      "stars": 84,
      "forks": 12,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.588000",
      "updated_at": "2025-08-27T09:38:57.588000",
      "trend_date": "2025-08-27T09:38:57.588000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.589000"
    },
    {
      "id": 1675,
      "name": "node-artblocks",
      "full_name": "ArtBlocks/node-artblocks",
      "owner": "ArtBlocks",
      "description": "Node package for reading on-chain Art Blocks data",
      "url": "https://github.com/ArtBlocks/node-artblocks",
      "language": "JavaScript",
      "stars": 83,
      "forks": 14,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.587000",
      "updated_at": "2025-08-27T09:38:57.587000",
      "trend_date": "2025-08-27T09:38:57.587000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.587000"
    },
    {
      "id": 1623,
      "name": "chaingreen-blockchain",
      "full_name": "ChainGreenOrg/chaingreen-blockchain",
      "owner": "ChainGreenOrg",
      "description": "",
      "url": "https://github.com/ChainGreenOrg/chaingreen-blockchain",
      "language": "Python",
      "stars": 81,
      "forks": 31,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.559000",
      "updated_at": "2025-08-27T09:38:57.559000",
      "trend_date": "2025-08-27T09:38:57.559000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.559000"
    },
    {
      "id": 1624,
      "name": "Blockchain-FinalProject-SupplyChainFinancialPlatform",
      "full_name": "MIllionBenjamin/Blockchain-FinalProject-SupplyChainFinancialPlatform",
      "owner": "MIllionBenjamin",
      "description": "基于区块链的供应链金融平台",
      "url": "https://github.com/MIllionBenjamin/Blockchain-FinalProject-SupplyChainFinancialPlatform",
      "language": "Python",
      "stars": 74,
      "forks": 27,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.560000",
      "updated_at": "2025-08-27T09:38:57.560000",
      "trend_date": "2025-08-27T09:38:57.560000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.560000"
    },
    {
      "id": 1713,
      "name": "block-sdk",
      "full_name": "skip-mev/block-sdk",
      "owner": "skip-mev",
      "description": "🎨 Programmable Block Builder for Cosmos Chains",
      "url": "https://github.com/skip-mev/block-sdk",
      "language": "Go",
      "stars": 69,
      "forks": 23,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.603000",
      "updated_at": "2025-08-27T09:38:57.603000",
      "trend_date": "2025-08-27T09:38:57.603000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.604000"
    },
    {
      "id": 1676,
      "name": "blockchainbean",
      "full_name": "IBM/blockchainbean",
      "owner": "IBM",
      "description": "# WARNING: This repository is no longer maintained :warning: This pattern focuses on older technology (e.g. Hyperledger Fabric APIs prior to Fabric 1.4). Therefore, there is no support for this pattern and it will be archived on May 1, 2019. You are welcome to use up to that date, but we recommend that you begin working with the updated release found at https://developer.ibm.com/patterns/coffee-supply-chain-network-hyperledger-fabric-blockchain-2/.",
      "url": "https://github.com/IBM/blockchainbean",
      "language": "JavaScript",
      "stars": 68,
      "forks": 44,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.588000",
      "updated_at": "2025-08-27T09:38:57.588000",
      "trend_date": "2025-08-27T09:38:57.588000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.588000"
    },
    {
      "id": 1714,
      "name": "fantom-api-graphql",
      "full_name": "Fantom-foundation/fantom-api-graphql",
      "owner": "Fantom-foundation",
      "description": "Fast and secure GraphQL API for aggregated Opera block chain information.",
      "url": "https://github.com/Fantom-foundation/fantom-api-graphql",
      "language": "Go",
      "stars": 64,
      "forks": 42,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.604000",
      "updated_at": "2025-08-27T09:38:57.604000",
      "trend_date": "2025-08-27T09:38:57.604000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.604000"
    },
    {
      "id": 869,
      "name": "JavaCode",
      "full_name": "rick2785/JavaCode",
      "owner": "rick2785",
      "description": "I specifically cover the following topics: Java primitive data types, declaration statements, expression statements, importing class libraries, excepting user input, checking for valid input, catching errors in input, math functions, if statement, relational operators, logical operators, ternary operator, switch statement, and looping.   How class variables differ from local variables, Java Exception handling, the difference between run time and checked exceptions, Arrays, and UML Diagrams.  Monsters gameboard, Java collection classes, Java ArrayLists, Linked Lists, manipulating Strings and StringBuilders, Polymorphism, Inheritance, Protected, Final, Instanceof, interfaces, abstract classes, abstract methods.  You need interfaces and abstract classes because Java doesn't allow you to inherit from more than one other class.  Java threads, Regular Expressions, Graphical User Interfaces (GUI) using Java Swing and its components, GUI Event Handling, ChangeListener, JOptionPane, combo boxes, list boxes, JLists, DefaultListModel, using JScrollpane with JList, JSpinner, JTree, Flow, Border, and Box Layout Managers.  Created a calculator layout with Java Swing's GridLayout, GridBagLayout, GridBagConstraints, Font, and Insets.  JLabel, JTextField, JComboBox, JSpinner, JSlider, JRadioButton, ButtonGroup, JCheckBox, JTextArea, JScrollPane, ChangeListener, pack, create and delete files and directories. How to pull lists of files from directories and manipulate them, write to and read character streams from files. PrintWriter, BufferedWriter, FileWriter, BufferedReader, FileReader, common file exceptions  Binary Streams - DataOutputStream, FileOutputStream, BufferedOutputStream, all of the reading and writing primitive type methods, setup Java JDBC in Eclipse, connect to a MySQL database, query it and get the results of a query.  JTables, JEditorPane Swing component. HyperlinkEvent and HyperlinkListener.  Java JApplet, Java Servlets with Tomcat, GET and POST methods, Java Server Pages, parsing XML with Java, Java XPath, JDOM2 library, and 2D graphics.   *Created a Java Paint Application using swing, events, mouse events, Graphics2D, ArrayList  *Designed a Java Video Game like Asteroids with collision detection and shooting torpedos which also played sound in a JFrame, and removed items from the screen when they were destroyed.  Rotating polygons, and Making Java Executable.  Model View Controller (MVC) The Model is the class that contains the data and the methods needed to use the data. The View is the interface. The Controller coordinates interactions between the Model and View.  DESIGN PATTERNS:  Strategy design patternis used if you need to dynamically change an algorithm used by an object at run time. The pattern also allows you to eliminate code duplication. It separates behavior from super and subclasses.  The Observer pattern is a software design pattern in which an object, called the subject (Publisher), maintains a list of its dependents, called observers (Subscribers), and notifies them automatically of any state changes, usually by calling one of their methods.  The Factory design pattern is used when you want to define the class of an object at runtime. It also allows you to encapsulate object creation so that you can keep all object creation code in one place  The Abstract Factory Design Pattern is like a factory, but everything is encapsulated.  The Singleton pattern is used when you want to eliminate the option of instantiating more than one object. (Scrabble letters app)  The Builder Design Pattern is used when you want to have many classes help in the creation of an object. By having different classes build the object you can then easily create many different types of objects without being forced to rewrite code. The Builder pattern provides a different way to make complex objects like you'd make using the Abstract Factory design pattern.  The Prototype design pattern is used for creating new objects (instances) by cloning (copying) other objects. It allows for the adding of any subclass instance of a known super class at run time. It is used when there are numerous potential classes that you want to only use if needed at runtime. The major benefit of using the Prototype pattern is that it reduces the need for creating potentially unneeded subclasses.  Java Reflection is an API and it's used to manipulate classes and everything in a class including fields, methods, constructors, private data, etc. (TestingReflection.java)  The Decorator allows you to modify an object dynamically. You would use it when you want the capabilities of inheritance with subclasses, but you need to add functionality at run time. It is more flexible than inheritance. The Decorator Design Pattern simplifies code because you add functionality using many simple classes. Also, rather than rewrite old code you can extend it with new code and that is always good. (Pizza app)  The Command design pattern allows you to store a list of commands for later use. With it you can store multiple commands in a class to use over and over. (ElectronicDevice app)  The Adapter pattern is used when you want to translate one interface of a class into another interface. Allows 2 incompatible interfaces to work together. It allows the use of the available interface and the target interface. Any class can work together as long as the Adapter solves the issue that all classes must implement every method defined by the shared interface. (EnemyAttacker app)   The Facade pattern basically says that you should simplify your methods so that much of what is done is in the background. In technical terms you should decouple the client from the sub components needed to perform an operation. (Bank app)  The Bridge Pattern is used to decouple an abstraction from its implementation so that the two can vary independently. Progressively adding functionality while separating out major differences using abstract classes. (EntertainmentDevice app)  In a Template Method pattern, you define a method (algorithm) in an abstract class. It contains both abstract methods and non-abstract methods. The subclasses that extend this abstract class then override those methods that don't make sense for them to use in the default way. (Sandwich app)  The Iterator pattern provides you with a uniform way to access different collections of Objects. You can also write polymorphic code because you can refer to each collection of objects because they'll implement the same interface. (SongIterator app)  The Composite design pattern is used to structure data into its individual parts as well as represent the inner workings of every part of a larger object. The composite pattern also allows you to treat both groups of parts in the same way as you treat the parts polymorphically. You can structure data, or represent the inner working of every part of a whole object individually. (SongComponent app)  The flyweight design pattern is used to dramatically increase the speed of your code when you are using many similar objects. To reduce memory usage the flyweight design pattern shares Objects that are the same rather than creating new ones. (FlyWeightTest app)  State Pattern allows an object to alter its behavior when its internal state changes. The object will appear to change its class. (ATMState)  The Proxy design pattern limits access to just the methods you want made accessible in another class. It can be used for security reasons, because an Object is intensive to create, or is accessed from a remote location. You can think of it as a gate keeper that blocks access to another Object. (TestATMMachine)  The Chain of Responsibility pattern has a group of objects that are expected to between them be able to solve a problem. If the first Object can't solve it, it passes the data to the next Object in the chain. (TestCalcChain)  The Interpreter pattern is used to convert one representation of data into another. The context cantains the information that will be interpreted. The expression is an abstract class that defines all the methods needed to perform the different conversions. The terminal or concrete expressions provide specific conversions on different types of data. (MeasurementConversion)  The Mediator design pattern is used to handle communication between related objects (Colleagues). All communication is handled by a Mediator Object and the Colleagues don't need to know anything about each other to work together. (TestStockMediator)  The Memento design pattern provides a way to store previous states of an Object easily. It has 3 main classes: 1) Memento: The basic object that is stored in different states.  2) Originator: Sets and Gets values from the currently targeted Memento. Creates new Mementos and assigns current values to them.  3) Caretaker: Holds an ArrayList that contains all previous versions of the Memento. It can store and retrieve stored Mementos. (TestMemento)  The Visitor design pattern allows you to add methods to classes of different types without much altering to those classes. You can make completely different methods depending on the class used with this pattern. (VisitorTest)",
      "url": "https://github.com/rick2785/JavaCode",
      "language": "Java",
      "stars": 58,
      "forks": 36,
      "tags": [],
      "created_at": "2025-05-29T16:05:41.254000",
      "updated_at": "2025-08-27T09:38:57.576000",
      "trend_date": "2025-05-29T16:05:41.254000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.576000"
    },
    {
      "id": 1625,
      "name": "Block-Chain",
      "full_name": "annamcabee/Block-Chain",
      "owner": "annamcabee",
      "description": "",
      "url": "https://github.com/annamcabee/Block-Chain",
      "language": "Python",
      "stars": 51,
      "forks": 15,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.561000",
      "updated_at": "2025-08-27T09:38:57.561000",
      "trend_date": "2025-08-27T09:38:57.561000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.561000"
    },
    {
      "id": 1715,
      "name": "insight",
      "full_name": "thirdweb-dev/insight",
      "owner": "thirdweb-dev",
      "description": "Open source indexer to store Events, Transactions and Blocks from any EVM chain",
      "url": "https://github.com/thirdweb-dev/insight",
      "language": "Go",
      "stars": 50,
      "forks": 22,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.604000",
      "updated_at": "2025-08-27T09:38:57.604000",
      "trend_date": "2025-08-27T09:38:57.604000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.604000"
    },
    {
      "id": 1650,
      "name": "BlockChain",
      "full_name": "Anujraval24/BlockChain",
      "owner": "Anujraval24",
      "description": "Simple BlockChain DEMO in JAVA",
      "url": "https://github.com/Anujraval24/BlockChain",
      "language": "Java",
      "stars": 42,
      "forks": 29,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.577000",
      "updated_at": "2025-08-27T09:38:57.577000",
      "trend_date": "2025-08-27T09:38:57.577000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.577000"
    },
    {
      "id": 1626,
      "name": "sender_policy_flattener",
      "full_name": "cetanu/sender_policy_flattener",
      "owner": "cetanu",
      "description": "Compact large SPF chains into flat blocks of IP addresses",
      "url": "https://github.com/cetanu/sender_policy_flattener",
      "language": "Python",
      "stars": 39,
      "forks": 19,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.561000",
      "updated_at": "2025-08-27T09:38:57.561000",
      "trend_date": "2025-08-27T09:38:57.561000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.562000"
    },
    {
      "id": 1651,
      "name": "block-chain-data",
      "full_name": "TianShengBingFeiNiuRen/block-chain-data",
      "owner": "TianShengBingFeiNiuRen",
      "description": "区块链数据分析",
      "url": "https://github.com/TianShengBingFeiNiuRen/block-chain-data",
      "language": "Java",
      "stars": 39,
      "forks": 25,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.577000",
      "updated_at": "2025-08-27T09:38:57.577000",
      "trend_date": "2025-08-27T09:38:57.577000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.577000"
    },
    {
      "id": 1679,
      "name": "blockscout-frontend",
      "full_name": "z1labs/blockscout-frontend",
      "owner": "z1labs",
      "description": "Frontend application for Blockscout blockchain explorer. Blockscout provides a comprehensive, easy-to-use interface for users to view, confirm, and inspect transactions on Cypher chain",
      "url": "https://github.com/z1labs/blockscout-frontend",
      "language": "TypeScript",
      "stars": 37,
      "forks": 2,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.589000",
      "updated_at": "2025-08-27T09:38:57.589000",
      "trend_date": "2025-08-27T09:38:57.589000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.589000"
    },
    {
      "id": 1680,
      "name": "reorgme",
      "full_name": "0xsequence/reorgme",
      "owner": "0xsequence",
      "description": "Ethereum local test chain with block reorg on-demand",
      "url": "https://github.com/0xsequence/reorgme",
      "language": "TypeScript",
      "stars": 34,
      "forks": 4,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.589000",
      "updated_at": "2025-08-27T09:38:57.589000",
      "trend_date": "2025-08-27T09:38:57.589000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.590000"
    },
    {
      "id": 1699,
      "name": "Rust_block_chain",
      "full_name": "tensor-programming/Rust_block_chain",
      "owner": "tensor-programming",
      "description": "",
      "url": "https://github.com/tensor-programming/Rust_block_chain",
      "language": "Rust",
      "stars": 33,
      "forks": 14,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.597000",
      "updated_at": "2025-08-27T09:38:57.597000",
      "trend_date": "2025-08-27T09:38:57.597000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.597000"
    },
    {
      "id": 1700,
      "name": "rust-blockchain-tutorial",
      "full_name": "ddimaria/rust-blockchain-tutorial",
      "owner": "ddimaria",
      "description": "This repo aims to train Rust developers on intermediate and advanced practices to help grok fundamental concepts in Ethereum blockchains.  It includes functioning nodes, WASM contracts and execution runtime, and a Web3 client for interacting with the chain.",
      "url": "https://github.com/ddimaria/rust-blockchain-tutorial",
      "language": "Rust",
      "stars": 31,
      "forks": 4,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.598000",
      "updated_at": "2025-08-27T09:38:57.598000",
      "trend_date": "2025-08-27T09:38:57.598000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.598000"
    },
    {
      "id": 1627,
      "name": "Block-Chain-Example",
      "full_name": "AvinashNath2/Block-Chain-Example",
      "owner": "AvinashNath2",
      "description": "Simple example of blockchain using flask in python.",
      "url": "https://github.com/AvinashNath2/Block-Chain-Example",
      "language": "Python",
      "stars": 30,
      "forks": 12,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.562000",
      "updated_at": "2025-08-27T09:38:57.562000",
      "trend_date": "2025-08-27T09:38:57.562000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.562000"
    },
    {
      "id": 1716,
      "name": "cosmissed",
      "full_name": "blockpane/cosmissed",
      "owner": "blockpane",
      "description": "Simple web service for tracking missed blocks on Tendermint/Cosmos chains",
      "url": "https://github.com/blockpane/cosmissed",
      "language": "Go",
      "stars": 30,
      "forks": 22,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.605000",
      "updated_at": "2025-08-27T09:38:57.605000",
      "trend_date": "2025-08-27T09:38:57.605000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.605000"
    },
    {
      "id": 1681,
      "name": "Krist",
      "full_name": "tmpim/Krist",
      "owner": "tmpim",
      "description": "Krist is a centralized-database economy system for Minecraft servers. Krist does not use a block-chain, or any similar technology. Krist is not a \"cryptocurrency\".",
      "url": "https://github.com/tmpim/Krist",
      "language": "TypeScript",
      "stars": 28,
      "forks": 24,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.590000",
      "updated_at": "2025-08-27T09:38:57.590000",
      "trend_date": "2025-08-27T09:38:57.590000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.590000"
    },
    {
      "id": 1682,
      "name": "MarketPlace-BlockChain",
      "full_name": "Sudhanmanoharan/MarketPlace-BlockChain",
      "owner": "Sudhanmanoharan",
      "description": "Dapp Application by using Angular, Ethereum, Solidity and Web3. ",
      "url": "https://github.com/Sudhanmanoharan/MarketPlace-BlockChain",
      "language": "TypeScript",
      "stars": 27,
      "forks": 12,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.590000",
      "updated_at": "2025-08-27T09:38:57.590000",
      "trend_date": "2025-08-27T09:38:57.590000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.591000"
    },
    {
      "id": 1683,
      "name": "chain-js",
      "full_name": "Open-Rights-Exchange/chain-js",
      "owner": "Open-Rights-Exchange",
      "description": "ChainJS is a Javascript helper library that provides a plug-in interface to multiple block chain libraries (like EOS, Ethereum, Algorand, etc.)",
      "url": "https://github.com/Open-Rights-Exchange/chain-js",
      "language": "TypeScript",
      "stars": 26,
      "forks": 10,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.591000",
      "updated_at": "2025-08-27T09:38:57.591000",
      "trend_date": "2025-08-27T09:38:57.591000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.591000"
    },
    {
      "id": 1628,
      "name": "SwasthyaChain-BlockChain-Based-Health-Management-System",
      "full_name": "gyaneshanand/SwasthyaChain-BlockChain-Based-Health-Management-System",
      "owner": "gyaneshanand",
      "description": "The project aims to use blockchain technology to create a user-focused electronic health record whilst maintaining a single true version of the user’s data.Swasthya Mitra is a decentralised platform that enables secure, fast and transparent exchange and usage of medical data.",
      "url": "https://github.com/gyaneshanand/SwasthyaChain-BlockChain-Based-Health-Management-System",
      "language": "Python",
      "stars": 23,
      "forks": 10,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.563000",
      "updated_at": "2025-08-27T09:38:57.563000",
      "trend_date": "2025-08-27T09:38:57.563000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.563000"
    },
    {
      "id": 1629,
      "name": "mnchecker",
      "full_name": "Aziroshin/mnchecker",
      "owner": "Aziroshin",
      "description": "A tool to check the health of masternode wallets, which currently only supports comparing the block count of a block explorer to that of a masternode, triggering a re-initialization of the masternode's block chain data if the discrepancy is evaluated as too great.",
      "url": "https://github.com/Aziroshin/mnchecker",
      "language": "Python",
      "stars": 23,
      "forks": 27,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.563000",
      "updated_at": "2025-08-27T09:38:57.563000",
      "trend_date": "2025-08-27T09:38:57.563000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.563000"
    },
    {
      "id": 1701,
      "name": "substreams-ethereum",
      "full_name": "streamingfast/substreams-ethereum",
      "owner": "streamingfast",
      "description": "Substreams development kit for Ethereum chains, contains Firehose Block model and helpers as well as utilities for Ethereum ABI encoding/decoding.",
      "url": "https://github.com/streamingfast/substreams-ethereum",
      "language": "Rust",
      "stars": 23,
      "forks": 8,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.598000",
      "updated_at": "2025-08-27T09:38:57.598000",
      "trend_date": "2025-08-27T09:38:57.598000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.598000"
    },
    {
      "id": 1630,
      "name": "SimpleBlockChain",
      "full_name": "qianqianjun/SimpleBlockChain",
      "owner": "qianqianjun",
      "description": "一个简单的区块链模型，学习区块链的笔记，使用python3 实现了区块链的基本原理。使用Flask 构建 peer to peer 网络。另外包含java版本的代码，java版本未完成。",
      "url": "https://github.com/qianqianjun/SimpleBlockChain",
      "language": "Python",
      "stars": 21,
      "forks": 15,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.563000",
      "updated_at": "2025-08-27T09:38:57.563000",
      "trend_date": "2025-08-27T09:38:57.563000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.564000"
    },
    {
      "id": 1631,
      "name": "PyChain",
      "full_name": "MainakRepositor/PyChain",
      "owner": "MainakRepositor",
      "description": "Basic Blockchain Implementation with Python with immutable hash, nonce and genesis block",
      "url": "https://github.com/MainakRepositor/PyChain",
      "language": "Python",
      "stars": 21,
      "forks": 1,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.564000",
      "updated_at": "2025-08-27T09:38:57.564000",
      "trend_date": "2025-08-27T09:38:57.564000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.564000"
    },
    {
      "id": 1717,
      "name": "blockchain-buildwheels",
      "full_name": "jianhuaixie/blockchain-buildwheels",
      "owner": "jianhuaixie",
      "description": "blockchain project ,build a public chain from zero.",
      "url": "https://github.com/jianhuaixie/blockchain-buildwheels",
      "language": "Go",
      "stars": 21,
      "forks": 10,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.605000",
      "updated_at": "2025-08-27T09:38:57.605000",
      "trend_date": "2025-08-27T09:38:57.605000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.605000"
    },
    {
      "id": 1702,
      "name": "blockchain",
      "full_name": "social-technologies/blockchain",
      "owner": "social-technologies",
      "description": "🌍 The Earth Blockchain on Polkadot (archived)",
      "url": "https://github.com/social-technologies/blockchain",
      "language": "Rust",
      "stars": 20,
      "forks": 8,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.599000",
      "updated_at": "2025-08-27T09:38:57.599000",
      "trend_date": "2025-08-27T09:38:57.599000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.599000"
    },
    {
      "id": 1718,
      "name": "cosmos-sdk-historical-query",
      "full_name": "larry0x/cosmos-sdk-historical-query",
      "owner": "larry0x",
      "description": "How to query a Cosmos chain at historical block heights in Rust, Go, JS, and Bash",
      "url": "https://github.com/larry0x/cosmos-sdk-historical-query",
      "language": "Go",
      "stars": 20,
      "forks": 2,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.605000",
      "updated_at": "2025-08-27T09:38:57.605000",
      "trend_date": "2025-08-27T09:38:57.605000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.605000"
    },
    {
      "id": 1632,
      "name": "blocksnap",
      "full_name": "jaydenwindle/blocksnap",
      "owner": "jaydenwindle",
      "description": "On-chain Data Snapshots Made Easy",
      "url": "https://github.com/jaydenwindle/blocksnap",
      "language": "Python",
      "stars": 19,
      "forks": 2,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.564000",
      "updated_at": "2025-08-27T09:38:57.564000",
      "trend_date": "2025-08-27T09:38:57.564000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.564000"
    },
    {
      "id": 1652,
      "name": "block-chain",
      "full_name": "shazin/block-chain",
      "owner": "shazin",
      "description": "A Spring Boot Based Implementation of Block Chain",
      "url": "https://github.com/shazin/block-chain",
      "language": "Java",
      "stars": 19,
      "forks": 14,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.578000",
      "updated_at": "2025-08-27T09:38:57.578000",
      "trend_date": "2025-08-27T09:38:57.578000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.578000"
    },
    {
      "id": 1653,
      "name": "Drug-Tracebility-in-suplychain-using-blockchain-java",
      "full_name": "swapniltake1/Drug-Tracebility-in-suplychain-using-blockchain-java",
      "owner": "swapniltake1",
      "description": "Drug traceability system is essentially important for public drug security and business of pharmaceutical companies, which aims to track or trace where the drug has been and where it has gone along the drug supply chain.",
      "url": "https://github.com/swapniltake1/Drug-Tracebility-in-suplychain-using-blockchain-java",
      "language": "Java",
      "stars": 19,
      "forks": 7,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.578000",
      "updated_at": "2025-08-27T09:38:57.578000",
      "trend_date": "2025-08-27T09:38:57.578000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.578000"
    },
    {
      "id": 1684,
      "name": "blockcore-explorer",
      "full_name": "block-core/blockcore-explorer",
      "owner": "block-core",
      "description": "Cross-Chain Multi-Chain Block Explorer",
      "url": "https://github.com/block-core/blockcore-explorer",
      "language": "TypeScript",
      "stars": 19,
      "forks": 23,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.591000",
      "updated_at": "2025-08-27T09:38:57.591000",
      "trend_date": "2025-08-27T09:38:57.591000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.592000"
    },
    {
      "id": 1703,
      "name": "data_chain",
      "full_name": "dirvine/data_chain",
      "owner": "dirvine",
      "description": "Data blocks can be chained to provide verifiable assuredness  that they contain network valid data and not injected.",
      "url": "https://github.com/dirvine/data_chain",
      "language": "Rust",
      "stars": 19,
      "forks": 12,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.599000",
      "updated_at": "2025-08-27T09:38:57.599000",
      "trend_date": "2025-08-27T09:38:57.599000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.599000"
    },
    {
      "id": 1633,
      "name": "block-chain-learn",
      "full_name": "licncnn/block-chain-learn",
      "owner": "licncnn",
      "description": "",
      "url": "https://github.com/licncnn/block-chain-learn",
      "language": "Python",
      "stars": 18,
      "forks": 4,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.564000",
      "updated_at": "2025-08-27T09:38:57.564000",
      "trend_date": "2025-08-27T09:38:57.564000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.565000"
    },
    {
      "id": 1634,
      "name": "many_abis",
      "full_name": "ackness/many_abis",
      "owner": "ackness",
      "description": "Get different DEX abis easily for block chain developers.",
      "url": "https://github.com/ackness/many_abis",
      "language": "Python",
      "stars": 18,
      "forks": 6,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.565000",
      "updated_at": "2025-08-27T09:38:57.565000",
      "trend_date": "2025-08-27T09:38:57.565000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.565000"
    },
    {
      "id": 1654,
      "name": "Mchain-core",
      "full_name": "MchainDevelopment/Mchain-core",
      "owner": "MchainDevelopment",
      "description": "Mchain block chain client",
      "url": "https://github.com/MchainDevelopment/Mchain-core",
      "language": "Java",
      "stars": 18,
      "forks": 10,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.579000",
      "updated_at": "2025-08-27T09:38:57.579000",
      "trend_date": "2025-08-27T09:38:57.579000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.579000"
    },
    {
      "id": 1719,
      "name": "missed-blocks-checker",
      "full_name": "solarlabsteam/missed-blocks-checker",
      "owner": "solarlabsteam",
      "description": "Tool to monitor missed blocks for Cosmos-chain validators",
      "url": "https://github.com/solarlabsteam/missed-blocks-checker",
      "language": "Go",
      "stars": 18,
      "forks": 18,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.606000",
      "updated_at": "2025-08-27T09:38:57.606000",
      "trend_date": "2025-08-27T09:38:57.606000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.606000"
    },
    {
      "id": 1685,
      "name": "aurascan",
      "full_name": "aura-nw/aurascan",
      "owner": "aura-nw",
      "description": "Beautiful block explorer for Aura Network and other Cosmos chains",
      "url": "https://github.com/aura-nw/aurascan",
      "language": "TypeScript",
      "stars": 17,
      "forks": 24,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.592000",
      "updated_at": "2025-08-27T09:38:57.592000",
      "trend_date": "2025-08-27T09:38:57.592000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.592000"
    },
    {
      "id": 1686,
      "name": "Tonomy-ID",
      "full_name": "Tonomy-Foundation/Tonomy-ID",
      "owner": "Tonomy-Foundation",
      "description": "Tonomy ID is the cross-platform mobile wallet (Android and iOS) for public and private Antelope blockchains. This application allows you to sign transactions on the block chain, share your DID and Verifiable Credentials containing your identity with others in a consensual way and log into web2 and web3 applications.",
      "url": "https://github.com/Tonomy-Foundation/Tonomy-ID",
      "language": "TypeScript",
      "stars": 17,
      "forks": 3,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.592000",
      "updated_at": "2025-08-27T09:38:57.592000",
      "trend_date": "2025-08-27T09:38:57.592000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.593000"
    },
    {
      "id": 1720,
      "name": "BlockChain_PoW_Simulation",
      "full_name": "Harry-hhj/BlockChain_PoW_Simulation",
      "owner": "Harry-hhj",
      "description": "IS416 Final Project. A PoW-based blockchain implementation with attackers trying fork attacks. Language: Go.",
      "url": "https://github.com/Harry-hhj/BlockChain_PoW_Simulation",
      "language": "Go",
      "stars": 17,
      "forks": 0,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.607000",
      "updated_at": "2025-08-27T09:38:57.607000",
      "trend_date": "2025-08-27T09:38:57.607000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.607000"
    },
    {
      "id": 1655,
      "name": "BigBananaBlockChain",
      "full_name": "CallMeDJ/BigBananaBlockChain",
      "owner": "CallMeDJ",
      "description": "大蕉的区块链实现",
      "url": "https://github.com/CallMeDJ/BigBananaBlockChain",
      "language": "Java",
      "stars": 16,
      "forks": 3,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.580000",
      "updated_at": "2025-08-27T09:38:57.580000",
      "trend_date": "2025-08-27T09:38:57.580000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.580000"
    },
    {
      "id": 1721,
      "name": "BlockChain",
      "full_name": "RaysKai/BlockChain",
      "owner": "RaysKai",
      "description": "LinkChain and Research papers",
      "url": "https://github.com/RaysKai/BlockChain",
      "language": "Go",
      "stars": 16,
      "forks": 5,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.607000",
      "updated_at": "2025-08-27T09:38:57.607000",
      "trend_date": "2025-08-27T09:38:57.607000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.607000"
    },
    {
      "id": 1722,
      "name": "BFBaas",
      "full_name": "wengerwu/BFBaas",
      "owner": "wengerwu",
      "description": "BFBaas Platform provides block chain serives to clients, assits industries to set business on block chain, and excavates commercial values of block chain.",
      "url": "https://github.com/wengerwu/BFBaas",
      "language": "Go",
      "stars": 16,
      "forks": 3,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.607000",
      "updated_at": "2025-08-27T09:38:57.607000",
      "trend_date": "2025-08-27T09:38:57.607000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.607000"
    },
    {
      "id": 1635,
      "name": "blockChainHW",
      "full_name": "Warmriver/blockChainHW",
      "owner": "Warmriver",
      "description": "",
      "url": "https://github.com/Warmriver/blockChainHW",
      "language": "Python",
      "stars": 15,
      "forks": 1,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.565000",
      "updated_at": "2025-08-27T09:38:57.565000",
      "trend_date": "2025-08-27T09:38:57.565000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.566000"
    },
    {
      "id": 1636,
      "name": "BlockChain",
      "full_name": "heroyf/BlockChain",
      "owner": "heroyf",
      "description": "",
      "url": "https://github.com/heroyf/BlockChain",
      "language": "Python",
      "stars": 15,
      "forks": 2,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.566000",
      "updated_at": "2025-08-27T09:38:57.566000",
      "trend_date": "2025-08-27T09:38:57.566000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.566000"
    },
    {
      "id": 1656,
      "name": "SimpleBlockChain",
      "full_name": "dottorm/SimpleBlockChain",
      "owner": "dottorm",
      "description": "",
      "url": "https://github.com/dottorm/SimpleBlockChain",
      "language": "Java",
      "stars": 15,
      "forks": 5,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.580000",
      "updated_at": "2025-08-27T09:38:57.580000",
      "trend_date": "2025-08-27T09:38:57.580000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.580000"
    },
    {
      "id": 1687,
      "name": "chainlink-hardhat-plugin",
      "full_name": "ChaosLabsInc/chainlink-hardhat-plugin",
      "owner": "ChaosLabsInc",
      "description": "A hardhat plugin for configuring price feed return values based on mined blocks.",
      "url": "https://github.com/ChaosLabsInc/chainlink-hardhat-plugin",
      "language": "TypeScript",
      "stars": 15,
      "forks": 1,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.593000",
      "updated_at": "2025-08-27T09:38:57.593000",
      "trend_date": "2025-08-27T09:38:57.593000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.593000"
    },
    {
      "id": 1704,
      "name": "fluent-impl",
      "full_name": "rust-alt/fluent-impl",
      "owner": "rust-alt",
      "description": "A procedural macro that generates chaining methods from non-chaining ones in an impl block.",
      "url": "https://github.com/rust-alt/fluent-impl",
      "language": "Rust",
      "stars": 15,
      "forks": 0,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.600000",
      "updated_at": "2025-08-27T09:38:57.600000",
      "trend_date": "2025-08-27T09:38:57.600000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.600000"
    },
    {
      "id": 1705,
      "name": "nbd-rs",
      "full_name": "rainlab-inc/nbd-rs",
      "owner": "rainlab-inc",
      "description": "[READ ONLY MIRROR] Network Block Storage server, written in Rust. Supports pluggable and chainable underlying storage",
      "url": "https://github.com/rainlab-inc/nbd-rs",
      "language": "Rust",
      "stars": 15,
      "forks": 1,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.600000",
      "updated_at": "2025-08-27T09:38:57.600000",
      "trend_date": "2025-08-27T09:38:57.600000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.600000"
    },
    {
      "id": 1723,
      "name": "btcpowermirror",
      "full_name": "coredao-org/btcpowermirror",
      "owner": "coredao-org",
      "description": "This project is used by CORE chain to verify Bitcoin blocks.",
      "url": "https://github.com/coredao-org/btcpowermirror",
      "language": "Go",
      "stars": 15,
      "forks": 2,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.607000",
      "updated_at": "2025-08-27T09:38:57.607000",
      "trend_date": "2025-08-27T09:38:57.607000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.607000"
    },
    {
      "id": 1637,
      "name": "BlockChain-Python",
      "full_name": "AbolfazlAdhami/BlockChain-Python",
      "owner": "AbolfazlAdhami",
      "description": "Basic BlockChain Python",
      "url": "https://github.com/AbolfazlAdhami/BlockChain-Python",
      "language": "Python",
      "stars": 14,
      "forks": 1,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.566000",
      "updated_at": "2025-08-27T09:38:57.566000",
      "trend_date": "2025-08-27T09:38:57.566000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.566000"
    },
    {
      "id": 1638,
      "name": "data_analysis",
      "full_name": "Cocos-BCX/data_analysis",
      "owner": "Cocos-BCX",
      "description": "block chain data analysis",
      "url": "https://github.com/Cocos-BCX/data_analysis",
      "language": "Python",
      "stars": 14,
      "forks": 1,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.567000",
      "updated_at": "2025-08-27T09:38:57.567000",
      "trend_date": "2025-08-27T09:38:57.567000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.567000"
    },
    {
      "id": 1657,
      "name": "toychain",
      "full_name": "wangxu0/toychain",
      "owner": "wangxu0",
      "description": "Simple block chain toy",
      "url": "https://github.com/wangxu0/toychain",
      "language": "Java",
      "stars": 14,
      "forks": 8,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.580000",
      "updated_at": "2025-08-27T09:38:57.580000",
      "trend_date": "2025-08-27T09:38:57.580000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.580000"
    },
    {
      "id": 1724,
      "name": "blockchain-supplychain",
      "full_name": "AIE-London/blockchain-supplychain",
      "owner": "AIE-London",
      "description": "Blockchain supplychain implementation (A.K.A all the chains)",
      "url": "https://github.com/AIE-London/blockchain-supplychain",
      "language": "Go",
      "stars": 14,
      "forks": 10,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.608000",
      "updated_at": "2025-08-27T09:38:57.608000",
      "trend_date": "2025-08-27T09:38:57.608000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.608000"
    },
    {
      "id": 1639,
      "name": "ELCC",
      "full_name": "Scalextrix/ELCC",
      "owner": "Scalextrix",
      "description": "Post solar PV energy generation data to SolarCoin block-chain",
      "url": "https://github.com/Scalextrix/ELCC",
      "language": "Python",
      "stars": 13,
      "forks": 5,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.567000",
      "updated_at": "2025-08-27T09:38:57.567000",
      "trend_date": "2025-08-27T09:38:57.567000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.567000"
    },
    {
      "id": 1725,
      "name": "stratos-chain-testnet",
      "full_name": "stratosnet/stratos-chain-testnet",
      "owner": "stratosnet",
      "description": "stratos block testnet genesis and config",
      "url": "https://github.com/stratosnet/stratos-chain-testnet",
      "language": "Go",
      "stars": 13,
      "forks": 15,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.608000",
      "updated_at": "2025-08-27T09:38:57.608000",
      "trend_date": "2025-08-27T09:38:57.608000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.608000"
    },
    {
      "id": 1726,
      "name": "BuildingBlockChain",
      "full_name": "dreamerjackson/BuildingBlockChain",
      "owner": "dreamerjackson",
      "description": "Building BlockChain",
      "url": "https://github.com/dreamerjackson/BuildingBlockChain",
      "language": "Go",
      "stars": 13,
      "forks": 3,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.608000",
      "updated_at": "2025-08-27T09:38:57.608000",
      "trend_date": "2025-08-27T09:38:57.608000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.609000"
    },
    {
      "id": 1640,
      "name": "BlockChain-In-HealthCare",
      "full_name": "kushaljh/BlockChain-In-HealthCare",
      "owner": "kushaljh",
      "description": "",
      "url": "https://github.com/kushaljh/BlockChain-In-HealthCare",
      "language": "Python",
      "stars": 12,
      "forks": 6,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.567000",
      "updated_at": "2025-08-27T09:38:57.567000",
      "trend_date": "2025-08-27T09:38:57.567000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.568000"
    },
    {
      "id": 1641,
      "name": "Pyblock",
      "full_name": "bhattsameer/Pyblock",
      "owner": "bhattsameer",
      "description": "Basic Block-chain + mining concept using python ",
      "url": "https://github.com/bhattsameer/Pyblock",
      "language": "Python",
      "stars": 12,
      "forks": 7,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.568000",
      "updated_at": "2025-08-27T09:38:57.568000",
      "trend_date": "2025-08-27T09:38:57.568000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.568000"
    },
    {
      "id": 1642,
      "name": "python-block-chain",
      "full_name": "GINK03/python-block-chain",
      "owner": "GINK03",
      "description": "python3によるblock chaineによる公文書などの改竄がないことの保証の例です",
      "url": "https://github.com/GINK03/python-block-chain",
      "language": "Python",
      "stars": 12,
      "forks": 2,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.568000",
      "updated_at": "2025-08-27T09:38:57.568000",
      "trend_date": "2025-08-27T09:38:57.568000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.569000"
    },
    {
      "id": 1643,
      "name": "Blockchain-python",
      "full_name": "InduprasadSR/Blockchain-python",
      "owner": "InduprasadSR",
      "description": "A simple block chain application developed using python,flask and rest API",
      "url": "https://github.com/InduprasadSR/Blockchain-python",
      "language": "Python",
      "stars": 12,
      "forks": 2,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.569000",
      "updated_at": "2025-08-27T09:38:57.569000",
      "trend_date": "2025-08-27T09:38:57.569000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.569000"
    },
    {
      "id": 1644,
      "name": "blockchain-demo",
      "full_name": "sumeetsarkar/blockchain-demo",
      "owner": "sumeetsarkar",
      "description": "Block chain concept demo program in python",
      "url": "https://github.com/sumeetsarkar/blockchain-demo",
      "language": "Python",
      "stars": 12,
      "forks": 0,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.569000",
      "updated_at": "2025-08-27T09:38:57.569000",
      "trend_date": "2025-08-27T09:38:57.569000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.569000"
    },
    {
      "id": 1645,
      "name": "blockchain-data-engineering-toolkit",
      "full_name": "autistic-symposium/blockchain-data-engineering-toolkit",
      "owner": "autistic-symposium",
      "description": "👾 blockchain infrastructure projects and resources (e.g., ethereum event scanner, on chain analysis, data pipelines, etc.)",
      "url": "https://github.com/autistic-symposium/blockchain-data-engineering-toolkit",
      "language": "Python",
      "stars": 12,
      "forks": 1,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.570000",
      "updated_at": "2025-08-27T09:38:57.570000",
      "trend_date": "2025-08-27T09:38:57.570000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.570000"
    },
    {
      "id": 1646,
      "name": "allonchainPy",
      "full_name": "allonchain/allonchainPy",
      "owner": "allonchain",
      "description": "• The first blockchain records both the consensus protocol and transaction data on chain. • Built multi fiat-based stable coins, e.g. EURA, USDA, RMBA. • Varing block size design. • PoS for protocol proof & PoW for transaction proof",
      "url": "https://github.com/allonchain/allonchainPy",
      "language": "Python",
      "stars": 12,
      "forks": 3,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.570000",
      "updated_at": "2025-08-27T09:38:57.570000",
      "trend_date": "2025-08-27T09:38:57.570000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.570000"
    },
    {
      "id": 1658,
      "name": "blockgame",
      "full_name": "mikera/blockgame",
      "owner": "mikera",
      "description": "A decentralised block game, 100% on-chain 3D universe",
      "url": "https://github.com/mikera/blockgame",
      "language": "Java",
      "stars": 12,
      "forks": 2,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.581000",
      "updated_at": "2025-08-27T09:38:57.581000",
      "trend_date": "2025-08-27T09:38:57.581000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.581000"
    },
    {
      "id": 1688,
      "name": "solana-transaction-tool",
      "full_name": "tomoima525/solana-transaction-tool",
      "owner": "tomoima525",
      "description": "Simple transaction tool for Solana Block Chain",
      "url": "https://github.com/tomoima525/solana-transaction-tool",
      "language": "TypeScript",
      "stars": 12,
      "forks": 3,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.593000",
      "updated_at": "2025-08-27T09:38:57.593000",
      "trend_date": "2025-08-27T09:38:57.593000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.593000"
    },
    {
      "id": 1689,
      "name": "Cross-L2-Actions",
      "full_name": "eco-incorp/Cross-L2-Actions",
      "owner": "eco-incorp",
      "description": "Proof of concept for using state proofs and L1 block data to verify cross-chain actions",
      "url": "https://github.com/eco-incorp/Cross-L2-Actions",
      "language": "TypeScript",
      "stars": 12,
      "forks": 2,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.593000",
      "updated_at": "2025-08-27T09:38:57.593000",
      "trend_date": "2025-08-27T09:38:57.593000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.594000"
    },
    {
      "id": 1647,
      "name": "Medical-Blockchain",
      "full_name": "joachimdorel/Medical-Blockchain",
      "owner": "joachimdorel",
      "description": "A blockchain implemented to follow drugs supply chain. This project was made while doing my memoir at the UTFSM in Valparaiso, Chile. The back-end of the blockchain uses mainly Python, and specifically the flask framework.",
      "url": "https://github.com/joachimdorel/Medical-Blockchain",
      "language": "Python",
      "stars": 11,
      "forks": 5,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.571000",
      "updated_at": "2025-08-27T09:38:57.571000",
      "trend_date": "2025-08-27T09:38:57.571000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.571000"
    },
    {
      "id": 1648,
      "name": "nanodb",
      "full_name": "mistakia/nanodb",
      "owner": "mistakia",
      "description": "Nano block-lattice / blockchain data in various formats for easy chain analysis",
      "url": "https://github.com/mistakia/nanodb",
      "language": "Python",
      "stars": 11,
      "forks": 2,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.571000",
      "updated_at": "2025-08-27T09:38:57.571000",
      "trend_date": "2025-08-27T09:38:57.571000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.571000"
    },
    {
      "id": 1659,
      "name": "blockChain_Server",
      "full_name": "bybywudi/blockChain_Server",
      "owner": "bybywudi",
      "description": "区块链中心服务器的JAVA实现",
      "url": "https://github.com/bybywudi/blockChain_Server",
      "language": "Java",
      "stars": 11,
      "forks": 5,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.581000",
      "updated_at": "2025-08-27T09:38:57.581000",
      "trend_date": "2025-08-27T09:38:57.581000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.581000"
    },
    {
      "id": 1660,
      "name": "WeChatWalletBlockChain",
      "full_name": "Maple-Chan/WeChatWalletBlockChain",
      "owner": "Maple-Chan",
      "description": "这是一个基于Spring Boot框架，微信小程序前端的，Hyperledger Fabric超级账本区块链框架的区块链钱包的Demo",
      "url": "https://github.com/Maple-Chan/WeChatWalletBlockChain",
      "language": "Java",
      "stars": 11,
      "forks": 2,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.581000",
      "updated_at": "2025-08-27T09:38:57.581000",
      "trend_date": "2025-08-27T09:38:57.581000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.582000"
    },
    {
      "id": 1706,
      "name": "blockrs",
      "full_name": "sergerad/blockrs",
      "owner": "sergerad",
      "description": "TUI for tailing chain data",
      "url": "https://github.com/sergerad/blockrs",
      "language": "Rust",
      "stars": 11,
      "forks": 0,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.601000",
      "updated_at": "2025-08-27T09:38:57.601000",
      "trend_date": "2025-08-27T09:38:57.601000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.601000"
    },
    {
      "id": 1661,
      "name": "jbcc",
      "full_name": "tiande-blockchain/jbcc",
      "owner": "tiande-blockchain",
      "description": "Java Block Chain Connector （区块链连接器）  http://tdchain.cn",
      "url": "https://github.com/tiande-blockchain/jbcc",
      "language": "Java",
      "stars": 10,
      "forks": 2,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.582000",
      "updated_at": "2025-08-27T09:38:57.582000",
      "trend_date": "2025-08-27T09:38:57.582000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.582000"
    },
    {
      "id": 1662,
      "name": "HydroBlock",
      "full_name": "arnabuchiha/HydroBlock",
      "owner": "arnabuchiha",
      "description": "Water management supply chain DApp ",
      "url": "https://github.com/arnabuchiha/HydroBlock",
      "language": "Java",
      "stars": 9,
      "forks": 3,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.582000",
      "updated_at": "2025-08-27T09:38:57.582000",
      "trend_date": "2025-08-27T09:38:57.582000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.582000"
    },
    {
      "id": 1663,
      "name": "BlockChain-Java",
      "full_name": "techflowing/BlockChain-Java",
      "owner": "techflowing",
      "description": "Java 实现区块链",
      "url": "https://github.com/techflowing/BlockChain-Java",
      "language": "Java",
      "stars": 8,
      "forks": 4,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.583000",
      "updated_at": "2025-08-27T09:38:57.583000",
      "trend_date": "2025-08-27T09:38:57.583000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.583000"
    },
    {
      "id": 1664,
      "name": "PHBS_BlockChain_2019",
      "full_name": "ZhangjieLyu/PHBS_BlockChain_2019",
      "owner": "ZhangjieLyu",
      "description": "For PHBS, Module 1",
      "url": "https://github.com/ZhangjieLyu/PHBS_BlockChain_2019",
      "language": "Java",
      "stars": 8,
      "forks": 3,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.583000",
      "updated_at": "2025-08-27T09:38:57.583000",
      "trend_date": "2025-08-27T09:38:57.583000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.584000"
    },
    {
      "id": 1690,
      "name": "on-chain-generator-viewer",
      "full_name": "ArtBlocks/on-chain-generator-viewer",
      "owner": "ArtBlocks",
      "description": "Example frontend to view artwork from the Art Blocks on-chain generator for convenience.",
      "url": "https://github.com/ArtBlocks/on-chain-generator-viewer",
      "language": "TypeScript",
      "stars": 8,
      "forks": 6,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.594000",
      "updated_at": "2025-08-27T09:38:57.594000",
      "trend_date": "2025-08-27T09:38:57.594000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.594000"
    },
    {
      "id": 1691,
      "name": "goldrush-block-explorer-ui",
      "full_name": "covalenthq/goldrush-block-explorer-ui",
      "owner": "covalenthq",
      "description": "A cross chain block explorer kit. 200+ Chains. Open-source. Customizable.",
      "url": "https://github.com/covalenthq/goldrush-block-explorer-ui",
      "language": "TypeScript",
      "stars": 8,
      "forks": 1,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.594000",
      "updated_at": "2025-08-27T09:38:57.594000",
      "trend_date": "2025-08-27T09:38:57.594000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.594000"
    },
    {
      "id": 1665,
      "name": "CareChain-Corda_Blockchain",
      "full_name": "saqib22/CareChain-Corda_Blockchain",
      "owner": "saqib22",
      "description": "A distributed ledger for storing medical records.",
      "url": "https://github.com/saqib22/CareChain-Corda_Blockchain",
      "language": "Java",
      "stars": 7,
      "forks": 2,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.584000",
      "updated_at": "2025-08-27T09:38:57.584000",
      "trend_date": "2025-08-27T09:38:57.584000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.584000"
    },
    {
      "id": 1692,
      "name": "calamar",
      "full_name": "topmonks/calamar",
      "owner": "topmonks",
      "description": "Block explorer for Polkadot and Kusama relay chains and their parachains",
      "url": "https://github.com/topmonks/calamar",
      "language": "TypeScript",
      "stars": 7,
      "forks": 17,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.594000",
      "updated_at": "2025-08-27T09:38:57.594000",
      "trend_date": "2025-08-27T09:38:57.594000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.595000"
    },
    {
      "id": 1693,
      "name": "Typescript-Generic-BlockChain",
      "full_name": "hidayatarg/Typescript-Generic-BlockChain",
      "owner": "hidayatarg",
      "description": "A Generic Blockchain TypeScript Repository",
      "url": "https://github.com/hidayatarg/Typescript-Generic-BlockChain",
      "language": "TypeScript",
      "stars": 7,
      "forks": 3,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.595000",
      "updated_at": "2025-08-27T09:38:57.595000",
      "trend_date": "2025-08-27T09:38:57.595000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.595000"
    },
    {
      "id": 1694,
      "name": "zeitgeist-subsquid",
      "full_name": "zeitgeistpm/zeitgeist-subsquid",
      "owner": "zeitgeistpm",
      "description": "Zeitgeist chain block indexer and processor that provides data sets for powerful GraphQL queries.",
      "url": "https://github.com/zeitgeistpm/zeitgeist-subsquid",
      "language": "TypeScript",
      "stars": 7,
      "forks": 4,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.595000",
      "updated_at": "2025-08-27T09:38:57.595000",
      "trend_date": "2025-08-27T09:38:57.595000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.595000"
    },
    {
      "id": 1695,
      "name": "Pharma-SupplyChain-Blockchain",
      "full_name": "MinavKaria/Pharma-SupplyChain-Blockchain",
      "owner": "MinavKaria",
      "description": "Sem 6 Mini Project",
      "url": "https://github.com/MinavKaria/Pharma-SupplyChain-Blockchain",
      "language": "TypeScript",
      "stars": 7,
      "forks": 0,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.595000",
      "updated_at": "2025-08-27T09:38:57.595000",
      "trend_date": "2025-08-27T09:38:57.595000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.596000"
    },
    {
      "id": 1666,
      "name": "BlockChain",
      "full_name": "JoyXieIsCool/BlockChain",
      "owner": "JoyXieIsCool",
      "description": "",
      "url": "https://github.com/JoyXieIsCool/BlockChain",
      "language": "Java",
      "stars": 6,
      "forks": 6,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.584000",
      "updated_at": "2025-08-27T09:38:57.584000",
      "trend_date": "2025-08-27T09:38:57.584000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.584000"
    },
    {
      "id": 1696,
      "name": "BonusBlock-chain",
      "full_name": "BBlockLabs/BonusBlock-chain",
      "owner": "BBlockLabs",
      "description": "",
      "url": "https://github.com/BBlockLabs/BonusBlock-chain",
      "language": "TypeScript",
      "stars": 6,
      "forks": 4,
      "tags": [],
      "created_at": "2025-08-27T09:38:57.596000",
      "updated_at": "2025-08-27T09:38:57.596000",
      "trend_date": "2025-08-27T09:38:57.596000",
      "keyword": "block chain",
      "scraped_at": "2025-08-27T09:38:57.596000"
    }
  ],
  "insights": [
    "最受欢迎的编程语言是 Python，占 30 个仓库",
    "平均星数为 94.1",
    "最热门的主题是 'ai'，出现在 110 个仓库中"
  ]
}